[
	{
		"id": "game",
		"title": "Русские Карты 2",
		"class": "Игры",
		"link": "https://news.dybka.ru/russian-cards-2",
		"description": "Это захватывающая карточная игра, разработанная специально для развития памяти и развлечения всех возрастных групп.",
		"content": "<h1>Русские Карты 2</h1><p>    Добро пожаловать в увлекательный мир «Русские Карты 2». Это захватывающая карточная игра, разработанная специально для    развития памяти и развлечения всех возрастных групп.</p><p>    В игре вам предстоит искать пару из широкого разнообразия карт, которые разложены перед вами. Запомни расположение карт    и находи соответствующие пары, пока все карты не будут убраны с игрового поля. Чем быстрее и точнее вы найдете все пары,    тем больше очков наберете!</p><p>    В «Русские Карты 2» есть различные режимы игры, включая захватывающий сюжетный режим, свободную игру для максимальной    гибкости и бесконечный режим, чтобы проверить вашу выносливость. Проходите обучение, чтобы познакомиться с правилами    игры.</p><p>    Играйте в «Русские Карты 2» на своем телефоне, компьютере или в браузере — выбор за вами! Игра доступна бесплатно для    скачивания.</p><p>    Нажмите на кнопку «Играть». Выберите режим игры: сюжет, свободная игра или бесконечная. И начинайте игру! На столе будут    разложены карты. Вам предстоит искать пары и открывать карты. Игра будет продолжаться, пока все карты не будут открыты.</p><p>    Играйте в сюжетный режим, если хотите открыть все карты. Играйте в свободную игру, чтобы выбрать карты, задний фон и    сложность игры. Выбирайте бесконечную игру, если хотите проверить свою выносливость.</p><p>    Покупайте задний фон в магазине, если хотите открыть их все для свободной игры. Возвращайтесь к игре каждый день, ведь    вы еще не прошли ее до конца. Удачи!</p><p>    Не упустите возможность развить свою память.</p><p>    Скачайте игру сейчас и отправьтесь в захватывающее путешествие по миру карт!</p><p>    <a href='//creagoo.ru/games/russiancards2/'>        Скачать    </a></p><p class='post--main-more'>19.03.23 12:00</p>",
		"year_publish": "2023"
	},
	{
		"id": "game",
		"title": "Babka On The Hunt",
		"class": "Игры",
		"link": "https://news.dybka.ru/babka-on-the-hunt",
		"description": "В этой увлекательной игре вы будете играть за бабушку, которая отправляется в путешествие по разным локациям России.",
		"content": "<h1>Babka On The Hunt: 2D Классика</h1><p>    Вы когда-нибудь задумывались, как было бы интересно отправиться в путешествие по России вместе с бабушкой? Теперь у вас    есть такая возможность – в мобильной игре 'Бабушка на охоте'!</p><p>    В этой увлекательной игре вы будете играть за бабушку, которая отправляется в путешествие по разным локациям России. Вам    предстоит посетить такие места, как Павловский Посад, больница, дом бабушки, планета Эксолон и даже лицей МФТИ им.    Капицы!</p><p>    Каждая локация представляет собой уникальный мир, где вас ждут интересные задания и приключения. Например, в больнице вы    должны помочь бабушке найти свою родственницу, которая заблудилась в коридорах больницы. А на планете Эксолон вы будете    искать детали для постройки космического корабля, чтобы вернуться на Землю.</p><p>    В игре вы будете использовать различные предметы и инструменты, чтобы решить головоломки и пройти уровни. Например, вы    можете использовать клюшку для гольфа, чтобы достать ключ из колодца, или использовать телефон, чтобы найти нужную    информацию.</p><p>    'Бабушка на охоте' – это не только увлекательная игра, но и замечательная возможность познакомиться с разными местами    России и узнать больше о культуре и традициях страны.</p><p>    Так что не ждите – отправляйтесь в путешествие вместе с бабушкой уже сегодня! Скачайте 'Бабушка на охоте' на свой    мобильный телефон и наслаждайтесь приключениями!</p><p>    <a href='//creagoo.ru/babkaonthehunt'>        Скачать    </a></p><p class='post--main-more'>19.03.23 12:00</p>",
		"year_publish": "2023"
	},
	{
		"id": "game",
		"title": "Sweetness",
		"class": "Игры",
		"link": "https://news.dybka.ru/sweetness",
		"description": "Sweetness – это увлекательная мобильная игра, в которой ты играешь за маленького исследователя, который путешествует по большому и неизвестному миру, чтобы найти самый сладкий сахар.",
		"content": "<h1>Sweetness</h1><p>    Sweetness – это увлекательная мобильная игра, в которой ты играешь за маленького исследователя, который путешествует по    большому и неизвестному миру, чтобы найти самый сладкий сахар.</p><p>    Твой герой – настоящий авантюрист, готовый исследовать все уголки этой волшебной страны, чтобы найти настоящий рай для    сладкоежек. Ему придется преодолеть много препятствий, обойти ловушки и победить всех врагов на своем пути. Но когда он    наконец найдет свой ценный трофей, все это окупится!</p><p>    Игра позволит тебе пройти увлекательное путешествие по миру различных локаций – от лесов и пустынь до городов и древних    замков. Каждая локация будет иметь свои особенности, а множество различных препятствий, забавных персонажей и    таинственных секретов не позволят тебе скучать.</p><p>    В Sweetness ты найдешь множество узнаваемых элементов от других игр: сбор монет, уклонение от ловушек и преодоление    препятствий. Но что делает эту игру такой особенной, это герой – маленький исследователь со своей слабостью к сладостям.    Он может проходить уровни благодаря своей любви к сахару – собирая конфеты и сладости на своем пути. Кроме того, на    своем пути он может обнаружить различные шоколадные монеты, которые помогут ему приобрести дополнительные умения и    преодолеть трудности.</p><p>    Игра Sweetness создана для тех, кто любит испытывать свои способности, брать на себя риски и находить новые приключения    на своем пути. Это идеальная игра для всех, кто готов с новыми силами и с огромной любовью продолжить свои сахарные    приключения.</p><p>    <a href='//creagoo.ru/games/sweetness'>        Скачать    </a></p><p class='post--main-more'>19.03.23 12:00</p>",
		"year_publish": "2023"
	},
	{
		"id": "game",
		"title": "Запомни Эти Карты",
		"class": "Игры",
		"link": "https://news.dybka.ru/remember-these-cards",
		"description": "Забудьте о скучных методах тренировки памяти! Теперь вы можете с легкостью и с удовольствием находиться в стиле с нашей новой игрой – Запомни эти карты!",
		"content": "<h1>Запомни эти карты</h1><p>    Забудьте о скучных методах тренировки памяти! Теперь вы можете с легкостью и с удовольствием находиться в стиле с нашей    новой игрой – Запомни эти карты!</p><p>    Здесь вы будете тренировать свою память, запоминая расположение карт, выстраивая свою    логику и улучшая свои результаты с каждым прохождением.</p><p>    Но это еще не все! Мы привносим вам возможность кастомизировать    свои карты и менять локации, чтобы вы могли наслаждаться процессом игры с новым взглядом каждый раз!</p><p>    Откройте большое    количество карт и локаций, и каждый раз становитесь лучше и быстрее! Примите вызов, станьте чемпионом и покажите свои    навыки в Запомни эти карты!</p><p>    <a href='//creagoo.ru/games/rememberthesecards/'>        Скачать    </a></p><p class='post--main-more'>19.03.23 12:00</p>",
		"year_publish": "2023"
	},
	{
		"id": "game",
		"title": "Камень Ножницы Бумага",
		"class": "Игры",
		"link": "https://news.dybka.ru/rock-paper-scissors",
		"description": "Камень, ножницы, бумага, кажется, это игра, которая знакома каждому из нас с детства.",
		"content": "<h1>Камень ножницы бумага</h1><p>    Камень, ножницы, бумага, кажется, это игра, которая знакома каждому из нас с детства. Она проста, увлекательна, но    иногда может стать скучной, поэтому было создано множество различных вариаций этой игры. Сегодня я хочу рассказать вам о    мобильной игре «Камень, ножницы, бумага», которая позволяет сохранять ходы и переводить язык.</p><p>    Самая замечательная фича этой игры это возможность сохранять ходы в игре. И это не просто сохранять, а сохранять    детальную информацию о каждом ходе. Вы можете видеть, какой выбор сделал ваш противник на каждом ходу в игре; это    позволяет вам определить его предпочтения и настроение. С помощью этой функции вы можете разрабатывать стратегии для    следующих игр.</p><p>    Еще одна отличная фича этой игры это возможность перевода на различные языки. У вас есть возможность настроить язык    интерфейса, чтобы он соответствовал вашему языку. Доступны несколько языков, включая русский и английский.    Это позволяет играть в игру на своем родном языке.</p><p>    Как мне кажется, игра «Камень ножницы бумага» является идеальным способом провести свободное время и развлечься. Она    проста в использовании, захватывающая и может стать отличным способом для того, чтобы общаться с друзьями и    социализироваться. Эта игра постоянно обновляется и развивается, и вы можете быть уверены, что вам не будет скучно при    игре в нее.</p><p>    В заключение, игра «Камень ножницы бумага» с сохранением ходов и возможностью перевода на различные языки является    одной из лучших мобильных игр на рынке. Она имеет простой и легкий интерфейс, что позволяет любому человеку начать    играть в нее. Если вы еще не попробовали эту игру, рекомендую сделать это прямо сейчас. Уверен, вы не пожалеете!</p><p>    <a href='//creagoo.ru/games/rockpaperscissors/'>        Скачать    </a></p><p class='post--main-more'>19.03.23 12:00</p>",
		"year_publish": "2023"
	},
    {
		"id": "update-aquarium",
		"title": "Аквариум",
		"class": "Проекты",
		"link": "https://news.dybka.ru/aquarium",
		"description": "Платформа для взаимодействия пользователей между собой.",
		"content": "<h1>Аквариум</h1><p>    Платформа для взаимодействия пользователей между собой.</p><h2>    Соцсеть</h2><p>    Обычно такие проекты называются социальными сетями, но данное название будет слишком избыточное для текущей стадии    развития проекта.</p><p>    Да, Аквариум на данный момент находится на стадии разработки. А если быть точным, то на момент января 2024 года    мы обновляем движок нашей платформы.</p><h2>    Какие задачи решает</h2><p>    Моя насмотренность за рынком буквально сама задала нишу, которая пустует на данный момент — простая соцсеть для    публикации картинок.</p><p>    Большая проблема текущих соцсетей — огромное изобилие лишнего контекта. Другими словами, сейчас ряд соцсетей    имеют слишком перегруженный интерфейс, из-за чего пользоваться такими соцсетями очень тяжело.</p><p>    Самый известный пример в ру сегменте — ВКонтакте. Данная соцсеть имеет богатый функционал, но сильно перегруженный интерефейс.</p><p>    А все остальные соцсети отвечают за другой рынок пользователей:</p><p>    И так далее. Приводить примеры можно бесконечно. Именно поэтому остро необходимо разработать такую социальную платофрму,    которая будет тесно ассоциироваться с изображениями.</p><h2>    Поставленная задача</h2><p>    Поставленная задача — занять нишу соцсетей и ассоциироваться с картинками у пользователей. Сделать это будет невероятно тяжело,    потому что придется конкурировать с «большими» игроками на рынке, которые уже заняли большую часть аудитории.</p><h2>    Конкуренты</h2><p>    Было замечено, что другие разработчики уже пытались занять данную нишу. Но почти у каждого выходило просто ужасно.</p><p>    И вот ряд главных проблем, почему о их проектах даже не стоит говорить:</p><p>    Ну и, наверное, самая главная проблема — поддержка проекта. Проекты просто не поддерживаются спустя несколько    недель разработки, и это большая проблема не только для их проектов, но и для Аквариума.</p><p>    Поддерживать проект действительно тяжело, потому что он требует много внимания. На данный момент мы не выпускаем    обновления для Аквариума, потому что сконцентрированы на обновлении движка проекта.</p><h2>Почему у нас получится?</h2><p>    У нас обязательно получится, и вот почему.</p><p>    Прежде всего, мы сконцентрированы не на заработок денег, а на занятие ниши удобной платформой,    которой будет хотеться пользоваться.</p><p>    Наша цель — не прибыль, хоть это и входит в метрики, а создание качественного решения,    за который можно получить грант и реализовать его.</p><p>    В том случае, если разработка проекта не пойдет, мы не останемся у разбитого карыта: у нас будет    опыт в разработке данной платформы, и мы будем открыты для предложений рынка.</p><h2>Преимущества</h2><p>    Для того, чтобы быть интересным — нужна уникальность проекта. Мы не говорим о том, что наш проект уникален,    мы говорим, в чём наш проект уникален.</p><p>    Прежде всего — морская тематика. Это просто замечательно для тех людей, кто не любит подводный мир.    А для тех, кому он безразличен, не обязательно ассоциироваться с подводным миром.</p><p>    Продуманный дизайн. Мы не думаем о том, чтобы платформу было легко разрабатывать, мы думаем о том,    чтобы платформой было удобно пользоваться.</p><p>    Мы проводим аналитику наших решений, и с помощью гипотез доводим наши решения для идеала. Мы всегда открыты    к предложениям: <a href='mailto:daniil@dybka.ru'>daniil@dybka.ru</a>!</p><h2>Функционал уже сейчас</h2><p>    Уже сейчас у пользователя есть возможность зарегистрироваться на платформе с помощью почты или сервисов,    настроить отображение аккаунта, добавить уникальное изображение на аватарку, шапку и фон пользователя, ввести    имя и фамилию или ограниться никнеймом, искать пользователей по соцсети, и самое главное — добавлять посты!</p><p>    Определенно, пользователи будут приходить на платформу именно из-за постов на нашей платформе, поэтому    мы стараемся сделать их как можно качественее, поэтому работаем над ними уже несколько недель.</p><p>    У пользователя будет возможность добавлять текст к посту, форматировать его, добавлять смайлики и менять    задний фон поста.</p><p>    Всё это — просто замечательно, потому что у пользователей появится возможность делится своим мнением!</p><h2>    Развитие проекта</h2><p>    А об развитии мы поговорим в <a href='/plans-for-the-development-of-the-aquarium/'>отдельной</a> статье.</p><p>    До скорого!</p><p class='post--main-more'>08.01.24 12:00</p>",
		"year_publish": "2024"
	},
	{
		"id": "update-aquarium",
		"title": "План развития Аквариума",
		"class": "Проекты",
		"link": "https://news.dybka.ru/plans-for-the-development-of-the-aquarium",
		"description": "План развития Аквариума.",
		"content": "<h1>План развития Аквариума</h1><p>    В <a href='/aquarium'>основной</a> статье мы говорили о новом    и интересном проекте Аквариум.</p><p>    Теперь пришла пора рассказать о том, как этот проект будет развиваться.    Постараемся максимально ясно рассказать о планах развития проекта, и    привести примеры.</p><h2>Новый движок</h2><p>    Первое обновление, над которым происходит работа уже сейчас — переход на новый движок Laravel.</p><p>    У меня уже был печальный опыт работы с движком Laravel, поэтому когда я начал создавать    проект Аквариум, я не планировал внедрять в него какой-либо движок.</p><p>    Но, к сожалению, уже сейчас я понимаю, что дальше разрабатывать проект в таком формате у меня не выйдет.    На данный момент проект разрабатывается на чистом PHP. Пусть я и применяю различные удобные модули,    чтобы разработка проекта шла быстрее, в течением времени проект будет все тяжелее, и его    будет все сложнее разрабатывать.</p><p>    Для того, чтобы добиться успеха, нужно обязательно масштабировать проект. И если мы говорим о разработке    на чистом PHP, то масштабирование проекта с каждым разом будет все сложнее и будет занимать все больше времени.</p><p>    Данное решение нельзя оставлять в таком формате, именно поэтому проект Аквариум начинает переходить на движок Laravel.</p><h2>Посты, фотографии и социальное взаимодействие</h2><p>    Следующий шаг, который мы совершим — добавление новых возможностей для пользователей. И прежде всего,    будут добавлены посты в открытом виде, будет добавлена возможность добавлять фотографии в соцсети.</p><p>    И также мы продолжим развивать социальное взаимодействие между пользователями. Новый движок Laravel    позволит нам решить большое количество проблем, именно поэтому мы без проблем сможем внедрить    новые решения для пользователей.</p><h2>Приложения</h2><p>    Ещё одно важное решение для социальной сети — удобные приложения для разных платформ. Прежде всего,    мы разработаем мобильное приложение для операционной системы Андроид.</p><p>    Приложение для операционной системы Андроид уже разрабатывается на данный момент. После разработки у пользователей    будет полный функционал, как и в веб версии приложения, но только локально на устройстве пользователя.</p><p>    Далее будут разработаны приложения для операционных систем iOS, macOS, Windows и Linux.    Мы постараемся обеспечить удобством всех пользователей</p><h2>OAuth авторизация</h2><p>    Мы добавим возможность интегрировать вход в аккаунт с помощью технологии OAuth для Аквариума. У пользователей    появится возможность входить в аккаунт в два клика с помощью технологии OAuth Аквариума.</p><p class='post--main-more'>08.01.24 12:00</p>",
		"year_publish": "2024"
	},
	{
		"id": "update-aquarium",
		"title": "Попытки создать Аквариум",
		"class": "Проекты",
		"link": "https://news.dybka.ru/attempts-to-create-an-aquarium",
		"description": "Попытки создать Аквариум.",
		"content": "<h1>Попытки создать Аквариум</h1><p>    Проект Аквариум — проект для социального взаимодействия между пользователями.    В <a href='/aquarium'>этой</a> статье мы говорили о проекте, и в <a href='/plans-for-the-development-of-the-aquarium'>этой</a>    о развитии проекта. Теперь настала пора поговорить о том, как мы пытались разработать    проект на протяжении нескольких лет.</p><h2>live.creagoo.ru</h2><p>    Самый первый веб-проект, в который я интегрировал авторизацию в аккаунт, оказался    проект под кодовым названием «live.creagoo.ru».</p><p>    Получилось так, что мне было очень интересно добавить возможность авторизацию в аккаунт с помощью    веб-технологий. До интеграции данного решения в этот проект, я создавал аккаунт в мобильных    играх на Unity, а до этого добавлял возможность авторизироваться в аккаунт на Python, и сохранять    информацию в базу данных.</p><p>    Поэтому я уже разрабатывал проекты, в которых фигурировал личный кабинет. Но у меня не было возможности    добавить удобный интерфейс управления личным кабинетом. Поэтому я стал работать над проектом live.creagoo.ru.</p><p>    Первое решение с личным кабинетом оказалось ненадежным, почти в любой момент    можно было наткнуться на ошибку, либо вообще не авторизоваться по каким-то причинам.    Это можно понять, потому что это был первый опыт в создании веб-проекта с личным кабинетом.</p><p>    По итогу я не реализовал даже половину тех возможностей, которые хотел добавить, и закрыл проект.</p><h2>Creagoo-Аккаунт</h2><p>    В тот момент данный проект с личным кабинетом назывался интересным образом: «Creagoo-Аккаунт».</p><p>    Через некоторое время я решил переименовать проект сначала в «Creagoo Аккаунт», а после в    «Creagoo ID».</p><h2>Creagoo ID</h2><p>    Вторая попытка разработать проект с личным кабинетом оказалась более успешной, потому что у меня почти    получилось реализовать тот функционал, который был необходим социальной сети.</p><p>    Была добавлена возможность авторизации в аккаунт, создания аккаунта, изменения фотографии,    и редактирования личных данных. Это почти весь функционал, который я реализовал.</p><p>    Мне хотелось поскорее добавить разный функционал в проект, но вышло так, что у меня оставалось все    меньше свободного времени, именно поэтому у меня не вышло довести проект до рабочего состояния,    пусть и проект был доступен в сети.</p><p>    Но уже тогда я отправил данный проект на конкурс, и занял призовое место с этим решением.</p><h2>Изменения</h2><p>    Я учился на своих ошибках, и продолжал пытаться разработать проект, который мне очень хотелось разработать.    Благодаря этому упорству и моим стараниям, уже сейчас я могу говорить о проекте Аквариум без стыда.</p><p>    На проект Аквариум было потрачено много сил, и мы будем продолжать работать над этим проектом.</p><p class='post--main-more'>08.01.24 12:00</p>",
		"year_publish": "2024"
	},
	{
		"id": "update-special",
		"title": "Новый дизайн и чистота",
		"class": "Проекты",
		"link": "https://news.dybka.ru/new-design-and-cleanliness",
		"description": "Добро пожаловать на медиасообщество Special!",
		"content": "<h1>Новый дизайн и чистота</h1><img src='https://news.dybka.ru/january-playlist-5-records-for-a-winter-mood/cap.jpg' alt='Новый дизайн и чистота'><p>    Добро пожаловать на медиасообщество Special!</p><h2>    Обновлен логотип</h2><p>    На сайте медиасообщества Special был обновлен логотип.    Старый логотип использовал основной шрифт платформы.</p><p>    В новом логотипе было добавлено больше свободного места.    Логотип стал более чистым.</p><h2>    Обновлена платформа</h2><p>    Помимо того, что был обновлен логотип, также был обновлен дизайн    платформы, и внешний вид. Было добавлено больше вспомогательных элементов.</p><h2>    Изменение URL</h2><p>    Теперь страницы медиасообщества доступны с корня системы. Если раньше    статья располагалась по адресу: «/tech/example».</p><p>    То сейчас страница будет доступна по адресу: «/example».</p><h2>    Новая вкладка новостей</h2><p>    На сайте медиасообщества стала доступна вкладка новостей:    актуальных событий.</p><h3>Убран цветной фон</h3><p>    Цветной фон больше недоступен.</p><h3>    Вернулся старый шрифт</h3><p>    На платформу вернулся старый шрифт. Мягкий, милый и приятный.</p><p class='post--main-more'>02.10.23 15:00</p>",
		"year_publish": "2023"
	},
	{
		"id": "update-special",
		"title": "Архив новостей. «Поделиться». Обновление дизайна",
		"class": "Проекты",
		"link": "https://news.dybka.ru/news-archive-share-design-update",
		"description": "В праздничные дни для медиа Special выпускается крупное обновление, которое включает масштабные изменения визуального содержимого медиа Special, а также изменение количества статей. Наслаждайтесь.",
		"content": "<h1>Архив новостей. «Поделиться». Обновление дизайна</h1><img src='https://news.dybka.ru/january-playlist-5-records-for-a-winter-mood/cap.jpg' alt='Архив новостей. Поделиться. Обновление дизайна'><p>В праздничные дни для медиа Special выпускается крупное обновление,которое включает масштабные изменения визуального содержимогомедиа Special, а также изменение количества статей. Наслаждайтесь</p><h3>Архив теперь доступен всем!</h3><p>С 15 апреля архив медиа Special стал доступен в тестовом режиме.До 1 мая архив находился на стадии добавлении статьей.</p><p>Статьи архива представляют собой старые статьи Creagoo Блога, которыйявляется новостным медиа, предшествовавшим медиа Special.</p><p>11 декабря 2022 года было решено закрыть Creagoo Блог из-за ряда проблем,связанных с данным медиа. 15 января 2023 года медиа Special стало доступнымвсем пользователям. 1 мая 2023 года архив становится доступным для всех, и новоемедиа Special полностью заменяет собой старый Creagoo Блог.</p><h3>Ссылки активны</h3><p>Старые ссылки с Creagoo Блога стали доступными для переадресации на новоемедиа Special.</p><h3>Новый дизайн страницы статьи</h3><p>В конце апреля был добавлен новый дизайн страницы статьи. Первая статья,опубликованная в новом стиле — «Обновление медиа канала Special».</p><p>С того момента новый дизайн был улучшен. Добавлена поддержка мобильного вида.Изображение на фоне стало лучше видно. Заголовок лучше читается. Кнопки «шапки»имеют больше контраста с фоновым изображением.</p><h3>«Поделиться статьей»</h3><p>Нововведение — возможность поделиться статьей с другими пользователями.Для этого следует нажать на кнопку «Поделиться» на главном экране, ввыпадающем списке выбрать площадку для публикации и совершить публикациюстатьи на другую платформу. Если у вас нет желания публиковать статьюна другую платформу — у вас есть возможность скопировать ссылку на статью.</p><h3>Новый шрифт</h3><p>Новый шрифт медиа Special стал лучше. Новый шрифт должен повлечь за собой новоевосприятие медиа Special. Новый шрифт представляет собой самое лучшее предыдущегошрифта, избавившись от лишних деталей.</p><h3>Кнопка «назад»</h3><p>При переходе на страницы медиа Special в «шапке» слева появляется кнопка, позволяющаявернуться назад. Кнопка «Вернуться назад» позволяет спусться на уровень ниже.Новая кнопка «назад» доступна не только для компьютеров, но и для мобильных устройств.</p><h3>Мобильный вид</h3><p>Мобильная «шапка» получила больше возможностей. Вместо старой «шапки» до обновления 1 мая,новая «шапка» получила возможность перейти на главный экран, не заходя в мобильное меню.Так же новые возможности: вернуться назад, создать новую статью, открыть меню.</p><p>Теперь меню открывается отдельной кнопкой. На главном экране вместо кнопки «назад»появляется кнопка «Создать статью».</p><h3>Находится в тестовом режиме</h3><p>Ожидайте все изменения медиа Special в скором времени!</p><p class='post--main-more'>17.04.23 12:00</p>",
		"year_publish": "2023"
	},
	{
		"id": "update-special",
		"title": "Улучшение дизайна. Многоязычность. Доступность",
		"class": "Проекты",
		"link": "https://news.dybka.ru/great-news-channel-special",
		"description": "16 апреля на сайте медиа Special было выпущено крупное обновление с массовыми изменениями. Давайте подробнее поговорим про обновление.",
		"content": "<h1>Улучшение дизайна. Многоязычность. Доступность</h1><img src='https://news.dybka.ru/january-playlist-5-records-for-a-winter-mood/cap.jpg' alt='Улучшение дизайна. Многоязычность. Доступность'><p>16 апреля на сайте медиа Special было выпущено крупное обновление с массовыми изменениями.Давайте подробнее поговорим про обновление.</p><h3>Многоязычность сайта</h3><p>Теперь медиа Special поддерживает многоязычность. Это означает, что пользователи с разных странмогут создавать контент друг для друга на удобной площадке.</p><p>Страницы с переводом представляют собой отдельную часть сайта. Стили и прочие элементызагружаются с основного домена, что обеспечивает быструю скорость загрузки и 100%получение содержимого пользователями.</p><h3>Цветной фон</h3><p>Фон на сайте теперь представляет собой цвет в зависимости от темы: черный или белый.Ранее использовалась уникальная картинка, что негативно влияло на доступность содержимого,загрузку страниц.</p><p>Отказ от уникального фона повлечет за собой прирост скорости. Вместе с тем, для лиц с ограниченнымивозможностями здоровья читать статьи будет приятнее из-за отсутствия ряби в глазах.</p><h3>Новый формат страницы записи</h3><p>Страница записи имеет новый дизайн: используется дизайн стекла на сайте,изображение записи стало фоновым, содержимое отделилось от названия,добавлено большое удобств.</p><p>Записи, написанные до 17 апреля 2023 года будут также доступны в старом дизайне.Новые страницы станут появляться с обновленным дизайном страницы.</p><p>Смотрите все изменения на медиа Special: <a href='//news.dybka.ru'>news.dybka.ru</a>.</p><p class='post--main-more'>17.04.23 12:00</p>",
		"year_publish": "2023"
	},
	{
		"id": "update-creagoo",
		"title": "Упрощение, улучшение и «Поделиться»",
		"class": "Проекты",
		"link": "https://news.dybka.ru/change-creagoo-ru-simplify-improve-and-share",
		"description": "Новый сайт creagoo.ru был разработан в декабре 2022 года. За это время я успел разработать новый медиа канал для Creagoo и прочих сервисов dybka.ru.",
		"content": "<h1>Упрощение, улучшение и «Поделиться»</h1><img src='https://news.dybka.ru/january-playlist-5-records-for-a-winter-mood/cap.jpg' alt='Упрощение, улучшение и поделиться'><p>    Новый сайт creagoo.ru был разработан в декабре 2022 года. За это время я успел разработать новый медиа канал для Creagoo    и прочих сервисов dybka.ru. В разработке у меня появились новые практики, которые я внедрил в новый сайт Creagoo.</p><h3>Улучшение дизайна</h3><p>    Первостепенное, что меняется в разработках — улучшается и упрощается дизайн. Что и было внедрено в новую версию сайта    Creagoo. Дизайн стал немного проще, понятнее.</p><p>    Были убраны излишние элементы в дизайне, которые только портили его и нагружали.</p><p>    Теперь пользоваться сайтом стало еще приятнее и проще!</p><h3>    Убраны лишние страницы и добавлены новые</h3><p>    Было решено переработать логику некоторых страниц, из-за чего они стали ненужны. И напротив — появились новые страницы,    которых до этого не было.</p><h3>    Карточки игр и их страницы</h3><p>    Были изменены карточки проектов, теперь они не отличаются по дизайну. Было решено убрать нагруженность в дизайне    карточек, поэтому они стали выглядеть лучше.</p><p>    Также страницы игр были изменены и упрощены для пользователя. На актуальных проектах будет отображена возможность    скачать игру. Кнопка актуальной платформы для скачивания стала выглядеть лучше. Логика работы JavaScript файлов была    изменена и улучшена.</p><p>    Добавлена кнопка «Поделиться» на страницах игр Creagoo. Чтобы ею воспользоваться требуется нажать на иконку под    названием игры. После нажатия появится модальное окно, в котором можно выбрать платформу на которую будет отправлена    страница игры. У вас есть возможность и просто скопировать ссылку на страницу игры и поделиться ею там, где Вам это    будет удобнее всего.</p><h3>    Шапка и футер</h3><p>    Шапка была упрощена, теперь ей пользоваться проще. Было решено сделать шапку в 2-х состояниях: компьютер и мобильный.    Больше нет режима для планшетов, потому что это нагружало использования шапкой для пользователей.</p><p>    Теперь в случае мобильной версии при нажатии на логотип появится меню, в котором можно сделать все нужное: сменить тему,    перейти на нужную страницу или связаться с разработчиком.</p><p>    В случае с футером было решено добавить к нему дополнительный элемент дизайна: информация под основным футером. Теперь    на каждой странице можно ознакомиться с нужными ссылками или перевести страницу на английский язык.</p><p class='post--main-more'>25.03.23 12:00</p>",
		"year_publish": "2023"
	},
	{
		"id": "update-creagoo",
		"title": "Новый сайт creagoo.ru",
		"class": "Проекты",
		"link": "https://news.dybka.ru/novyy-sayt-creagoo-ru",
		"description": "С начала разработок сайтов я старался создавать все больше сайтов, которыми будут пользоваться люди. Мне всегда была интересна данная отрасль. Первые сайты, которые я разрабатывал были именно для Creagoo.",
		"content": "<h1>Новый сайт creagoo.ru</h1><img src='https://news.dybka.ru/january-playlist-5-records-for-a-winter-mood/cap.jpg' alt='Новый сайт creagoo.ru'><p>С начала разработок сайтов я старался создавать все больше сайтов, которыми будут пользоваться люди. Мне всегда былаинтересна данная отрасль. Первые сайты, которые я разрабатывал были именно для Creagoo.</p><p>На <a href='//creagoo.ru/site.html' target='_blank'>странице</a> Creagoo «Развитие сайта за 4 года» я вкратце рассказал, какие технологии использовал при созданиипрошлых сайтов. Рассказал кратко и совсем не рассказал о нововведениях в сайте creagoo.ru. Исправим это!</p><h3>Сайт 2019 года на PHP</h3><p>Первый продукт, который вышел в массы — сайт на PHP с кодом в базе данных MySQL. Выглядело решение действительно слабо инеоптимально. Я не оптимизировал код, почти не использовал никакие стили. Лишь начинал развиваться в данном направлении.</p><p>Вообще, первый сайт, который я разработал был на чистом HTML, а решение с использованием PHP и даже базы данных кажетсяболее сильным, но на самом деле, я не далеко ушел от предыдущего решения на HTML, тк PHP использовался как приемщикстраниц с базы данных.</p><p>Фактически, я мог использовать все те же страницы HTML, что было бы намного удобнее из-за использования IDLE впрограммировании. Да, я не сказал, но код для сайта я писал в простом input-поле. Я не могу описать, насколько трудноэто было.</p><h3>Взял готовую верстку</h3><p>Следующим шагом — я взял готовую верстку с сайта с примерами и загрузил ее на сайт в формате HTML. В это время я начинаюизучать, что такое теги и для чего они нужны. Я немного стал продвигаться в HTML и моя структура сайта была изменена: яотказался от лишнего бэкенда и перешел полностью на статичное решение.</p><p>Единственная проблема этого подхода была в том, что я не мог использовать модульность на сайте. Все повторяющиесяэлементы на сайте выносятся в отдельные файлы, но в тот момент я еще не перешел к данному решению, из-за чего разработкабыла более трудной.</p><p>Но зато уже этот сайт использовал более лучший подход к созданию страниц. Я наконец-то начал использовать стили, из-зачего сайт стал выглядеть более презентабельным.</p><p>Теперь появилась неполная поддержка мобильных устройств. Неполная из-за моей неопытности в разработке сайтов. Я плохопонимал, что должно входить в поддержку мобильной версии.</p><h3>Троянский конь WordPress</h3><p>Я долго подготавливал сервер к использованию CMS WordPress, тк у меня была установлена старая версия PHP на сервере, авозможности обновить версию PHP у меня не было. Из-за этого мне пришлось «угадывать» версию CMS WordPress, чтобы выбратьнужную.</p><p>Скажу сразу — использованием CMS WordPress я недоволен из-за отсутствия оптимизации на сайте. CMS старается загрузитьвсе файлы, но совсем не думает о подходе к загрузке и оптимизации материалов на сайте.</p><p>Если проанализировать большое количество CMS-систем и сайтов, которые на них написаны — можно лицезреть медленную инеоптимизированную загрузку страниц сайта. Хотя это является самым важным фактором.</p><p>Я уже молчу о доступности для лиц с ОВЗ или же возможности использовать полный функционал HTML с редактора CMSWordPress. Кстати, редактор CMS WordPress действительно неудобный. Я им пользовался и почти все время сразу же переходилна вид с HTML-кодом.</p><h3>Bootstrap 5</h3><p>Из-за больших проблем с такой CMS-системой как WordPress я решил отказаться от использования CMS-систем для сайта, иперешел на изучения PHP и фреймворка Bootstrap 5.</p><p>Я уже пытался разработать сайт на Bootstrap, но тогда была лишь 4 версия фреймворка, и у меня не получилось сдружиться сфреймворком. Решил отказаться от использования Bootstrap, но через время снова перешел на его изучение и применение.</p><p>Я стал смотреть на примеры, какие мне доступны для использования компоненты. Я смотрел, как может выглядеть мой сайт впримерах. И день за днем я добавлял на сайт все больше элементов, чтобы подружиться с фреймворком.</p><p>Я стал добавлять на сайт JavaScript для возможности смены темы. Я старался по-максимому использовать возможности PHP, иначал использовать модульность на сайте. Какое это было счастье для меня, когда многие элементы сайта я смог вынести вотдельные файлы, откуда их просто подключать и использовать на всех страницах.</p><p>Я долгое время работал в связке PHP + Bootstrap 5. Менял структуру проекта, добавлял что-то новое, но был верен PHP. Дотого момента, как не попробовал что-нибудь новое для сайта.</p><h3>И это новое — сборщик пакетов Gulp</h3><p>С Gulp’ом создавать сайты получается куда проще. На выходе я получаю максимально простой сайт на HTML уже со всеминужными элементами на странице.</p><p>Gulp позволяет настроить сборку проекта в папку по заданным правилам: оптимизация, замена, сжатие, модульность идоступность. Писал код стало куда приятнее и проще. Я действительно рад, что перешел на использование Gulp’а.</p><p>У меня долго не получалось заставить работать сборщик пакетов из-за того, но спустя 2 года моих мучений у меня вышлозаставить его работать. Зато теперь я добавляю на сайт много всего интересного.</p><h3>Нововведения сайта 2023</h3><p>Я рад, что вы остается с Creagoo. Следите за новыми играми. И удачи!</p><p class='post--main-more'>19.03.23 12:00</p>",
		"year_publish": "2023"
	},
	{
		"id": "have-macbook",
		"title": "Пиратки на макбуке",
		"class": "Техника",
		"link": "https://news.dybka.ru/pirates-on-the-macbook",
		"description": "В обычной жизни люди часто пользуются пиратскими программами. Далеко не всегда это только из-за отсутствия желания платить за продукт. В некоторых случаях плата за продукт слишком большая и постоянная. В других же просто нет возможности оплатить какой-то продукт.",
		"content": "<h1>Пиратки на макбуке</h1><p>    Пиратить — это плохо!</p><p>    Сразу хочу обозначить, что я не поддерживаю пиратство в любом виде. Пользуйтесь только официальными программами.</p><h2>Пиратство в обычной жизни</h2><p>    В обычной жизни люди часто пользуются пиратскими программами. Далеко не всегда это только из-за отсутствия желания    платить за продукт. В некоторых случаях плата за продукт слишком большая и постоянная. В других же просто нет    возможности оплатить какой-то продукт.</p><p>    Пиратские программы, в основе, позволяют познакомиться с «демо» версией программы. А дальше человек сам решает, стоит ли    ему покупать лицензию или же оставаться на пиратской версией.</p><h2>Вирусы в пиратках</h2><p>    Пиратские программы позволяют бесплатно пользоваться софтом. Это подразумевает тот факт, что в исходнике программы    имеются модификации, которые могут считаться за вирусы.</p><p>    Но вместе с теми «вирусами», которые позволяют бесплатно пользоваться программами, еще существуют вирусы, которые    являются угрозами уже для самого пользователя. И это весьма частое явление: наличие негативно влияющей программы в    пиратских программах.</p><p>    Вирус может следить за пользователем через веб-камеру. Может отправлять какие-то данные мошеннику. Может снимать видео и    делать прочие противоправные дела. Вирусы никому не нравятся. Но при скачивании пиратских программ часто появляется    сообщение, что в исполняемом файле могут находиться вирусы.</p><p>    Что именно это за вирусы проверить бывает трудно: нужные для бесплатной работы с программой или вирусы, нацеленные    против пользователя. Поэтому многие стараются доверять определенным сайтам для скачивания пиратских программ. Либо же    устанавливают антивирусы, которые могут негативно влиять на бесплатную работу программ.</p><h2>Пиратов почти нет в Америке</h2><p>    К сведению, в Америке почти не развиты «пираты», потому что это дело сильно наказуемо.</p><h2>Программы на макбуке</h2><p>    Перейдем к основной сути статьи. Пиратские программы на макбуке есть. Я расскажу о способах, как обойти скачивание    пиратских программ. Не расценивайте это как инструкцию к действию.</p><h3>Специальные сайты</h3><p>    Скачать программы для макбука вы можете через специальные сайты. Установка максимально простая: очень часто достаточно    следовать инструкции в файле README.md. И вы сможете скачать нужный пакет программ к себе на макбук.</p><p>    Сам макбук старается не давать вам так просто запустить программы для скачивания. Ознакомьтесь с советами при скачивании    на тематических ресурсах.</p><h3>Аккаунты с приложениями</h3><p>    Есть один интересный способ скачивания официальных программ. Данный способ сможет подойти не только для макбука, а и для    всех устройств от Apple.</p><p>    Суть способа заключается в том, что вы покупаете не сами программы, а специальные аккаунты, на которых уже когда-то были    куплены данные программы, и вам будет оставаться только скачать эти самые программы.</p><h3>Опасность при скачивании</h3><p>    Первое, что может угрожать вашей безопасности — это вирусы. Хоть и на макбуке вирусы не так сильно распространены, все    равно будьте осторожны при скачивании определенных программ к себе на устройство.</p><p>    Второе, это те самые аккаунты. В некоторых случаях, если вы будете входить в чужой Apple ID, ваше устройство можно будет    заблокировать с того Apple ID, в который вы вошли. В App Store вы можете войти в аккаунт отдельно, от вашего основного    Apple ID. Насколько мне известно, уже таким образом получить доступ к вашему устройству не получится.</p><h2>Заключение</h2><p>    На макбуке вы можете двигаться в полной мере. Совершайте сделки. Скачивайте нужные программы. И наслаждайтесь    использованием своей техники. Удачи!</p><p class='post--main-more'>08.01.24 12:00</p>",
		"year_publish": "2024"
	},
	{
		"id": "have-ipad",
		"title": "Почему я решил перейти на iPad mini 5?",
		"class": "Техника",
		"link": "https://news.dybka.ru/why-did-i-decide-to-upgrade-to-the-ipad-mini-5",
		"description": "В 2022 году я купил себе айфон и не думал больше покупать технику Apple. Через несколько недель я купил себе макбук и не думал больше покупать технику Apple. Через год я заменил айфон, макбук, купил несколько планшетов. Когда я же остановлюсь…",
		"content": "<h1>Почему я решил перейти на iPad mini 5?</h1><p>    Уже как несколько месяцев я очень активно использую iPad mini 5 и абсолютно доволен этим.</p><h2>Схема использования</h2><p>    В 2022 году я купил себе айфон и не думал больше покупать технику Apple. Через несколько недель я купил себе макбук и не    думал больше покупать технику Apple. Через год я заменил айфон, макбук, купил несколько планшетов. Когда я же    остановлюсь…</p><p>    Но всей этой техникой я пользуюсь в свое время. Телефон используется для выхода на улицу или как удобное компактное    устройство. На макбуке я произвожу работу или трудовую деятельность.</p><p>    А в оставшееся время я пользуюсь айпадом. Очень удобно взять с собой компактное устройство с большой диагональю, которым    приятно пользоваться и смотреть контент.</p><h2>Что я делаю на планшете</h2><p>    Я не программирую на айпаде, не создаю что-то. Для всего этого у меня есть макбук.</p><p>    Но на айпаде мне очень удобно смотреть различные ролики. Пока я смотрю ролики, сбоку могу вывести телеграм, а когда не    нужен — могу удобно его свернуть.</p><p>    Айпад отлично подходит для различных чатов, мессенджеров и в целом общения. Удобно устраивать телефонные общения. Либо    общаться в чате.</p><p>    Приятно читать различные статьи, книги. Можно скачать книгу, установить в стандартное приложение книг и удобно читать    книгу. Либо же открывать страницы на сайтах и проделывать те же операции.</p><p>    Иногда хочется просто полежать в кровати и ничего не поделать. Для этого тоже отлично подходит айпад.</p><p>    А в некоторых случаях хочется и поиграть. Как раз есть айпад, на котором все это можно устроить без проблем с большими    удобствами.</p><h2>Моя рекомендация</h2><p>    Лично моя рекомендация — айпад стоит брать. Он отлично подходит для самых разных задач: отдых, учеба, небольшая трудовая    деятельность.</p><p>    Но что по поводу выбора планшета? Если хочется большую диагональ и производительность — это айпад про. Если хочется    большую диагональ и сэкономить — это айпад эир. Если хочется удобства — это айпад мини.</p><p>    Лично я не могу рекомендовать айпад обычной версии. Я в большей степени считаю его «пробником». Лучше присмотреться к    другим версиям айпада.</p><h2>Завершение</h2><p>    Я очень рад, что решил обновить свой планшет. Я всем рекомендую выбирать для себя отличную технику.</p><p>    Спасибо, что прочли статью. Оставайтесь со Special!</p><p class='post--main-more'>08.01.24 12:00</p>",
		"year_publish": "2024"
	},
	{
		"id": "have-ipad",
		"title": "Программирование на Айпаде",
		"class": "Техника",
		"link": "https://news.dybka.ru/programming-on-ipad-mini-5",
		"description": "Я попробовал разные айпады мини: mini 1, mini 4, mini 5. Сейчас я доволен iPad mini 5, недавно написал статью о планшете. Мой основной планшет: iPad mini 5. Мой ноутбук: MacBook Pro 2017 года.",
		"content": "<h1>Программирование на Айпаде</h1><p>    В этой статье я хотел бы рассмотреть очень интересную тему. Правда ли программисты выбирают айпад для программирования?</p><h2>Мой сетап</h2><p>    Я попробовал разные айпады мини: mini 1, mini 4, mini 5. Сейчас я доволен iPad mini 5, недавно написал статью о    планшете.</p><p>    Мой основной планшет: iPad mini 5. Мой ноутбук: MacBook Pro 2017 года.</p><h2>Айпад вместо макбука</h2><p>    Люди часто рекомендуют использовать следующий сетап: купить айпад про, клавиатуру к нему и использовать в таком    комплекте айпад для программирования или какой-то работы.</p><p>    Но что фактически можно делать на планшете? На планшете можно открыть GitHub Codespaces. Можно использовать какую-нибудь    программу для программирования, но вряд ли получится использовать планшет для среднего по размерам проекта.</p><p>    На планшете не получится запустить локальный сервер для web-приложения. Не получится установить модули. Есть возможность    подключиться к серверу по SSH и программировать на сервере.</p><h2>Минусы айпада как планшета</h2><p>    Хорошо, мы разобрали вариант, что можно делать на планшете для программирования. Список маленький. Возможно какую-нибудь    небольшую программку запрограммировать. Возможно использовать Swift Playground.</p><p>    Но еще не стоит забывать некоторую особенность: если использовать планшет с клавиатурой, то он будет дороже, больше    весить и иметь меньше функционала.</p><h2>Мой опыт</h2><p>    Лично я, конечно, пробовал устанавливать различные программы для программирования на планшет. Сейчас я ничем из этого не    пользуюсь. Мне намного проще и удобнее использовать макбук.</p><p>    Я запустал GitHub Codespaces — это очень интересная технология, но почти что неиспользуемая мною.</p><h2>Вывод</h2><p>    Использовать планшет как устройство для программирования возможно, но если повышать уровень программирования, то однажды    в любом случае придется переходить на макбук или другой ноутбук.</p><p>    К сожалению, но сейчас айпад совсем не подходит для программирования. Возможно это получится исправить, если у айпада    появится поддержка Linux в терминале. Но это лишь мечты…</p><p>    Спасибо, что прочли данную статью! Оставайтесь со Special.</p><p class='post--main-more'>08.01.24 12:00</p>",
		"year_publish": "2024"
	},
	{
		"id": "",
		"title": "Копия или оригинал",
		"class": "Техника",
		"link": "https://news.dybka.ru/copy-or-original-which-to-choose",
		"description": "Перед людьми стоит соблазн: можно купить копию, которая будет выглядеть как оригинал, и быть «крутым». Давайте на личном примере разберем, что плохого в том, что Петя купить себе копию наушников, а не оригинал.",
		"content": "<h1>Копия или оригинал — что выбрать</h1><p>    Спойлер: только оригинал</p><p>    Перед людьми стоит соблазн: можно купить копию, которая будет выглядеть как оригинал, и быть «крутым». Давайте на личном    примере разберем, что плохого в том, что Петя купить себе копию наушников, а не оригинал.</p><h2>Петя решился купить копию</h2><p>    Начинаем с самого начала: Петя Васьков имеет в своем кармане 3990 рублей, которые он откладывал с обедов. Петя умный    человек, поэтому думает, что может купить себе копию AirPods Pro под видом оригинала за маленькую цену.</p><p>    Если Петя купит себе крутые наушники, то будет крутым в компании друзей, его начнут уважать и почитать, а друзьям он    станет советовать покупать только качественную технику.</p><h2>Ищем магазин</h2><p>    Итак, для поиска магазина с покупкой копии наушников Петя обращается на Авито. Там Петя ищет объявления с продажей    наушников за низкую цену: всего 1500 рублей, когда другие стоят от 8000 рублей.</p><p>    И тут Петя думает, что сможет сэкономить 2490 рублей, и решается купить наушники еще и для мамы. Петя долго выбирает,    какие именно наушники купить. Ищет объявления. И спустя время находит.</p><h2>Назначает встречу</h2><p>    Петя звонит продавцу, договаривается о встрече. Продавец любезно соглашается, предлагает встретиться у его дома. И Петя    ждет той самой встречи.</p><p>    На встрече Пете дают возможность распаковать наушники, проверить работу звука и всего функционала. Петя остается    невероятно довольным, ведь буквально за 3000 рублей он смог купить 2 пары наушников: для себя и для мамы.</p><h2>Спустя 2 недели</h2><p>    Но спустя 2 недели Петя замечает, что мамины наушники перестали заряжаться. А его и вовсе не включаются. Петя пробует    разные зарядки, нажимает разные кнопки и ничего.</p><p>    Петя решается обратиться к продавцу, на что получает игнор: продавец отказывается возвращать деньги на наушники. И Петю    берет злость. Петя пишет негативный отзыв под объявлением.</p><p>    Проходит 1 час после публикации объявления — отклонено. «Как так?!» — думает Петя, ведь он покупал наушники, они    оказались плохого качества. Петя смотрит причину отклонения отзыва: «Сделка не состоялась».</p><p>    Петя пишет в тех. поддержку, ему отвечают, что Петя не общался с продавцом. И действительно, сделка происходила по    телефону, а истории звонков у него не осталось.</p><h2>По итогу</h2><p>    Петю сильно обманули. Ему продали плохой товар под видом оригинала. Или Петя сам себя обманул, потому что хотел купить    китайские наушники под видом оригинала.</p><p>    И самое страшное, что ситуация может произойти наоборот: Петя мог не знать, что покупает китайские наушники. Давайте я    расскажу, как не попасть в руки мошенников при покупке наушников от Apple.</p><h2>Как не купить копии AirPods Pro</h2><p>    Лично я уже успел попасться на обман при покупке наушников. К сожалению, мне пришлось испытать все вышеперечисленное на    себе. Правда я понимал, что покупаю копию, а не оригинал.</p><p>    Но что я делал, чтобы не попасть на обман? На самом деле, все просто. Достаточно попросить фотографию верхней крышки    наушников: в оригинальных наушниках там спрятаны магниты. Если посветить вблизи — они проявятся.</p><p>    И на этом и попадаются продавцы. Те, кто продает копии отказываются фотографировать магниты в наушниках, потому что их    просто там нет.</p><p>    Помните, чтобы не попасть в руки мошенников — подготовьтесь перед покупкой: посмотрите обучающие ролики, в которых вам    расскажут, как проверить наушники перед покупкой.</p><p>    Удачи!</p><p class='post--main-more'>08.01.24 12:00</p>",
		"year_publish": "2024"
	},
	{
		"id": "have-macbook",
		"title": "Макбук М1",
		"class": "Техника",
		"link": "https://news.dybka.ru/macbook-m1",
		"description": "В 2021 году я мечтал о макбуке, просто макбуке. А о том, что у меня может быть макбук на М1 я даже и мечтать не мог. Тогда для меня он казался невероятно дорогим.",
		"content": "<h1>Макбук М1</h1><p>    Новый макбук. Новый обзор</p><p>    Всем привет! На связи разработчик Даниил. Вот у меня появился новый макбук, и это означает, что    пора создавать новый обзор.</p><p>    Пройдемся как обычно: почему купил, зачем купил, и доволен ли. Погнали!</p><h2>Почему я перешел на макбук М1</h2><p>    В 2021 году я мечтал о макбуке, просто макбуке. А о том, что у меня может быть макбук на М1 я даже    и мечтать не мог. Тогда для меня он казался невероятно дорогим.</p><p>    Сначала я <a href='/macbook-pro-2014-13-review/'>купил</a> себе макбук 2014 года. Был невероятно доволен,    но он лагал и был старым.</p><p>    Затем я <a href='/macbook-2017-review/'>обновился</a> до версии 2017 года, о которой скучаю до сих пор.</p><p>    А сейчас у меня прекрасный макбук М1. Переход обуславливается простым обновлением техники: попробовать    что-то новое, и вложить средства.</p><h2>Цель покупки</h2><p>    Первая цель покупки — купить долгожданный макбук, до которого я шел долгие годы.</p><p>    Я очень хотел попробовать данный макбук в действии, его скорость, и компактность.</p><p>    До этого макбука у меня была pro версия 2017 года. И ещё одна причина, по которой я обновился    — слишком нанедежная клавиатура 2017 года.</p><h3>Проблема клавиатуры макбука 2017</h3><p>    И не подумайте неправильно: клавиатура макбука 2017 года лучшая, которой я когда-либо пользовался.    Она лучшая среди всех клавиатур. Но у нее есть одна большая проблема — слишком низкий ход клавиш,    из-за чего клавиатура может выйти из строя, клавиши могут залипать или вовсе не нажиматься.</p><p>    Такую проблему можно исправить, но у меня этот макбук был почти год, да и состояние макбука было плохое,    поэтому я решился обновляться.</p><h2>Поговорим о макбуке</h2><p>    Давайте поговорим конкретно о макбуке: первое впечатление, что могу сказать, для кого макбук и    что могу посоветовать.</p><h3>Первое впечатление</h3><p>    Макбук оказался невероятно производительным. Любая программа открывается менее чем за 1 секунду.    Сложные программы такие как Android Studio или Xcode работают невероятно быстро и без проблем.    Больше нет потребности долго ждать загрузки чего-либо.</p><p>    Скорость макбука действительно поражает. Спустя 2 недели после покупки я так и не смог привыкнуть    к скорости макбука, поэтому после открытия какой-либо программы по привычке начинаю ждать ее открытия,    хотя это уже не требуется.</p><h3>Клавиатура</h3><p>    Конечно, клавиатура на макбуке 2017 года была самая лучшая и удобная. Но пока я пользовался этой    клавиатурой, я думал, как не сломать ее. И это было большой проблемой.</p><p>    Ты получаешь удовольствие от использовании клавиатуры на макбуке М1. Она такая же хорошая,    как и остальные клавиатуры. Не промахиваешься по кнопкам, все нажимается отлично. Но    никакого «вау» эффекта не происходит.</p><h3>Экран</h3><p>    Экран поддерживает True Tone — приятное дополнение, но это точно не та функция,    из-за которой стоит покупать макбук.</p><h3>Состояние</h3><p>    Идеальное состояние. Вот чему я действительно сильно удивился, так это идеальному состоянию макбука.    У меня не было макбука, который не был бы где-то поцарапан или задет.</p><p>    На макбуке 2014 года я заменил ножки, термопасту, полностью почистил его, приклеил батарею, приклеил    защитную пленку... Это можно перечислять бесконечно.</p><p>    На макбуке 2017 года я заменил термопасту, полностью почистил макбук и постарался освежить его.</p><p>    А с макбуком М1 мне не пришлось ничего делать: ничего чистить или менять. Это просто потрясающе!</p><h2>Пассивное охлаждение</h2><p>    На макбуке Air установлено пассивное охлаждение — это означает, что у макбука нет куллеров. И    если в случае с макбуком на 12 дюймов это было большой проблемой, то вот для макбука на М1 это    только плюс.</p><h2>Почему Air?</h2><p>    На самом деле, я хотел бы рассмотреть Pro версию макбука на М1, потому что у меня всегда были только    Pro версии макбука. Но я не выбрал эту версию только по одной причине — наличием Touch Bar'а, абсолютно    ненужной и мешающейся технологии.</p><p>    И я ни разу не жалею о своем выборе. Я выбрал действительно потрясающее устройство, которое    успеет многое со мной пройти.</p><p>    Выбирайте отличную технику. И всем удачи!</p><p class='post--main-more'>08.01.24 12:00</p>",
		"year_publish": "2024"
	},
	{
		"id": "have-ipad",
		"title": "Обзор на iPad mini 5",
		"class": "Техника",
		"link": "https://news.dybka.ru/ipad-mini-5",
		"description": "Когда-то в статье про айпад мини 4 я говорил, что не очень сильно желаю переходить на айпад мини 5. И вот, свершилось. Делаем обзор!",
		"content": "<h1>Обзор на iPad mini 5</h1><p>    Когда-то в <a href='/ipad-mini-4-is-an-ambiguous-device/'>статье</a> про айпад мини 4 я говорил,    что не очень сильно желаю переходить на айпад мини 5. И вот, свершилось. Делаем обзор!</p><h2>Почему я выбрал именно mini 5</h2><p>    У меня есть mini 4. До сегодняшнего дня мне хватало его для всех задач. Есть только 1 минус: убитый аккумулятор.    Из-за    этого и производительность страдает, и мне приходится постоянно ходить с зарядкой.</p><p>    На время я решил закрыть глаза на данный недостаток, но уже через неделю активного использования я стал уставать от    этого. Я решил, что мне нужно обновить айпад. Я мог бы заменить аккумулятор, но мне хотелось айпад лучше, у mini 4    есть    ряд недостатков. Возможно как-нибудь я расскажу о них.</p><p>    По началу мой выбор пал на iPad 8-го поколения. Но я не решился брать данный планшет из-за его размеров, наличия    воздушной прослойки и памяти в 32гб. Вариант в 128гб слишком «жирный» для меня.</p><p>    Далее я стал думать насчет iPad Pro 2018 года. Но ряд недостатков лично для меня оттолкнули меня от покупки: большие    размеры, большая цена, новый дизайн. Я пока что не хочу переходить на новый дизайн, мне больше нравится старый    вариант с    кнопкой и рамками.</p><p>    Потом я стал задумываться о mini 6. Но все тот же новый дизайн, более маленький аккумулятор и высокая цена стали    причиной отказаться от покупки.</p><p>    Так и привела меня дорога к iPad mini 5. Устройству, которое отлично подходит для моих задач.</p><h2>Сравнение с iPad mini 4</h2><p>    В свое время я писал статью про iPad mini 4. Я действительно влюбился в данное устройство, но, к сожалению, в полной    мере перейти на iPad mini 4 у меня не получилось. Слабая батарея и процессор не смогли мне обеспечить полный комфорт    в    использовании.</p><p>    Я думал, стоит ли мне переходить на более новую версию планшета. По итогу я решился перейти и абсолютно не жалею    это.</p><p>    У iPad mini 5 и iPad mini 4 есть ряд ключевых отличий. Во-первых, iPad mini 5 2019 года, из-за чего является более    новым    планшетом. В новой версии установлен более сильный процессор от iPhone Xr. Благодаря чему пользоваться планшетом    намного    комфортнее.</p><p>    Батарея — ключевой фактор при выборе устройства, а именно — состояние изношенности. И у iPad mini 5 все просто    отлично!    Пользоваться планшетом можно с утра и до самого вечера без каких-либо проблем.</p><p>    Из мелочей: у планшета другое расположение кнопок, поддержка Apple Pencil 1-го поколения, улучшенная камера. Но это    особо не используется на практике.</p><h2>Опыт эксплуатации</h2><p>    Из-за слабого процессора и малой емкости аккумулятора я не мог полностью понять, почему всем так нравятся айпады. Но    вместе с iPad mini 5 я смог понять, в чем же дело.</p><p>    <b>Большая диагональ</b>: устройством удобнее пользоваться, чем телефоном. Иногда так и хочется посмотреть что-то в    интернете, почитать или что-то еще. На телефоне диагональ маленькая. А планшет — это отличный выбор в таких случаях.</p><p>    <b>Красивые и плавные анимации</b>: планшетом очень удобно пользоваться из-за плавных анимаций. Благодаря этому    пользоваться планшетом еще приятнее.</p><p>    <b>Дополнительный функционал</b>: можно использовать планшет как второй монитор или перевести курсор на планшет.    Можно    использовать планшет в качестве демонстрации, вывести референс. Или использовать Apple Pencil для рисования.</p><p>    <b>Игры</b>: на планшете очень круто играть в мобильные игры. Запустить какую-нибудь стратегию. Или какую-нибудь    другую    игру. Обычно у меня мало времени, чтобы играть в игры на ПК. А вот на планшете — само то.</p><p>    <b>Работа</b>: о программировании на планшете я поговорю в <a href=''>отдельной</a> статье.</p><h2>Завершение</h2><p>    Это не все, что я хочу сказать о планшете. Читайте другие статьи про iPad mini 5.</p><p>    Спасибо, что прочли статью. Оставайтесь вместе со Special!</p><p class='post--main-more'>08.01.24 12:00</p>",
		"year_publish": "2024"
	},
	{
		"id": "have-macbook",
		"title": "Обзор на макбук 2017 года",
		"class": "Техника",
		"link": "https://news.dybka.ru/macbook-2017-review",
		"description": "9 апреля 2023 года у меня появился макбук 2017 года в постоянном использовании. Давайте поговорим о данном устройстве: почему я его выбрал, стоит ли брать и какие есть альтернативы.",
		"content": "<h1>Обзор на макбук 2017 года</h1><p>    9 апреля 2023 года у меня появился макбук 2017 года в постоянном использовании. Давайте поговорим о данном устройстве:    почему я его выбрал, стоит ли брать и какие есть альтернативы.</p><h3>Размышления до покупки</h3><p>    На самом деле, с техникой Apple я дружу уже порядка года. Все началось с макбука 2014 года, после которого я обзаводился    айфонами, наушниками, планшетами от Apple. Покупка новой техники упрощало взаимодействие с предыдущей, потому что    создавалась единая экосистема устройств.</p><p>    Уже после долгого времени я стал понимать лучше технику Apple. Я общался с разными людьми: кто-то негативно относился к    Apple, кто-то же наоборот, обожал продукцию именно яблочной техники. Но абсолютно никто не оставался в стороне.</p><p>    Я влюбился в макбук 2014 года. У меня еще не было такого опыта взаимодействия с техникой. На маке все казалось таким    простым, таким удобным. Я не могу описать, какое удовольствие было вновь приходить домой и садиться работать за    макбуком.</p><p>    Windows оставляла больше количество недовольства в своем использовании. И совсем наоборот про macOS. Я точно решил, что    техника Apple отлично подходит для решения моих вопросов. Поэтому я даже не задумываюсь над тем, технику какой компании    мне стоит брать.</p><h3>Обновление макбука</h3><p>    Макбук 2014 года оставался для меня невероятно любимым и удобным в использовании устройством. Но слабость в работе и    старый дизайн все больше порождали в моей голове мысли об обновлении макбука до более свежей модели.</p><p>    Я стал анализировать рынок макбуков и выбрал для себя отличную нишу как с точки зрения функционала, так и с финансовой    точки зрения. Самым выходным устройством для покупки оказался макбук 2017 года.</p><h3>Первое впечатление</h3><p>    Перед покупкой я стал проверять устройство, и уже во время проверки я был поражен, что техника способна сочетать в себе    столько плюсов: малый размер, удобство использования, отличный трекпад, прекрасная клавиатура и невероятный дизайн. Все    это заставило влюбиться в технику Apple снова.</p><p>    Перед покупкой макбука 2017 года я находил мнение людей, которые негативно отзывались о клавиатуре устройства, о    отсутствии портов и о «деликатности» использования техники. Что я понял за время использования макбука:</p><h3>Мнение после покупки</h3><p>    Для меня на текущий момент мнения людей о макбуке 2017 года совсем не оправдались. Многие говорили плохо об устройстве.    Но лично я остался невероятно довольным техникой.</p><p>    Каждый раз я хочу поскорее вернуться домой, чтобы снова сесть за работу на макбуке. Создавать новые проекты на маке    стало одним удовольствием. Теперь я официально поставил macOS Monterey и могу создавать приложения для iOS без    каких-либо проблем.</p><h3>Альтернативные устройства</h3><p>    Спойлер: альтернатив в данном сегменте нет. А теперь подробнее: макбук не является устройством, где нужна большая    производительность, макбук отлично подходит для решения других задач.</p><p>    Макбук себе выбирают дизайнеры, программисты, маркетологи, стартаперы и учащиеся. Но и для других задач макбук будет    отлично подходить. К примеру, на макбуке на M1 вы без проблем можете создавать 3D модели, заниматься прототипированием    или работать с большими данными.</p><p>    Макбук является классовым устройством, который точно будет замечен в публике. Покупка макбука — статус. Возможно кто-то    выбирает его именно из-за бренда. Но я уверен, что добрая половина пользователей выбирают макбук из-за его невероятного    удобства в использовании.</p><p>    Рыночная цена за макбук 2017 года невероятно низкая. Особенно, если смотреть объявления на Б/У рынке, то найти для себя    макбук 2017 года в отличном состоянии не составляет труда.</p><p>    За заплаченную цену вы получаете отличное устройство, альтернатив для которого просто не существует. Даже если и    получится найти ноутбук за такую же цену на Windows, он точно не сможет сравниться ни с одним из макбуков.</p><p>    Как минимум, я уверен, что качество сборки устройства не будет выполнено на таком же уровне, как и у макбука. Красота    внешнего вида. Удобство использования. И прекрасная macOS. Все это — незаменимые преимущества макбука над любым другим    ноутбуком. Поэтому найти альтернативу данному макбуку можно только среди другой техники от Apple.</p><h3>Подробнее про характеристики</h3><p>    выбор макбука сильно отличается от выбора похожего ноутбука на Windows. В частности, очень часто люди покупают себе    макбуки с маленьким количеством памяти. Давайте подробнее про мои характеристики и почему я не выбрал другую комбинацию.</p><p>    Мой макбук 2017 года на 13 дюймов с 256 гб без тачбара цвета Space Gray. Во-первых, найти объявление с большим    количеством памяти зачастую дороже и сделать это сложнее, потому что люди чаще себе покупают 256 или 128 гигабайт    памяти.</p><p>    Во-вторых, я выбрал 13 дюймов, потому что хотел себе маленький ноутбук для решения своих задач. Еще с макбука 2014 года    я понял, что 15 дюймов это слишком много. Если требуется больше дюймов — я сажусь за стационарное устройство, к которому    подключен монитор на 24 дюйма.</p><p>    В-третьих, мой макбук без тачбара, я искал ноутбук именно с кнопками, а не с тачбаром. Я считаю, что тачбар — лишний    элемент, который только мешает, а не упрощает использование. Но в каждом случае для каждого человека все может быть    по-другому, и я даже знаю людей, которым действительно нравится тачбар.</p><p>    В заключение: могу рекомендовать макбук 2017 года к покупке! Всем удачи.</p><p class='post--main-more'>16.04.23 12:00</p>",
		"year_publish": "2023"
	},
	{
		"id": "have-airpods",
		"title": "AirPods Pro — стоит купить?",
		"class": "Техника",
		"link": "https://news.dybka.ru/airpods-pro-is-it-worth-the-money",
		"description": "Наушники AirPods Pro получили популярность из-за бренда Apple, который их выпускает, а также из-за нового формфактора — наушники-затычки, а не вкладыши. Благодаря обновлению наушников они получили дополнительный функционал: шумоподавление и эффект «Прозрачность». Давайте же выясним, в чем их уникальность.",
		"content": "<h1>AirPods Pro — стоит потратиться?</h1><p>Наушники AirPods Pro получили популярность из-за бренда Apple, который их выпускает, а также из-за нового формфактора —наушники-затычки, а не вкладыши. Благодаря обновлению наушников они получили дополнительный функционал: шумоподавление иэффект «Прозрачность». Давайте же выясним, в чем их уникальность.</p><h3>Удобство подключения</h3><p>Конечно же, я хотел бы начать с удобством подключения наушников. Магия Apple прослеживается во всем, даже в такойбанальной вещи, как подключить устройство по Bluetooth. И даже здесь у Apple есть чему поучится.</p><p>Во-первых, наушники к, например, телефону подключаются очень быстро, достаточно просто поднять крышку. А если наушникиновые, то они распознаются телефоном как новые наушники, и будет предложено ассоциировать данные наушники с вашимиустройствами.</p><p>Следующий шаг, когда у вас в ушах AirPods Pro, и вы пересаживаетесь с телефона за макбук — наушники поймут, что вы«переключили» устройство, и теперь вы пользуетесь макбуком. Вам не нужно будет ничего делать, на макбуке появитсяуведомление о подключении наушников к устройству. После подключения наушниками останется только пользоваться.</p><p>Тоже самое работает, если с макбука сесть обратно за телефон или достать iPad. Именно такого понимания слова«экосистема» я хотел добиться от устройств одной компании.</p><h3>Звук</h3><p>Звук в наушниках достойный. Я не могу сказать, что наушники стоит брать только из-за него. Но слушать музыку здесь одноудовольствие.</p><h3>Шумоподавление и «Прозрачность»</h3><p>И теперь самое интересное — это эффекты наушников. Среди доступных эффектов имеются: шумоподавление, «прозрачность», атакже отслеживание головы.</p><p>Шумоподавление: многим известен данный эффект. С помощью шумоподавление можно избавиться от лишних шумов на фоне. И этодействительно работает так, как говорится. Вы находитесь будто в вакууме, хоть и основные и громкие звуки будетепродолжать слышать.</p><p>Но я не использую эффект шумоподавления слишком долго, иногда приятнее воспользоваться «прозрачностью».</p><p>«Прозрачность»: данный эффект уже намного интереснее шумоподавления. Эффект «прозрачность» дает возможность слушатьмузыку и разговаривать с человеком. Все дело в том, что вы будете слышать окружающее пространство так, как будто на васнет наушников.</p><p>Использование данного эффекта бывает сильно выручает, когда вам нужно слушать окружающие звуки, а также общаться счеловеком по телефону или в голосовых сообщениях. Больше не придется убирать наушники в кейс, можно делать все вместе.</p><p>Отслеживание головы: функция отслеживания головы включается во время просмотра видео в интернете. Складывается ощущение,что звук идет из телефона, но самое главное — слышите звук только вы. Это действительно интересная функция, нофактически, ей нет особого применения.</p><h2>Другой функционал</h2><p>Также во время использования AirPods Pro с айфоном вы можете слушать уведомления, которые будет озвучивать сири. Этоудобно, если вы заняты работой, а слушать уведомления нужно.</p><p>Также у вас есть возможность включить различные звуки на фон, чтобы больше внимания концентрировать на работе. Этоудобно, потому что я сам, иногда, включаю нейтральные звуки дождя на фон для концентрации и вдохновения.</p><p>Я думаю, что всем известно, но вам не нужно ставить музыку на паузу, если вы вытащите наушник из уха, музыка самапоставится на паузу.</p><p>А если вы достанете один наушник, то именно через него будет играть музыка. Об этом важно сказать, потому что, кпримеру, у наушников от Xiaomi нет такого функционала, требовалось доставать «определенный» наушник.</p><p>Также пока наушники находятся в кейсе — они не подключаются к телефону. И даже если кейс разрядится — наушники не будутподключаться к телефону, пусть это работает и не всегда. До AirPods Pro у меня были беспроводные наушники от Xiaomi,которые постоянно подключались к телефону после разрядки кейса.</p><h2>Альтернативы среди Apple</h2><p>Apple выпускала и другие наушники: AirPods 2, AirPods 3, AirPods Pro 2, AirPods Max — все эти наушники разных размеровдля разных задач. К примеру, AirPods Max — большие наушники, носить такие наушники в кармане не получится. А AirPodsобычные — это вкладыши, значит вы по умолчанию будете слышать окружающие звуки.</p><h3>Вывод</h3><p>В заключение хочу поделиться, что я рад покупкой наушников AirPods Pro. Это действительно хороший выбор наушников дляпрослушивания музыки с разным функционалом. Возможно кто-то выберет для себя другие наушники, и они ему покажутся лучше.Лично я рад выбору AirPods Pro.</p><p class='post--main-more'>20.05.23 12:00</p>",
		"year_publish": "2023"
	},
	{
		"id": "have-iphone",
		"title": "iPhone Xr",
		"class": "Техника",
		"link": "https://news.dybka.ru/the-new-generation-of-the-iphone-xr-device",
		"description": "Мне всегда было интересно опробовать новое устройство от Apple и мой выбор пал именно на iPhone Xr в связи с его популярностью и удобством. У меня получилось так, что я перешел на iPhone Xr с 6S, и моему удивлению не было предела!",
		"content": "<h1>Новое поколение устройства — iPhone Xr</h1><p>    Мне всегда было интересно опробовать новое устройство от Apple и мой выбор пал именно на iPhone Xr в связи с его    популярностью и удобством.</p><p>    У меня получилось так, что я перешел на iPhone Xr с 6S, и моему удивлению не было предела!</p><h3>Удобства</h3><p>    Face ID — очень удобная функция. У меня часто бывает ситуация мокрых пальцев, поэтому вариант с отпечатком пальца мне не    нравится. Почти все время приходится вводить пароль. А пароль мне часто приходится вводить из-за большого количества    информации, которую нужно охранять. Я смог позабыть о пароле, пока пользуюсь Face ID.</p><p>    А Face ID отрабатывает достаточно точно. У меня не было проблем, как на презентации Apple. Узнает всегда. Пусть и    бывает, что я ввожу пароль, с данной функцией я точно подружился.</p><p>    У телефона очень удобный форм фактор. Его действительно приятно держать в руке, он не режет мои руки, а дотягиваться до    краев экрана возможно, если использовать свайпы.</p><p>    Новое для меня устройство, новый процессор и новые вычислительные ядра. Работа телефона куда стабильнее и надежнее, чем    6S. У меня лучше идут игры, программы. Быстрее загружаются. И лучше отображаются. Мне это нравится, пусть я и не работаю    так много в программах на телефоне, удобство для меня — это действительно важно.</p><p>    А я полюбил челку. До этого я думал, что никогда не купил бы себе телефон с вырезом. А теперь мне очень даже нравится    челка. Но, пожалуй, именно челка. К другим «извращениям» я, пока что, не привык.</p><p>    Челка не мешает просмотру содержимого. В любом случае, с ее помощью мы видим больше содержимого, потому что сбоку от    челки помещается техническая информация.</p><h3>Почему именно iPhone Xr</h3><p>    Да, существует SE, 11 и 12. Но мой выбор пал на Xr из-за максимального количества плюсов и минимальной цены на аппарат.    На текущий момент рыночная цена устройства 16.000 рублей, в эту цену входит 100% цены телефона. И это прекрасно.</p><p>    Xr — это форм фактор текущих телефонов Apple. Потому что SE представлены в старом дизайне. А 11 почти ничем не    отличается от Xr.</p><p>    Вот уже 12, 13 и 14 — разговор о другом. Но у меня не хватило на них бюджета, да и с текущим устройством меня все    устраивает.</p><p>    Я уж не стану тут говорить, для каких задач может подойти Xr, потому что, я думаю, что каждый может сам понять для себя,    что ему нужно. В случае с iPhone Xr — на данном аппарате можно выполнять все, без исключения, и получать от этого    удовольствие.</p><p>    Я не могу пользоваться андроид-телефонами. Ни в каком виде. И забавно, я не один такой. Пускай это называется разными    словами, Apple действительно могут максимально угодить пользователю.</p><p>    Пользоваться их техникой очень комфортно. Хочется весь дом обставить в технику Apple. Важно это контролировать, потому    что есть нужные покупки, а есть ненужные.</p><p>    В заключение хочу порекомендовать телефон к покупке. До встречи!</p><p class='post--main-more'>06.02.23 12:00</p>",
		"year_publish": "2023"
	},
	{
		"id": "have-ipad",
		"title": "iPad mini 4",
		"class": "Техника",
		"link": "https://news.dybka.ru/ipad-mini-4-is-an-ambiguous-device",
		"description": "Я решил выбрать для себя планшет. Еще с детства у меня был планшет, и я очень любил играть в него. Я часто использовал именно планшет, нежели другую технику. И так получилось, что мой старый планшет сломался, а желание использовать планшеты у меня осталось.",
		"content": "<h1>iPad mini 4 — неоднозначный девайс</h1><p>    Я решил выбрать для себя планшет. Еще с детства у меня был планшет, и я очень любил играть в него. Я часто использовал    именно планшет, нежели другую технику. И так получилось, что мой старый планшет сломался, а желание использовать    планшеты у меня осталось.</p><p>    И вот я вырос и решил реализовать свою давнюю мечту — покупку планшета.</p><h3>Как выбирал</h3><p>    Прежде всего я понимал, что буду выбирать себе планшет именно фирмы Apple. По 2 причинам: у меня уже была техника Apple,    и планшеты Apple очень активно рекомендовались к покупке многими людьми. И мне стало интересно попробовать купить    планшет и для себя.</p><p>    Я подумал о форм факторе, который меня интересует. Прошлый мой планшет был диагональю 8 дюйм и это было очень удобно,    потому что планшет не превращался в лопату, но продолжал отличаться от телефона. На планшете куда удобнее смотреть видео    и пользоваться интернетом.</p><p>    Далее я стал думать о том, какой именно планшет мне стоит выбрать. Я уже решил, что буду брать iPad mini, но какого    года?</p><p>    Не успел я долго подумать, как тут случилась интересная история.</p><h3>Знакомство с iPad mini 1</h3><p>    Я продавал свою технику — псп, на которой я уже давно не играл. Псп все никак не брали, поэтому я уже решался снизить    цену. Как тут мне написал человек и предложил обменяться на iPad mini.</p><p>    Я сильно обрадовался этому факту и мы назначили технику. Именно такое случайное знакомство с iPad mini 1 и убедило меня    купить себе именно эту версию планшета, но более новее.</p><h3>Первый iPad — mini 1</h3><p>    iPad mini 1 вышел 11 лет назад. В нем нет даже 10% актуальных технологий. И пользоваться таким девайсом, честно, сложно.    Но я был рад, что у меня появился опыт использования iPad mini.</p><p>    Я не стану уделять слишком много внимания этому айпаду. Скажу, что сейчас практически не осталось версий программ,    поддерживаемых на iOS 12, которая является последней актуальной для iPad mini 1.</p><p>    Но на этом планшете очень хорошо читать различные книги или использовать планшет в качестве транслятора чего-нибудь.    Потому что стоит данный планшет дешево, и в случае чего его будет не жалко потерять или оставить без присмотра. Главное    не хранить на нем конфиденциальную информацию.</p><h3>iPad mini 4 — почему именно он?</h3><p>    Я понял, что оставаться на iPad mini 1 я не смогу. Я не могу ничего делать на этом планшете. Даже просмотр видео    является весьма затруднительным. Поэтому я решил перейти на более актуальную модель.</p><p>    И мой выбор пал на iPad mini 4, потому что цена и качество этого аппарата находятся на высоте. За небольшую стоимость вы    получаете большой набор функционала.</p><p>    В случае с производительностью, я бы порекомендовал рассмотреть mini 5 или mini 6. Например, на mini 4 у вас не    получится программировать в браузере из-за производительности, но об этом мы еще поговорим.</p><h3>Задачи для iPad mini 4</h3><p>    Лично я использую планшет для демонстрации какого-то контента, который будет неудобно смотреть на телефоне и неудобно на    ноутбуке. Планшет — это большое мобильное устройство, которым можно пользоваться как телефоном.</p><p>    Например, вместо того, чтобы доставать ноутбук, я могу взять планшет и смотреть какой-нибудь ролик именно на нем. Также    иногда бывают программы только для телефонов, и использовать некоторые из них удобнее также на планшете.</p><p>    Планшет может быть использован для тестов адаптации интерфейса. Может быть использован для обучения и ведения    конспектов.</p><p>    Активно используются айпады художниками, которые покупают для себя Apple Pencil и рисуют на планшете. К слову, Apple    Pencil, к сожалению, не поддерживается на iPad mini 4.</p><h3>    Программирование на iPad mini</h3><p>И как же я не мог не затронуть эту тему, будучи программистом. Скажу сразу — на планшете есть только базовоепрограммирование. А далее по порядку.</p><p>    Во-первых, iPad mini слишком маленький, чтобы удобно использовать IDLE для программирования. Возможно только убирать    почти весь интерфейс, но это также неудобно.</p><p>    Во-вторых, практически нет программ для программирования на iPad. И я сейчас говорю не о обучении, а о практике или    ведении своих проектов. Максимум — это пару программ, ну и сам Visual Studio Code, который поддерживается на iPad, но    является платным.</p><p>    Этот вопрос решается запуском IDLE в браузере, но Вам нужно понимать, что для этого требуется большая мощность    устройства, а в идеале процессор M1. Но если в вашем планшете установлен процессор M1, то я вижу смысл купить ноутбук на    данном процессоре и программировать на ноутбуке без проблем.</p><p>    Продолжая эту тему, у меня получалось находить хорошие клиенты SSH для планшета. Но мне просто неудобно программировать    на мобильном девайсе. Пускай и получалось установить соединение на планшете, планшет все также остается мобильным    девайсом.</p><p>    В-третьих, планшет — мобильный девайс, и у вас не получится установить большую часть нужных программ. Даже скопировать    тот же репозиторий с GitHub не представляется возможным, разве что только программирование в браузере.</p><p>    Но у программирования в браузере есть еще один большой минус — вы не сможете установить нужные библиотеки, как тот же    OpenCV. Поэтому, об этом можете забыть.</p><p>    Я вижу смысл использовать планшет для базового программирования HTML страниц или использования Python на практике для    базовых задач. На данный момент программирования на планшете практически не развито. Лично мне намного проще и надежнее    взять с собой макбук, чем программировать на планшете.</p><h3>Mac mini + iPad mini</h3><p>    Но я хотел бы уделить внимание очень невероятному сочетанию девайсов: Mac mini + iPad mini.</p><p>    В интернете я наткнулся на интересный ролик, в котором человек создает корпус для Mac mini, куда может быть установлен    iPad mini. После чего, iPad mini используется как монитор для Mac mini. И мы получаем полноценный компьютер размером с    2,5 книги.</p><p>    Я лично не использовал такой вариант и даже вживую его не видел. Но хотел бы вот что сказать: я считаю, что тогда уж    проще купить ноутбук, чем использовать такой колхоз. К тому же, функционал будет тем же, купить ноутбук проще, дешевле,    да и ноутбук может работать автономно.</p><h3>    Переход на iPad mini 5</h3><p>    На самом деле, как бы мне сильно не нравился iPad mini 4 в использовании, у меня остается желание перейти на более новую    модель iPad mini 5.</p><p>    Я не могу сказать, что полностью готов к переходу. И вообще сомневаюсь, что я когда-нибудь перейду на iPad mini 5. Но    тем не менее, изредка подобные мысли у меня пробегают.</p><p>    Роль планшетов в нашей жизни слабо определена. И именно поэтому ты скорей задумываешься над покупкой наушников, нежели    покупкой планшета.</p><p>    Желаю Вам удачи!</p><p class='post--main-more'>25.03.23 12:00</p>",
		"year_publish": "2023"
	},
	{
		"id": "have-macbook",
		"title": "MacBook Pro 2014",
		"class": "Техника",
		"link": "https://news.dybka.ru/macbook-pro-2014-13-review",
		"description": "Моя основная занятость — это программирование. Именно поэтому мне нужна мобильность, доступность и удобство устройства, на котором я программирую. Я часто могу слышать про то, что макбук — это отличный девайс для творческих людей и программистов в том числе. Попробуем разобрать, в связи с чем люди делятся подобным мнением.",
		"content": "<h1>Macbook Pro 2014 13' — обзор</h1><p>    Моя основная занятость — это программирование. Именно поэтому мне нужна мобильность, доступность и удобство устройства,    на котором я программирую. Я часто могу слышать про то, что макбук — это отличный девайс для творческих людей и    программистов в том числе. Попробуем разобрать, в связи с чем люди делятся подобным мнением.</p><h3>Как я его покупал</h3><p>    Мою модель уже не получится найти в официальном магазине или на складе в качестве остатков. Я смотрел интернет-площадки,    где люди выставляют свои старые товары на продажу. Главный плюс подобных интернет-площадок в том, что можно обзавестись    старой техникой. Но минус — на подобных площадках могут обмануть или продать устройство с техническими проблемами.    Поэтому следует осторожно подходить к покупке техники на данных рынках или доверить покупку специалисту.</p><p>    У меня получилось найти отличное объявление с рыночной ценой за аппарат. Найти не б/у устройства почти невозможно,    потому что прошло слишком много времени с момента покупки. Я купил устройство уже с некоторыми проблемами на дисплее, не    влияющие на работу. Также аккумулятор был плохо приклеен и отсутствовало 3 болта сзади на крышке.</p><h3>Есть макбук, есть устройства на Windows — что же выбрать</h3><p>    Я всегда считал, что ответ на данный вопрос для каждого человека свой. Фактически, так и есть на самом деле, потому что    огромное количество людей поддерживают макбуки, а другое количество людей отдают предпочтение Windows.</p><p>    Почему люди спорят в выборе техники? Дело в том, что макбук — более уникальное устройство, чем обычный ноутбук на    Windows. Часто получается так, что за более высокую цену в макбуке установлено меньше оперативной памяти, меньше памяти    у ssd, меньше диагональ и, казалось бы, меньше производительность в тестах по сравнению с ноутбуком на Windows за ту же    цену.</p><p>    Но вот, что я понял на своем опыте — далеко не все люди готовы отдавать большую стоимость за макбук, не понимая, почему    он так дорого стоит. Да, цена действительно большая, я бы не хотел разбирать, из чего формируется такая цена, а хотел бы    больше времени уделить сравнению со средним ноутбуком на Windows и моим макбуком.</p><h3>Критика Windows</h3><p>    Сообщу сразу, что говорить, что за модель я не стану, потому что использую свою рабочую станцию на Windows как ПК и    характеристики сильно изменены. Здесь мы говорим сугубо о моем опыте использования.</p><p>    Что является правдой: Windows — это очень нестабильная система с отсутствием анимаций и некрасивым интерфейсом. Тот    факт, что интерфейс некрасивый подтверждается тем, что уже в Windows 11 он был исправлен.</p><p>    Примерно за 3 года эксплуатации Windows я видел синий экран раз 30-40, это очень много. Появлялся он из-за самых глупых    причин, например из-за отсутствия драйверов на какой-то компонент, но синий экран не появлялся, если на экране загрузки    подождать 1-2 минуты.</p><p>    Сейчас на моей Windows текущая проблема — отсутствует английский язык. Чтобы английский язык появился, мне нужно    добавить 3 язык, после чего мой английский язык появится. Проблема в том, что он не всегда может появиться, а произойдет    это только через время. Мне не помогла переустановка Windows, поэтому мне приходится мириться с данной проблемой.</p><p>    Windows очень легко засорить, не описать насколько. Буквально через год активного использования на моем основном диске    осталось 15 гб. памяти и мне снова пришлось переустанавливать Windows, а после очищать мой диск.</p><p>    За свою жизнь Windows’сом я пользуюсь более 10-ти лет и желания ее критиковать у меня нет, я просто озвучиваю то, что    есть на самом деле. Вот например, в Windows 10 остаются компоненты с Windows XP или еще ранних версий Windows. Та же    панель управления начала «пропадать» только в Windows 11, да и то, не до конца.</p><p>    К Windows у меня действительно большое количество вопросов. Во время работы у меня возникает не малое количество    неудобств. Да, говорить о том, что Windows ужасная будет некорректно, потому что она в полном объеме позволяет мне    производить работу, пользоваться установленным железом и тестировать новые функции.</p><p>    Я не могу в полном объеме отказаться от Windows, иначе сделал бы это уже давно. Но нередко приходится заниматься    рутиной: очисткой, удалением, изменением и прочим.</p><h3>Про macOS</h3><p>    Я не могу озвучить ничего подобного про macOS. Вряд ли все дело в том, что с момента покупки макбука прошло только    полгода, потому что я уже успел воспользоваться OpenCore’ром, опробовать свыше 5-ти macOS’ей и остаться максимально    довольным в вопросе выбора техники.</p><p>    У меня нет нужны устанавливать различные системы для очистки моей macOS. Мне не нужно переустанавливать ее каждый раз,    чтобы она не засорялась. У меня нет вопросов, что моя техника «глупая», потому что мой макбук в полном объеме позволяет    мне решать те задачи, которые мне нужны.</p><p>    Пожалуй, главное отличие macOS от Windows в том, что macOS куда продуманнее и умнее. После установки программы macOS    сама предлагает удалить установочный файл. В случае установки программы из неизвестного источника macOS будет    предупреждать об этом.</p><p>    Каждый мой шаг завязан с разрешением: у программы нет возможности получить доступ к системе без моего разрешение. Любую    программу я могу удобно скачать с App Store в два клика. Программы удобно хранятся в папке и я могу получить доступ к    приложениям, как, например с моего айфона или айпада.</p><p>    Отличная оптимизация софта. Невероятное качество и удобство использования. После установки zip-архива с браузера macOS    сама разархивирует его и мне нужно будет лишь использовать папку. У меня всегда есть возможность закрыть какую-то    программу. Из-за ошибки в работе программы macOS не зависнет.</p><p>    У меня однажды случилась проблема: я открыл Safari и не мог его закрыть. Комбинация клавиш не работала, а пункт    «Завершить Safari» был недоступен. Мне пришлось выключить систему, после чего макбук предупредил меня об произошедшей    ошибки и предложил отправить отчет.</p><h3>Модель макбука</h3><p>    Мой выбор пал на Macbook Pro 13’ 2014. Не пугайтесь года выпуска, я смело решаю все задачи, связанные с    программированием, просмотром контента и прочим и не имею никаких проблем. К слову, установлена операционная система    macOS Big Sur 11.7.</p><p>    Я пользовался на этом макбуке macOS Monterey — имеются некоторые проблемы, потому что операционная система официально не    поддерживается. У меня выдавалась ошибка, связанная с хэшем основного диска и я решил отказаться от использования    официально неподдерживаемой macOS. Тем более, что есть официально поддерживаемая macOS Big Sur, между данными    операционными системами отличия минимальны и меня полностью все устраивает.</p><h3>Плюсы макбука</h3><p>    <i>Дисплей</i> макбука невероятен. Технология Retina удваивает количество пикселей дисплея, из-за чего вы не увидите здесь    пиксели. Отличная калибровка дисплея позволит получать удовольствие от цветов, которые максимально приближены к    настоящим цветам из жизни.</p><p>    <i>Клавиатура</i> оставляет лишь приятные впечатления. Если выбрать модель до 16 года, у вас клавиатура будет иного формата, с    большим ходом клавиш. Именно такая клавиатура мне нравится куда больше, потому что я привык к низкому ходу клавиш. После    16 года в макбуках устанавливались клавиатура-бабочка, которая подвержена залипаниям и имеет более низкий ход клавиш.</p><p>    С <i>аккумулятором</i> у меня не возникало проблем. Устройством комфортно пользоваться и решать задачи, не обязательно    подключая макбук к источнику питания.</p><p>    Прекрасная <i>macOS</i>, о которой я говорил много хорошего уже выше.</p><p>    Отличная оптимизация <i>программ</i>, которые в полном объеме позволят получать комфорт: монтировать, программировать, писать    текста, заниматься графикой и прочим.</p><p>    Невероятная интеграция с <i>экосистемой Apple</i>, что позволяет мне соединить мои устройства в единую коммуникацию,    обмениваться данными, использовать бесшовную отправку материалов и не испытывать никакого дискомфорта в вопросе отправки    данных.</p><h3>Проблемы данного макбука</h3><p>    Как и было сказано выше — данный макбук уже 8 лет на рынке и купить абсолютно новый девайс не представляется возможным,    с огромной вероятностью вы купите когда-то использованное устройство, так называемое б/у.</p><p>    На моем устройстве была плохо приклеена батарея к корпусу, поэтому она болталась. Исправил данный момент очень просто —    я купил двухсторонний скотч и хорошо приклеил батарею к корпусу, чтобы она больше не шаталась в корпусе.</p><p>    Я заменил термопасту на ноутбуке для лучшей производительности и меньшего нагрева.</p><p>    Также сзади на крышке отсутствовало 3 болта. Я заказал в магазине болты под свою модель ноутбука и успешно заменил их.    Будьте внимательны, чтобы вы заказали именно на свою модель ноутбука болты. Учтите, что некоторые болты крепятся под    наклоном к крышке. И еще, 2 болта будут более маленького размера — два этих болта нужно закрепить в той стороне, где    находится отверстие охлаждения.</p><p>    Все это было именно на моем устройстве, при покупке вы можете осмотреть девайс и выбрать себе устройство с меньшим    количеством дефектов. К слову, еще у меня есть желание заказать ножки для ноутбука и их тоже заменить.</p><p>    И теперь про саму модель: с момента производства данного устройства прошло много времени, из-за чего аккумулятор потерял    большое количество своей емкости и его стоит заменить.</p><p>    Самый страшный дефект, который имеется на данной модели — дисплей. И дело не в его качестве, нет, качество невероятное.    А слой, которым покрыт данный дисплей. Дисплей на данном ноутбуке ни в коем случае нельзя мочить. На него не должны    попадать капли воды или любой другой жидкости.</p><p>    На свой макбук я решил поклеить пленку на дисплей, чтобы избежать прямого попадания каплей воды или любой другой    жидкости. Если на данный дисплей попадет жидкость — дисплей начнет пузыриться и производить разводы, которые нельзя    убрать. Поэтому Вам тоже порекомендую поклеить пленку. Она не искажает цвета и не мешает его работе.</p><p>    Единственное, что я бы выделил — диагональ в 13 дюймов маловата для основном рабочей станции и в этом я убедился на    практике. Макбук невероятно удобен и комфортен. Я не могу расстаться с ним ни на минуту, но иногда возникает желание    уменьшить масштабирование интерфейса или выполнить иные операции для увеличения количества контента на мониторе.</p><p>    Решаю вопрос с диагональю с помощью подключения внешнего монитора, на котором и произвожу операции, связанные с кодом.    Именно поэтому я в полном объеме остаюсь довольным и не хочу ничего менять.</p><h3>Как я использую макбук</h3><p>    Вообще, мне пришла идея покупки легкого ноутбука после того, как я в очередной раз взял с собой свой ноутбук, который    весит порядка полутора-двух килограмм. Какое-то время назад я еще не был так сильно уверен в том, чтобы купить именно    макбук. Я просто желал себе легкое устройство, на котором мне будет удобно решать мои задачи.</p><p>    Найти действительное достойное устройство на Windows у меня не получилось, да я и не искал так долго. В итоге выбор пал    на макбук и в итоге я купил его себе.</p><p>    Как я и сказал выше, мне нужно было легкое устройство для программирования и прочих задач. Я часто отправляюсь в    «путешествие», мне не нужен ноутбук с 4090, мне достаточно просто хорошей техники, которой мне будет приятно    пользоваться.</p><p>    Иногда я пользуюсь макбуком и дома. Например, печатаю на нем текст или произвожу некоторую работу на нем. У меня есть    ноутбук, который в качестве основного рабочего устройства, к которому я подключаю клавиатуру и пользуюсь внешним    монитором.</p><h3>Заключение</h3><p>    Статья не имеет большой технической части, она направлена на ответ на вопрос «Для кого лучше всего подойдет макбук» и    «Стоит ли взять попробовать». Далеко не у каждого будут такие впечатление от покупки устройства, все зависит от самого    человека и его задачах.</p><p>    Лично я абсолютно доволен пользоваться макбуком для программирования и прочих задачах. Могу рекомендовать!</p><p class='post--main-more'>02.02.23 12:00</p>",
		"year_publish": "2023"
	},
	{
		"id": "have-macbook",
		"title": "Какие макбуки действительно стоит брать?",
		"class": "Техника",
		"link": "https://news.dybka.ru/which-macbooks-are-really-worth-getting",
		"description": "Уже год я пользуюсь техникой Apple, в том числе и ноутбуками от Apple. За это время я успел подвести топ устройств лично для себя, выбрать которые — невероятно выгодная покупка.",
		"content": "<h1>Какие макбуки действительно стоит брать?</h1><p>    Уже год я пользуюсь техникой Apple, в том числе и ноутбуками от Apple. За это время я успел подвести топ устройств лично    для себя, выбрать которые — невероятно выгодная покупка.</p><p>    Топ не будет состоять из мнения: «Берите актуальный, не пожалеете». Мой топ состоит из устройств, покупка которых не    будет превышать 900$.</p><h3>Топ 3: Макбук 2015 года</h3><p>    Хочу начать топ именно с макбука про 2015 года. Сразу скажу, что у меня был в использовании макбук 2014 года, но у них    минимум отличий, самое главное — у моего макбука тачпад физический, у 2015 года тачпад сенсорный.</p><p>    Почему устройство, которому 8 лет все еще актуально? Все дело в том, что у макбука 2015 года собрано максимальное    количество преимуществ: дисплей 2К с лучшей цветопередачей, очень удобная клавиатура и тачпад, операционная система    macOS, которая меняет понимание использования ноутбука.</p><p>    К тому же, макбук 2015 года поддерживает все программы. У макбука 2015 года, почти у единственного, есть большое    количество портов. Последняя актуальная macOS: Monterey. Устройство сочетает большое количество плюсов за маленькие    деньги. Найти на Б/У рынке устройство возможно в отличном состоянии даже в 2023 году.</p><p>    Но если говорить чуть подробнее об устройстве: дизайн макбука 2015 года в 2023 году уже старый, возможно это вызовет    дискомфорт у вас, но никак не отразиться на использовании. У этого макбука сзади еще светящееся яблоко, нет вариантов    цветов.</p><p>    Также использование устройства для некоторых задач более трудное. К примеру, программирование сайтов вызывает некоторый    дискомфорт, потому что страница сайта может подлагивать при пролистывании. Помимо этого, макбук в некоторых моментах    может зависнуть на 1 секунду.</p><p>    Программирование приложений через Xcode тоже вызывает некоторые проблемы из-за производительности устройства: программа    работает медленно. Но в свою очередь могу сказать, что у меня не вызывало проблем создавать приложения для iOS.</p><p>    Поэтому, могу рекомендовать макбук про 2015 года к покупке. Перед выбором устройства почитайте о нем подробнее,    посмотрите ролики-обзоры об этом устройстве. Перед тем, как покупать Б/У технику, почитайте правила покупки, изучите    материалы с советами при покупке техники, в том числе техники Apple и макбуков.</p><p>    Желаю удачных покупок!</p><h3>Топ 2: Макбук 2017 года</h3><p>    А мы переходим ко второму месту топа макбуков. На данное место я решил расположить макбук про 2017 года. Устройство    моложе на 2 года, чем предыдущий кандидат. У макбука про 2017 новый дизайн, есть выбор цветов. И еще многое интересное!</p><p>    Во-первых, устройство как и макбук 2015 года пользуется интересом среди людей. Найти макбук про 2017 года можно на Б/У    рынке в хорошем состоянии без проблем.</p><p>    Во-вторых, за потраченные средства вы получите отличное и актуальное устройство на 2023 год, пользоваться которым одно    удовольствие.</p><p>    Макбук 2017 года имеет варианты цветов: серебристый, «серый космос». Какой цвет выбрать решать вам. Лично я взял себе    «серый космос» — это более темный цвет, который выглядит невероятно красиво в жизни. В свою очередь, про цвет «серый    космос» часто говорят, что краска слезает, поэтому лучше выбирать обычный серебристый цвет, потому что это естественный    цвет алюминия.</p><p>    У макбука 2017 года новый тип клавиатуры — бабочка. Это очень удобная клавиатура. Пользуешься клавиатурой немного    по-другому: вместо обычного понимания значения «нажатия» на кнопку, новый тип клавиатуры бабочка кликается, а не    нажимается. Звук кликанья, а не нажатия. Это новые и интересные впечатления.</p><p>    Вместе с тем, у клавиатуры бабочка есть небольшая проблема — клавиатура может засоряться, совершать лишние нажатия,    поэтому относиться к ней стоит осторожно: чистить, протирать и продувать от лишнего. Но лично я очень доволен новым    типом клавиатуры.</p><p>    Также из некоторых минусов устройства: у макбука про 2017 года есть всего лишь пару разъемов type-c, поэтому потребуется    адаптер на usb и hdmi. Также расстояние между клавиатурой и экраном очень маленькое, из-за чего клавиатура может    оставлять свои отпечатки на экране, поэтому весь макбук нужно будет чистить от грязи.</p><p>    В остальном, макбук на 2023 год до сих пор актуален, хоть и прошло 6 лет с момента выхода. За потраченные средства вы    получаете устройство с актуальным дизайном, приятным использованием, удобной мобильностью. Вес макбука 1300 грамм. К    примеру, игровой ноутбук весит 2200 грамм — разница почти в 2 раза.</p><p>    За потраченные средства вы получите не только актуальное и красивое устройство, но еще и очень удобное и    производительное. Конечно производительность макбука 2017 года не сможет сравниться с первым местом, но и разница при    покупке достигает почти половины.</p><p>    Поэтому, решать вам, какое устройство следует выбрать для себя. Возможно вы решите, что рынок макбуков вообще не для    вас. Но в обратном случае порекомендую перед покупкой подготовиться, посмотреть обучающие видео-ролики. Видео-обзоры на    макбук 2017 года. Выберите устройство, которое отлично будет подходить именно для вас. Желаю удачи при покупке техники!</p><h3>Топ 1: Макбук 2020 года</h3><p>    И конечно же, на первом месте располагается невероятно желанный и интересный для покупки макбук — эир 2020 года на    процессоре М1. И чем же он так привлекает людей?</p><p>    Во-первых, производительность устройства за 800$ равняется с производительностью ПК за несколько тысяч долларов. Все    из-за нового процессора Apple Silicon М1 — прорыв в пространстве ARM процессоров.</p><p>    Из-за подобного решения производительность устройства возрастает в несколько раз по сравнению с предыдущей моделью. И    самое главное — устройство продолжает оставаться компактным и легким ноутбуком в вашем портфеле.</p><p>    Из-за нового процессора размер устройства никак не изменился. У данной модели исправлены прошлые проблемы, связанные с    клавиатурой. Помимо того, что производительность устройства из-за процессора М1 невероятно высока, также новый процессор    поддерживает нововведения в последних версиях macOS. К примеру:</p><p>    Все остальное вы сможете опробовать на своем собственном макбуке. В случае с макбуком эир 2020 года на М1 вы сможете    купить чуть ли не запечатанный макбук или макбук в очень хорошем состоянии, потому что с момента выхода макбука на рынок    прошло не так много времени — 3 года.</p><p>    К сожалению, лично у меня не было макбука эир 2020 года, но у меня был опыт его использования. Если вы хотите купить    устройство, которое будет поддерживаться еще несколько лет вперед — присмотритесь к макбуку эир 2020 года.</p><p>    Перед покупкой макбуке на вторичном рынке подготовьтесь, посмотрите видеоролики с советами, как покупать Б/У макбук.</p><p>    Желаю вам хороших покупок и отличного выбора техники. Удачи!</p><p class='post--main-more'>16.04.23 14:00</p>",
		"year_publish": "2023"
	},
	{
		"id": "have-iphone",
		"title": "Опыт использования iPhone 6S",
		"class": "Техника",
		"link": "https://news.dybka.ru/experience-using-iphone-6s-for-six-months",
		"description": "Недавно я писал о покупке своего макбука в качестве устройства для программирования. Изначально у меня не было желания полностью переходить на экосистему Apple, потому что думал, что мне достаточно будет одного макбука. Но как оказалось позже - переход на экосистему Apple абсолютно верный шаг.",
		"content": "<h1>Опыт использования iPhone 6S</h1><p>    Недавно я <a href='/macbook-pro-2014-13-review/'>писал</a> о покупке своего макбука в качестве устройства для программирования. Изначально у меня не было    желания полностью переходить на экосистему Apple, потому что думал, что мне достаточно будет одного макбука. Но как    оказалось позже - переход на экосистему Apple абсолютно верный шаг.</p><h3>Чем обосновывалась моя покупка</h3><p>    Я решил взять попробовать iPhone 6S из-за 2 причин: я хотел попробовать экосистему Apple и мне было интересно собрать    приложение для iOS. И мое знакомство оказалось очень приятным, что я решил полностью перейти на экосистему Apple.</p><h3>Первое впечатление от своего первого айфона</h3><p>    Продуманность системы, анимации, экосистема, продуманность приложений, отличные цвета и приятные материалы - это все,    что вы получите от устройства Apple.</p><p>    Часто говорят, что использование айфонов невероятно приятное, и в этом и правда убеждаешься на практике. То, какую    огромную работу провела Apple в полном объеме замечаешь в маленьких деталях, проработанном интерфейсе и отсутствии    неудобств.</p><p>    Я смело могу порекомендовать к покупке айфона в качестве своего основного устройства, если перед вами не стоят особые    задачи, для решений которых айфон не будет казаться таким сильным с технической стороны.</p><h3>Большие удобства iPhone 6S</h3><p>    До этого времени я пользовался лишь андроид смартфонами и знал об удобстве айфонов лишь по словам людей. Да, пускай у    меня иногда и получалось воспользоваться айфонами и даже в течении некоторого времени, данный опыт нельзя назвать опытом    использования, после которого я смогу высказываться.</p><p>    Мне действительно было интересно воспользоваться айфоном в качестве основного устройства и узнать, какие впечатления я    получу от экосистемы Apple. Также мне было интересно воспользоваться загрузкой моих проектов на айфон.</p><p>    выбрать iPhone 6S я решил из-за его актуальности, цены и размеров. Купить полностью рабочий аппарат от Apple за 10% от    цены —невероятное счастье для опыта. Вряд ли у меня получится описать невероятные качества данного аппарата, но я    постараюсь.</p><h3>Отличия айфона от телефона на андроиде</h3><p>    Прежде всего интеграция с другими устройствами Apple выполнена отлично. Да, такое есть и у других компаниях, но их    решения слабее и я не пользуюсь техникой одной компании.</p><p>    Дисплей передает цвета отлично и нет проблем с пикселями: технология Retina-экрана увеличивает количество пикселей в 2    раза, из-за чего восприятие в разы лучше.</p><p>    Тактильное удовольствие дарит все больше новых эмоций и позволяет создавать все больше и больше нового контента.</p><p>    Устройство стоит недорого, в отличие от других устройств. В связи с этим потерять или забыть устройство не так страшно и    не будет стоить Вам так дорого.</p><p>    Сзади крышка айфона выполнена из алюминия, из-за чего разбить ее не представляется возможным. А материалы приятные, и    телефон выглядит достаточно красиво.</p><h3>Проблемы iPhone 6S</h3><p>    Устройство уже весьма старое и некоторые нововведения iOS 15 для телефона весьма плохо сказываются на работоспособности    и удобстве.</p><p>    Купить полностью рабочий аппарат за адекватные деньги трудно. Скорей всего вы купите уже однажды проданный телефон или    телефон с какими-то компромиссами. К примеру, через мои руки прошло 3 iPhone 6S со следующими проблемами: на одном    телефоне не работал переключатель бесшумного режима, на одном телефоне был заменен дисплей, на одном телефоне была    батарея с 70%.</p><p>    Как сказано выше: аппарату уже достаточно много времени и за этот долгий срок батарея точно потратит огромное количество    своей емкости. Проблема в том, что в данном аппарате установлена и так маленькая по объему батарея, так она еще и    потратила большую часть своей емкости. Мое использование айфона показало, что его хватает на 3-4 часа активного    использования со 100% аккумулятором.</p><h3>Заключение</h3><p>    Данный аппарат я могу посоветовать тем, кто желает испробовать айфон в качестве основного устройства без особых    вложений. Последняя поддерживаемая iOS — 15, поэтому восприятие от устройства будет максимально. Но использовать iPhone    6s в качестве основного устройства в 2023 году не представляется возможным или будет даваться весьма трудно.</p><p class='post--main-more'>06.02.23 12:00</p>",
		"year_publish": "2023"
	},
	{
		"id": "have-macbook",
		"title": "Разница в макбуках за 3 года",
		"class": "Техника",
		"link": "https://news.dybka.ru/difference-in-macbooks-for-3-years",
		"description": "В 2022 году я купил себе первый свой макбук — макбук 2014 года. И остался очень доволен данной моделью. Буквально неделю назад, ровно год спустя я обновил свой макбук до макбука 2017 года. И сегодня я хочу сравнить две данных модели. От дизайна, до производительности.",
		"content": "<h1>Разница в макбуках за 3 года</h1><p>    В 2022 году я купил себе первый свой макбук — макбук 2014 года. И остался очень доволен данной моделью. Буквально неделю    назад, ровно год спустя я обновил свой макбук до макбука 2017 года. И сегодня я хочу сравнить две данных модели. От    дизайна, до производительности.</p><h3>Дизайн</h3><p>    Первое изменение, которое бросается в глаза — новый дизайн макбука 2017 года. И это определенно так. Добавился цвет    «Space Gray» вместе с обычным серебристым, который является естественным цветом алюминия.</p><p>    Помимо этого, ноутбук лишился почти всех портов: из 8 портов осталось только 3 или 5 (в зависимости от конфигурации).    Является ли это проблемой? На самом деле нет, 70% портов на старом макбуке 2014 года я совсем не пользовался. А проблема    в отсутствии usb решается покупкой адаптера, которым на неделе будешь пользоваться раза 2-3.</p><p>    Вместе с новым дизайном нас ожидает и уменьшение устройства: ноутбук стал меньше весить почти на полкилограмма. И это    действительно ощутимый размер. Вместе с этим, из-за изменения разъемов ноутбук в целом стал меньше по размерам. Это тоже    сильно радует.</p><p>    В блоке «Дизайн» также хочу затронуть и тот факт, что у ноутбука появились отличные динамики по бокам клавиатуры,    благодаря которым звук ноутбука стал в несколько раз лучше, чем у модели 2014 года.</p><h3>Тачпад</h3><p>    Большое обновление модели — новый тип тачпада, который является не физической кнопкой, а большим сенсором. Помимо того,    что тачпад у модели 2017 года стал в несколько раз больше, из-за чего пользоваться стало им куда приятнее: у модели 2014    года были моменты, когда не хватало размеров тачпада, то у модели 2017 года не замечается такая проблема.</p><p>    Тачпад не только стал больше, но также стал сенсорным. Это означает, что тачпад не будет нажиматься физически, а будет    считывать давление на него, после чего отдавать маленькую вибрацию в ответ, из-за чего будет складываться ощущение    полноценного нажатия.</p><p>    Еще я заметил интересный факт: нажать на тачпад можно только пальцем. Если попробовать использовать какой-то предмет, то    ничего не получится. Вот такие дела.</p><h3>Клавиатура</h3><p>    Еще одно крупное отличие макбука 2017 года от 2014 это клавиатура. На макбуке 2017 года установлен новый тип клавиатура    «бабочка». Печатать с помощью нового типа клавиатуры стало удобнее.</p><p>    Теперь клавиатура не нажимается, а кликается. Для кого-то новый тип клавиатуры может показаться непривычным. Но спустя    время удобства от использования нового типа клавиатуры куда больше, чем от использования старого типа.</p><p>    Хоть я и не могу сказать, что старый тип клавиатуры, установленный на макбуке 2014 года плохой, новый будет лучше и    удобнее в использовании. Как минимум, новый тип клавиатуры обеспечивает меньший вес и толщину устройства.</p><h3>Производительность</h3><p>    Производительность — это очень важная часть при выборе портативного устройства. И здесь снова победа за макбуком 2017    года. Новый макбук стал более производительный, чем макбук 2014 года.</p><p>    К примеру, я программировал страницу на сайте, и в случае с макбуком 2014 года при пролистывании страницы сайта она    немного зависала. В отличие от макбука 2017 года, на котором не было замечено таких проблем.</p><p>    Тоже самое и просто с пролистыванием какого-то содержимого. В случае с макбуком 2017 года все происходит быстрее,    плавнее и приятнее. Да, далеко не все анимации такие плавные, но это явно большое преимущество именно для модели 2017    года.</p><h3>Поддержка операционной системы</h3><p>    Последняя поддерживаемая операционная система для макбука 2014 года — macOS Big Sur. В случае с макбуком 2017 года у вас    есть возможность обновиться до macOS Ventura. Лично я не стал обновляться и остался на macOS Monterey. И скорей всего    или следующая или через 1 операционную систему поддержка прекратится. Все равно, это хороший результат поддержки    операционных систем для макбука 2014 и 2017 года.</p><p>    Для меня как для программиста официальная поддержка macOS Monterey означает, что у меня будут развязаны руки в    программировании приложений для iOS. Последняя поддерживаемая версия Xcode для macOS Big Sur — 13.2. Xcode 13.2    поддерживает iOS до 15.2. Это означает, что iOS 15.4 уже не будет поддерживаться Xcode.</p><p>    На самом деле, как бы это не звучало, но это действительно проблема. И нужно или обновлять макбук или ставить более    старую iOS. А поставить более старую iOS можно или через компьютер или покупая другой айфон, на котором может будет    установлена старая iOS.</p><h3>Аккумулятор</h3><p>    Когда я отработал целый день на макбуке 2017 года я удивился тому факту, что у него оставалось еще большое количество    заряда аккумулятора. Новый макбук держит заряд аккумулятора действительно лучше, чем макбук 2014 года. И хватать макбука    2017 года будет на более долгое время.</p><h3>Восприятие</h3><p>    Новый макбук 2017 года воспринимается как совсем новое устройство с большим количеством преимуществ. Практически по    каждому из параметров новый макбук изменяет впечатления от использования. И почти во всех аспектах новые впечатления    приятные.</p><h3>Еще немного изменений</h3><p>    В последнем блоке я хочу затронуть остальные отличия макбука 2017 года от макбука 2014. А также поговорить и о минусах    нового макбука, с которыми вы можете столкнуться.</p><p>    В макбуке 2014 года имеется большая проблема, связанная с дисплеем. Дело в том, что вы не можете мочить дисплей макбука    2014 года. И я говорю даже о влажной протирки дисплея.</p><p>    Дисплей макбука 2017 года не подвержен подобной проблеме. Зато задняя крышка макбука 2017 года подвержена следующей    проблеме: из-за маленькой длины шлейфа дисплея, он может перестать работать. Данный шлейф не меняется отдельно, а    происходит замена задней крышки. Как быть? Аккуратно открывать крышку, без рывков и сильных нажимов.</p><p>    Также часто жалуются на клавиатуру макбука 2017 года. Новый тип клавиатуры «бабочка» может засоряться, из-за чего могут    происходить проблемы с нажатием. Нужно аккуратно использовать ноутбук, стараться не есть вблизи, чтобы крошки не    попадали на клавиатуру.</p><p>    Про саму клавиатуру — еще более низкий ход клавиш чем обычно. Ярче всего проблемы новой клавиатуры замечались в моделях    2015-2016 года. В 2017 году многие из проблем были исправлены. Но все равно рекомендуется использовать устройство    аккуратно.</p><p>    В итоге. Макбук 2017 года действительно стоит рассматривать к покупке. Вышеизложенные плюсы в тому подтверждение. Всем    удачи!</p><p class='post--main-more'>06.02.23 12:00</p>",
		"year_publish": "2023"
	},
	{
		"id": "neural-networks",
		"title": "Нейросети: не стоит бояться",
		"class": "Разное",
		"link": "https://news.dybka.ru/neural-networks-dont-be-afraid",
		"description": "Всем привет! 2023 год начался с очень интересного открытия: стали активно появляться проекты нейросетей для различных задач: формирование текстов, создание картинок, редактирование данных.",
		"content": "<h1>Нейросети: не стоит бояться</h1><p>    «О боже! Нас поработят». Но это просто технологии развиваются…</p><p>    Всем привет! 2023 год начался с очень интересного открытия: стали активно появляться проекты нейросетей для различных    задач: формирование текстов, создание картинок, редактирование данных.</p><h2>Страх людей</h2><p>    И первое, что начинают делать люди при виде нейросетей — бояться. Люди бояться нейросетей, потому что думают, что уже    совсем скоро всех людей заменят нейросети. Но это не является таковым. Об этом мы поговорим еще позже. А сейчас давайте    обсудим большие пользы нейросетей.</p><h2>Возможности нейросетей</h2><p>    Нейросети представляют собой логическое развитие технологий в нашем мире. Конечно, нейросети — это что-то новое и    интересное для людей. Хоть и до 2023 года существовали различные роботы, технологии, которые упрощали нашу жизнь, выход    в свет ChatGPT сильно изменил мир на «до» и «после».</p><h3>Новые идеи</h3><p>    Нейросети, в основе своем, являются отличным генератором новых идей. Вы можете обратиться к нейросети за генерацией    изображения, куска текста и прочего.</p><h3>Текст</h3><p>    На примере ChatGPT вы можете создавать самые разные тексты по запросам. Достаточно просто указать нужную информацию,    которая должна находиться в тексте. Дальше ChatGPT все сделает сам. Нейросеть сможет красиво связать предложения в    тексте. Составить сводку или другую информацию.</p><p>    Это отлично может помочь для формирования хорошей базы речи, чтобы написанное было приятно читать. Происходит это из-за    того, что нейросеть старается использовать шаблоны в речи, не использует сокращения и применяет другие «трюки», чтобы    текст был сформирован наиболее логически верно.</p><h3>Генерация изображений</h3><p>    Midjourney позволяет создавать невероятные изображения, которые можно использовать, например, для своих публикаций.    Самое интересное: нейросети можно задать запрос, в котором указать, чтобы картинка была «продающей», то есть,    привлекающей внимание. Тем самым, предложенный вариант от нейросети будет продающим и привлекающим внимание.</p><h3>Редактирование данных</h3><p>    Нейросети могут убрать из изображения шум, из текста убрать воду, исправить перевод и еще много чего другого — бывает    очень полезно использовать нейросеть для какой-нибудь простой задачи.</p><h3>Избавление от шумов</h3><p>    Нейросети могут помочь избавиться от шумов, которые есть у вас в комнате. Звуки из микрофона будут обработаны    нейросетью, будет выделен ваш голос как приоритетный, из-за чего шумы на заднем фоне станут менее заметными, либо вообще    пропадут. Очень удобное и простое решение.</p><h3>«Приколы»</h3><p>    Нейросети также позволяют использовать голос другого человека для озвучки какого-то текста. Вы можете выбрать любой    голос и предложить сказать ему какую-нибудь смешную фразу. А можете предложить сказать фразу, сгенерированную    нейросетью.</p><h2>Нейросети заменят людей?</h2><p>    Сразу ответ: нет, не всех. Дело в том, что, как описано выше, нейросети помогают людям. Конечно же, простые профессии    или профессии, в которых порог входа очень низкий могут быть заменены нейросетями.</p><p>    Не стоит переживать из-за этого, потому что так было всегда: какие-то профессии приходят, какие-то уходят. Лучше стоит    задуматься, как в текущем мире можно быть полезным.</p><h2>Нейросети — роботы, а не люди</h2><p>    Все дело в том, что нейросети — это искусственный интеллект, а не полноценный человек. Из-за чего взаимодействие с    нейросетями происходит не так же, как и с людьми. Вы не можете предложить нейросети долго обрабатывать какой-то запрос.    Нейросеть не сможет сделать за вас проект. Нейросеть — это идея здесь и сейчас.</p><p>    Конечно же, нейросети будут видоизменяться, развиваться. Однажды точно появится нейросеть, которая позволит проработать    над проектом. Но человеческая сила все еще требуется, чтобы вести бизнес, разрабатывать стартапы.</p><p>    Тем более, что людям куда приятнее общаться именно с людьми. И, казалось бы, люди останутся в тех. поддержке, но далеко    не факт. Ведь если тех. поддержка происходит в виде чата, то уже и сейчас сложно определить, где человек, а где    искусственный интеллект.</p><h3>Где я использую нейросети?</h3><p>    И из интересного: как лично я использую нейросети? Прежде всего, я использую ChatGPT для формирования интересных    текстов. К примеру, на сайте медиа Special выходили статью, написанные нейросетью — это было указано в авторстве.</p><p>    Также я использую Midjourney для формирования интересных фотографий на обложку. Пока что я не успел использовать эту    нейросеть для формирования картинки для поста статьи, обязательно это исправлю.</p><h2>Будущее</h2><p>    Некоторые сейчас совсем не могут представить себе будущее, которое нас будет ожидать. Но обратите внимание, что все    время существуют какие-то изменения, инновации. Это нормальный процесс, потому что общество старается развиваться. В    обществе появляются новые решения.</p><p>    Далеко не всегда новые решения остаются у людей: некоторые новые решения остаются позади, доходят до людей с большим    опозданием. Некоторые новые решения через время стараются отменить и прочее.</p><p>    Совсем не стоит бояться чего-то и начать считывать со счетов полезность людей. Люди все еще требуются в работе. Крупные    компании хотят создать лишь видимость безопасности и того, что у них уже почти нет людей. Это не правда. Любая самая    сложная и простая система требуется в человеке, который будет проверять правильность работы системы.</p><p>    Пусть и некоторые процессы можно автоматизировать, как та же самая регистрация на сайте. Другая часть требует большое    количество нейронных связей, которые есть в достаточном количестве только у человека.</p><h2>Заключение</h2><p>    Развивайтесь, читайте книги, узнавайте новое. Не бойтесь новостей, ведь редакторы — это тоже люди, которые боятся. У    редакторов есть цель: интересным образом донести информацию. И иногда получается так, что эта информация будет донесена    не самым целостным образом.</p><p>    Поэтому, не переживайте из-за появления нейросетей. Существуют люди, которые работают в этой ограниченной области. А вы    радуйтесь своей жизни здесь и сейчас. Удачи!</p><p class='post--main-more'>08.01.24 12:00</p>",
		"year_publish": "2024"
	},
	{
		"id": "neural-networks",
		"title": "Нейросеть для проекта",
		"class": "Разное",
		"link": "https://news.dybka.ru/neural-network-for-the-project",
		"description": "Нейросети получили большую популярность после выходя ряда нейросетей, которые стали популярны для использования пользователями. Новые нейросети позволяли писать тексты — ChatGPT. Создавать картинки — Midjourney. И выполнять другой функционал, как редактировать текст, звуки и получать дополнительный функционал.",
		"content": "<h1>Нейросеть для проекта</h1><p>    Расширяем и без того большой функционал нейросетей.</p><p>    Нейросети получили большую популярность после выходя ряда нейросетей, которые стали популярны для использования    пользователями. Новые нейросети позволяли писать тексты — ChatGPT. Создавать картинки — Midjourney. И выполнять другой    функционал, как редактировать текст, звуки и получать дополнительный функционал.</p><h2>Как еще использовать нейросети</h2><p>    Помимо того, что нейросети позволяют помогать людям создавать изображения и писать тексты для постов, еще нейросети    могут быть использованы и для проектов.</p><p>    К примеру, нейросети могут анализировать изображение или видео (что и так представляет собой набор изображений). В    изображении нейросети могут искать что-то определенное.</p><p>    К примеру, нейросети можно задать на обработку определенный объект, который будет выступать в качестве метки. Это    простой метод, который позволяет считывать движение данного кода и использовать этот факт в программе.</p><p>    Вместе с этим, нейросети могут анализировать уже не определенный объект, а что-то, что может изменяться. К примеру,    нейросети могут определять объекты на столе. Уже существуют готовые и обученные модели, доступные для использования.    Данные нейросети могут помочь «называть» объекты.</p><p>    Самое интересное, что можно дать нейросетям на анализ — люди. Нейросети могут определять, где находится человек, какие    его размеры и прочие факторы. Как использовать этот факт — решать вам.</p><p>    Нейросети могут определять не только самого человека, но и отдельные его конечности. К примеру, строить сетку лица,    отслеживать изменение пальцев и прочее. Все это можно объединить в отдельную модель.</p><h2>Примеры использования</h2><p>    Первое, что приходит мне в голову — упростить разработку фильмов. Вместо костюмов для простых проектов можно    использовать 2 камеры и нейросети для анализа материалов. С помощью двух камер можно понимать перспективу. Остальную    работу выполнят нейросети.</p><p>    Можно будет очень просто заменить человека на другого или же добавить что-то уже к существующему образу. На данный    момент некоторые фильмы уже пользуются подобной моделью.</p><p>    Еще нейросети можно использовать для обработки медиа-файлов, чтобы убрать из них шум. Также можно использовать голос    существующего человека, чтобы данный голос озвучил какой-то текст. Это очень интересно, потому что можно очень простым    образом создавать новостные ленты без нужды использовать человека, который будет отвечать за озвучку.</p><p>    Еще нейросети можно использовать для отслеживания биометрии. Либо же использовать нейросети для определения подлинности    человека: попросить человека сфотографировать определенный жест, далее с помощью нейросети определить, что за жест был    показан, вместе с этим сравнить лицо человека с лицом на паспорте. Такая система уже используется, к примеру в ВК.</p><h2>Заключение</h2><p>    Список, где можно использовать нейросети можно продолжать бесконечно долго. Почитайте о какой-то сфере применения    подробнее, если вас что-то зацепило в тексте. Попробуйте упростить свою жизнь с помощь нейросетей. И не бойтесь их, ведь    они тоже вас боятся!</p><p class='post--main-more'>08.01.24 12:00</p>",
		"year_publish": "2024"
	},
	{
		"id": "neural-networks",
		"title": "Нейросети и продажи",
		"class": "Разное",
		"link": "https://news.dybka.ru/neural-networks-and-sales",
		"description": "Продажи в интернете — это всегда история «на тоненьком». То человек не хочет покупать. То непонятно, как правильно отвечать.",
		"content": "<h1>Нейросети и продажи</h1><p>    Продажи в интернете — это всегда история «на тоненьком». То человек не хочет покупать. То непонятно, как правильно    отвечать.</p><h2>Помощь от нейросетей</h2><p>    Нейросети — это интересная технология, которую стоит использовать и применять в своих проектах. Они отлично могут    помочь, чтобы сформировать текст для описания товара.</p><h2>Текст от нейросетей</h2><p>    Задача для нейросетей: сформировать название и описание для товара.</p><h3>Название</h3><p>    Требуется сформировать название. Для этого требуется дать задачу для нейросети, описать, что должно быть в названии.    Название чего описывается. И самое главное — это максимальная длина названия. Она тоже должна быть соблюдена.</p><p>    Название должно кратко отражать суть товара. В описании лучше не писать длинные слова: «гигабайт», «золотого цвета» и    т.д.</p><h3>Описание</h3><p>    Следующая задача — это описание. Отличное описание товара — залог успеха продаж. С описанием товара все сложнее. В    описании есть ограничения по длине, но оно не является ключевым. Ключевое — это затронуть как можно больше моментов.</p><p>    Плохое описание, это то описание, в котором почти ничего не сказано. Лишь основная информация: «Продается телефон…»,    «Связывайтесь в личные сообщения» и т.д. В таком описании нет смысла.</p><p>    Сформулируйте описание с помощью нейросети. Уберите лишнюю воду из описания, но красивые предложения можете оставить.    Используйте абзацы в качестве логических разделителей: используйте тематические блоки, чтобы читателю было проще    цепляться за факты вашего товара.</p><h2>Остальное</h2><p>    Остальная часть формирования заявки товара — это красивые фотографии, правильные факты и прочее. Но это не входит в    данную статью.</p><h2>Завершение</h2><p>    Спасибо, что прочли данную статью. Оставайтесь вместе со Special.</p><p class='post--main-more'>08.01.24 12:00</p>",
		"year_publish": "2024"
	},
	{
		"id": "",
		"title": "Кто выбирает Apple",
		"class": "Разное",
		"link": "https://news.dybka.ru/who-chooses-apple",
		"description": "Прежде всего Apple любят из-за их отличного подхода к созданию техники. Каждый выпускаемый продукт продуман и проработан на славу. Пусть и у Apple были примеры с провальными решениями, эта компания остается на первых местах из-за качества выпускаемых продуктов.",
		"content": "<h1>Кто выбирает Apple</h1><p>    Попробуем разобраться в статье.</p><p>    Прежде всего Apple любят из-за их отличного подхода к созданию техники. Каждый выпускаемый продукт продуман и проработан    на славу. Пусть и у Apple были примеры с провальными решениями, эта компания остается на первых местах из-за качества    выпускаемых продуктов.</p><p>    Для каждого Apple представляет что-то свое. Каждый найдет свои минусы и свои плюсы. Для кого-то причина купить себе    макбук — удобно. Для кого-то причина отказаться от покупки — цена.</p><h2>Аргументы «за»</h2><p>    Я считаю, что Apple — это компания, которая понимает своего конечного потребителя. Выпускаемые продукты стараются    создаваться именно для конечного потребителя. Исходя того, чем он пользуется сейчас. И думая о будущем, что ему может    потребоваться через некоторое время.</p><p>    Благодаря данному подходу продукты Apple до сих пор имеют большую популярность. А доля рынка продолжает лишь расти. И у    продуктов Apple есть действительно большое количество плюсов. Все их не перечислить, но на основных остановиться можно.</p><h3>Качество материалов</h3><p>    Безусловно, любая техника разрабатывается из лучших материалов. Невероятные тактильные ощущения. Каждый раз, когда    берешь какой-то продукт от Apple в руки, хочется начать создавать. Это отличный стимул, чтобы продолжать работу. Ведь    каждое новое нажатие приносит большое удовольствие.</p><h3>Экосистема</h3><p>    Благодаря Apple у меня больше нет проблемы, как перекинуть какие-то материалы с телефона на ноутбук. Все    синхронизируется очень просто, практически настраивать не требуется.</p><p>    С айфона я получаю сообщения на макбук и на айпад. У меня есть возможность позвонить или написать кому-то, не обращаясь    для этого к айфону. Любые получаемые уведомления приходят на любую технику.</p><h3>Оптимизация</h3><p>    У Apple есть все возможные ресурсы, чтобы добиться максимальной оптимизации техники. И в районе 2012 года это было    большим преимуществом айфона над андроидом. Айфон, банально, не лагал, и им было приятно пользоваться.</p><p>    Тоже самое можно сказать про любую другую технику. Мой макбук отлично работает в 2023 году. Устройство, которому скоро    исполнится 10 лет, до сих пор пользуется популярностью среди людей — макбук 2014 года.</p><h3>И другие причины</h3><p>    Существуют и другие причины: удобная клавиатура, отличный звук, великолепный дисплей, retina-дисплей, красивые анимации    и «магия Apple». У человека, который выбирает себе технику от Apple, не будет проблем, чтобы найти аргументы в сторону    покупки девайса. А что насчет тех, кому не понравилась техника от Apple?</p><h2>Аргументы «против»</h2><p>    Сколько людей — столько и мнений. С этим не поспоришь. Именно поэтому для некоторых людей перечисленные выше аргументы    вовсе и не являются аргументами. Но какие именно проблемы обычно являются аргументами, чтобы не купить себе технику    Apple.</p><h3>Цена</h3><p>    Очевидно, что за хорошую технику должна быть назначена большая цена. Тем более за такую технику, как от Apple. И именно    цена является первым аргументом, чтобы не покупать себе технику от Apple.</p><h3>Не желают привыкать</h3><p>    Если цена не является причиной отказаться от покупки, то для некоторых причиной будет отсутствие желания привыкать к    новой технике. Большую роль играет тот факт, что многие начинают преимущественно с андроида и виндовс, поэтому дело    привыкания тоже имеет большое значение при выборе техники.</p><h3>Закрытость операционных систем</h3><p>    Пусть на macOS это сильно не играет роли, то вот на iOS — это большая проблема при переходе с андроид. Ведь на iOS нет    возможности скачивать программы с интернета. Вернее будет сказать, что реализовано это совсем по-другому, намного более    тяжело и неудобно.</p><p>    На iOS нет возможности установить «apk» файл на телефон и воспользоваться приложением. Если скачивать через интернет —    то это большая проблема, с большим количеством костылей. Поэтому многие пользователи отказываются от данного решения.</p><h3>Игры</h3><p>    Да, игры для кого-то это тоже аргумент. Лично я бы выбрал такой вариант совокупности: макбук 2017 + PS5. Но многие    пользователи собирают себе ПК. На ПК можно и работать в программах и играть в игры. Что нельзя сказать про macOS. И дело    тут не только в слабости железа, практической отсутствии оптимизации, но и отсутствие поддержки игр на macOS.</p><p>    В теории, на макбук можно установить виндовс и играть в игры через макбук, но люди зачастую выбирают вариант с ПК или    PS5.</p><h2>Каждому свое</h2><p>    И несмотря на аргументы, каждый волен выбирать сам, что ему подойдет лучше. И нельзя поспорить с человеком, который    решил выбрать себе технику от Apple. Или же если человек решил выбрать что-то другое.</p><p>    Каждый волен выбирать то, что подходит ему лучше всего. И это правильно. Совершайте правильные поступки и радуйтесь.    Удачи!</p><p class='post--main-more'>08.01.24 12:00</p>",
		"year_publish": "2024"
	},
	{
		"id": "",
		"title": "Babka On The Hunt Light — неживой проект",
		"class": "Разное",
		"link": "https://news.dybka.ru/babka-on-the-hunt-light-lifeless-project",
		"description": "Babka On The Hunt Light должен был стать проектом, который заменит основную игру Babka On The Hunt.",
		"content": "<h1>Babka On The Hunt Light — неживой проект</h1><p>    Babka On The Hunt Light должен был стать проектом,    который заменит <a href='/babka-on-the-hunt'>основную</a>    игру Babka On The Hunt.</p><p>    По началу именно так всё и шло: я активно разрабатывал игру.    Но я столкнулся с проблемами, которые привели к большим проблемам.</p><h2>    Начало проблем</h2><p>    Прежде всего, почему проект Babka On The Hunt Light неживой проект,    я не смог исправить проблемы основной игры, а просто хотел «закрыть»    их другой игрой.</p><p>    Но я не смог исправить эти проблемы в Babka On The Hunt Light. Конечно же,    эти проблемы начали появляться и в новой игре Babka On The Hunt Light.    К сожалению, создать проект мечты у меня не получилось. Не хватило сил,    возможностей и времени.</p><h2>    Главные проблемы</h2><p>    Мы переходим к основному: главным проблемам, из-за которых я выгорел, и не    смог нормально завершить разработку проекта:</p><p>    Я тратил много времени на игру. Получал мало эмоций. В итоге выгорел от всего этого.</p><h2>Как избежать моих проблем</h2><p>    Прежде всего, давайте себе время на отдых. Не стоит уделять все свободное время разработке.</p><p>    Если учитесь создавать игры — учитесь разрабатывать на разных проектах. Отходя от старой идеи,    я смог лучше учиться.</p><p>    Если чувствуете, что у вас нет желания разрабатывать, дайте себе время отдохнуть. Не стоит    просто менять проект, а смените ремесло. А лучше всего полностью отойти от дел на пару дней,    потом медленно начать возвращаться.</p><p>    И самое главное — не создавайте «наполеоновские» планы по созданию «самой лучшей игры».    Лучше сделайте что-то маленькое и интересное.</p><p class='post--main-more'>02.10.23 16:00</p>",
		"year_publish": "2023"
	},
	{
		"id": "",
		"title": "Почему я устал разрабатывать игры",
		"class": "Разное",
		"link": "https://news.dybka.ru/why-am-i-tired-of-developing-games",
		"description": "Итак, в 2019 году я начал учиться разрабатывать игры. Считайте, это был первый раз, когда я начал создавать проекты для изучения программирования. Они называются пет-проектами.",
		"content": "<h1>Почему я устал разрабатывать игры</h1><p>    Всем привет, уже давно не писал статьи на своем ресурсе, и немного отвык от этого.    Буду надеяться, что статьи будут получаться интересными.</p><p>    Итак, в 2019 году я начал учиться разрабатывать игры. Считайте, это был первый раз,    когда я начал создавать проекты для изучения программирования. Они называются    <a href='/pet-project-development-what-is-it-and-for-what/'>пет-проектами</a>.</p><h2>    Начало в мобильной разработке</h2><p>    Начало пошло довольно уверенно: я вполне хорошо стал изучать C#, придумывал новые идеи для игр,    прям «горел» этим занятием.</p><p>    Каждый новый день я изучал что-то новое в языке программирования. Мне было интересно развивать    мой <a href='/babka-on-the-hunt'>первый</a> игровой проект — Babka On The Hunt.</p><h2>    Первые проблемы</h2><p>    И на этом фоне у меня начали появляться проблемы новичка:</p><p>    Все мои ошибки приводили к их накоплению, а не исправлению. Ключевой вещью оказалось то,    что я решил заняться «обновлением» игры.</p><p>    Я не смог разобраться с накопленными проблемами моей игры. Я подумал, что смогу их избежать,    если просто начну разрабатывать <a href='/babka-on-the-hunt-light-lifeless-project'>новый</a> проект —    Babka On The Hunt Light.</p><h2>    Babka On The Hunt Light</h2><p>    Проект Babka On The Hunt Light должен быть стать улучшенной версией игры Babka On The Hunt.</p><p>    Проблемы начались уже с самого начала разработки: я уделял слишком много времени этому проекту.    Мне очень сильно хотелось за короткий срок создать мобильную игру. Это не было целью проекта,    я просто спешил с разработкой.</p><p>    Каждый день после школы я приходил и разрабатывал игру. Добавлял что-то, улучшал и так далее.    Самые главные минусы этого подхода: это неэффективно и это бессмысленно.</p><h2>    Итог с Babka On The Hunt Light</h2><p>    Закономерный итог проекта: я выгорел из-за его разработки. Я <a href='/how-i-fight-against-burnout/'>писал</a>    статью, как бороться с выгоранием. В тот момент, когда я проходил это, мне очень сильно помогли бы советы.</p><p>    Итого: ребят, не «живите» разработкой, прежде всего старайтесь распределить время. Удачи!</p><p class='post--main-more'>02.10.23 14:00</p>",
		"year_publish": "2023"
	},
	{
		"id": "php",
		"title": "PHP ЖИВ?",
		"class": "Разное",
		"link": "https://news.dybka.ru/php-is-alive",
		"description": "PHP или ПэХэПэ — массовый и популярный язык программирования, на котором реализуются различные сайты и CMS системы. Язык программирования получил популярность из-за удобства создания на нем сайтов и backend-частей сайтов.",
		"content": "<h1>PHP ЖИВ?</h1><p>    PHP или ПэХэПэ — массовый и популярный язык программирования, на котором реализуются различные сайты и CMS системы. Язык    программирования получил популярность из-за удобства создания на нем сайтов и backend-частей сайтов.</p><p>    Но по мере жизни за PHP тянется большой и негативный след: «PHP мертв в &lt;вставьте_год&gt;, им уже не стоит пользоваться».        Так ли это на самом деле? Постараемся выяснить в статье.</p><h2>Основа PHP</h2><p>    Начнем с начала, PHP — язык программирования для работы на сервере. PHP позволяет реализовать обращение к базе    данных, работать с сессиями, сохранять параметры в cookie, подключать модули и создавать большие платформы.</p><p>    PHP многие любят из-за большого количества готовых методов для реализации. И это абсолютная правда. Когда ты    начинаешь сталкиваться с PHP, вбиваешь задачу в интернет, тебе выдается ответ, что в PHP уже существует функция,    которая выполняет нужную задачу. Максимум, что требуется сделать — это подключить нужную библиотеку. А в обычном    случае достаточно будет вызвать эту функцию.</p><h2>Много проектов на PHP</h2><p>    На PHP работает действительно большое количество проектов. Больше половины сайтов реализованы преимущественно на    PHP. Нельзя просто так взять и отказаться от PHP. Потому что в данном языке программирования есть все нужное, чтобы    создавать отзывчивые платформы.</p><h2>Мой опыт разработки на PHP</h2><p>    Я и сам реализовывал большое количество платформ с backend-сервером на PHP. Это хороший и удобный язык    программирования. У меня не было проблем с PHP. Все нужные задачи, которые мне требовалось решать, я мог решать с    помощью PHP. Если функционала PHP вам недостаточно или хочется попробовать что-то новое, то существуют фреймворки и    готовые CMS системы.</p><h2>Laravel и PHP</h2><p>Существует фреймворк Laravel для разработки на PHP. Laravel позволяет реализовать крупные платформы на PHP. Laravelрасполагает уже готовыми и настроенными решениями. Достаточно просто установить фреймворк, выполнить базовуюнастройку и приступить к работе.</p><p>    С помощью Laravel можно управлять сессиями, cookie, работать с базами данных, скриптами, методами, формами, данными    и многим другим. С помощью Laravel можно сразу писать готовые unit-тесты.</p><p>    Мой опыт использования Laravel не самый приятный. У меня возникало большое количество проблем с фреймворком, поэтому    я решил отказаться от его использования. От фреймворка я отошел в сторону разработки на «чистом» PHP.</p><h2>WordPress и PHP</h2><p>    Большую роль в формировании популярности PHP сыграла CMS-система WordPress. WordPress позволяет удобным образом    создавать сайты на PHP. Для установки WordPress достаточно скачать CMS-систему с сайта, загрузить на домен. Всю    остальную настройку требуется проходить через браузер.</p><p>    В некоторых случаях даже на сайт WordPress заходить не требуется. Достаточно в ISPManager выбрать установку    WordPress, и CMS-система будет установлена у вас на сайте.</p><p>    Для разработки сайта требуется использовать интерфейс, для получения доступа к которому требуется авторизоваться под    учетной записью админа. У вас есть возможность удобным образом выбирать готовые темы для настройки. Вы можете    создавать страницы для сайта. Писать посты. Интегрировать плагины для удобной работе на сайте.</p><p>    Вся информация о WordPress будет храниться в базе данных. Поэтому, даже если вы полностью удалите WordPress с вашего    сайта, получить доступ к страницам сайта можно будет. К сведению, именно благодаря данному способу были    восстановлены посты в архиве медиа Special.</p><h2>Почему не любят PHP</h2><p>    PHP не любят по разным причинам. Существует большое количество языков, которые хорошо подходят для решения    собственного ряда задач. И у каждого из этих языков есть свои минусы и плюсы. Люди сами выбирают, какой язык    программирования им больше нравится, какой язык программирования они станут учить.</p><p>    В случае с PHP мнение, что PHP — плохой язык программирования и что его не любят многие разработчики — в большей    мере лишь популярное мнение, которые не имеет ничего общего с действительностью. На PHP даже в 2023 году можно    отлично решать самые разные задачи.</p><p>Но у PHP существует ряд не совсем внятных структур, к примеру:</p><p>Возможно PHP получил негативную популярность из-за WordPress. Возможно из-за большой популярности и некоторойсложности обучения из-за отсутствия структуры.</p><h3>Заключение</h3><p>    Все вышеперечисленное для кого-то будет являться причиной вернуться в Python или C#. Кто-то задумается над тем,    чтобы попробовать PHP. Каждый разработчик волен выбирать язык программирования самостоятельно. Потому что в основе    хорошего кода лежит сам разработчик, а уже после тот язык программирования, на котором пишется программа.</p><p>Пишите хороший код, зарабатывайте деньги, читайте медиа Special. Удачи!</p><p class='post--main-more'>20.05.23 12:00</p>",
		"year_publish": "2023"
	},
	{
		"id": "market",
		"title": "Как успешно продавать на Б/У рынках",
		"class": "Разное",
		"link": "https://news.dybka.ru/how-to-sell-on-buy-markets",
		"description": "У вас есть старый девайс, который просто лежит и пылится. А вы хотите получить за него средства? Просто отдать его в магазин — плохой вариант. Скупки тоже не очень, вы получите слишком мало за товар. Поэтому в силу вступают Б/У рынки, на которых вы можете самостоятельно продавать. Разберем стратегию продаж на популярных интернет-площадок.",
		"content": "<h1>Как успешно продавать на Б/У рынках</h1><p>У вас есть старый девайс, который просто лежит и пылится. А вы хотите получить за него средства? Просто отдать его вмагазин — плохой вариант. Скупки тоже не очень, вы получите слишком мало за товар. Поэтому в силу вступают Б/У рынки, накоторых вы можете самостоятельно продавать. Разберем стратегию продаж на популярных интернет-площадок.</p><h3>Не продавайте товар скупкам</h3><p>С начала может показаться, что скупки — это отличный вариант, чтобы быстро продать какой-то товар. Но не стоит спешить сэтим вопросом.</p><p>Скупки — это очень плохой вариант, чтобы продать технику. Потому что вам заплатят максимум 70% от реальной стоимоститовара, это еще в лучшем случае. Обычно платят от 15% до 45%.</p><p>К тому же, в скупках работают люди, которые разбираются в технике. И, вероятно, они захотят еще сильнее снизить ценупокупки вашего товара. Потому что скупки работают именно на этом: разница между продажей и покупкой и есть прибыль.</p><h3>Выбирайте несколько площадок</h3><p>Будьте готовы, что вам нужно будет выставлять объявление через несколько площадок. Пусть среди них будет только 1крупная, все равно не стоит упускать это из внимания.</p><p>Конечно, не стоит доходить до того, чтобы расклеивать объявления по улицам, но не стесняйтесь предлагать купить ваштовар, например, знакомым.</p><h3>Правила продаж</h3><p>Перед тем, как продавать — почитайте правила размещения товара именно на данной площадкой. Вам обязательно нужно бытьзнакомым с этим, чтобы вас не заблокировали.</p><p>Если вы нарушите правила определенной площадки — вас могут заблокировать без возможности разблокировки. Это очень плохо,если вы указывали до этого свои паспортные данные. Из-за блокировки вы будете терять трафик на ваш товар.</p><h3>Представляем товар</h3><p>Теперь нам нужно представить сам товар. Давайте пройдемся по 4 пунктам более подробно: название, описание, фотографии,видео.</p><p><b>Название</b>: оно должно содержать ключевые слова товара. Название: «Продаю телефон дешево айфон iPhone» плохое,потому чтоне отражает суть товара. Лучше написать: «iPhone 6S розовый 128 комплект» — меньше слов, больше дела. Из названия сразупонятно, что за товар. Также понятны его основные характеристики.</p><p>Товар среди всего большинства будут искать именно по ключевым словам. Поэтому старайтесь не использовать бессмысленныеслова, по типу «Продаю телефон» или «Хорошая модель». Говорите конкретно.</p><p><b>Описание товара</b>: напишите максимум уникальной информации именно для вашего товара. Укажите все егохарактеристики:название модели, цвет, объем памяти. Также не будет лишним указать статистику, скорость работы. Проведите для моделинекоторые сравнения, тесты. Укажите это в описании. Не стоит указывать в описании: контактные данные, ссылки, другиеобъявления, цену, место встречи.</p><p>Все, что нужно для связи и информирования будет заполнено в других графах. К ним мы еще перейдем.</p><p><b>Фотографии</b>: вместе с названием, это самая важная часть объявления. Если у вас нет хорошей камеры — позовитедрузей, нестесняйтесь. Не бойтесь выйти на улицу с товаром.</p><p>Делайте красивые фотографии. С первой фотографии покажите работу устройства. Делайте такие фотографии, чтобы можно былорассмотреть товар. Также не бойтесь использовать стиль. Делайте фотографии во время использования товара. Покажитепокупателю, как товар будет виден для окружающих.</p><p>Если у вас есть 2 одинаковых товара — не поленитесь сделать уникальные фотографии для каждого из них. Первая фотографияобъявления должна показывать, что за товар вы продаете. Из всего списка фотографий вы можете 1-2 уделить на информацию,можете использовать графические редакторы, чтобы разместить на фотографиях текст.</p><p>Не стоит заполнять фотографии лишними данными: пользователи на фотографиях хотят увидеть товар. Все остальное они поймутсами. Достаточно дополнительно в описании указать некоторые приятные характеристики: «хорошие тактильные впечатления»,«быстрая работа» и прочее.</p><p><b>Видео</b>: почему-то многие продавцы ленятся снимать видео-обзор их товаров на продажу. Это является большой ошибкой.Потомучто человек при покупке товара будет рассматривать его по фотографиям. наличие видео — большой плюс к покупке.</p><p>Не поленитесь снять видео о вашем товаре. В видео по максимуму показывайте товар. Если на фоне у вас есть голос —добавьте субтитры, которые будут видны пользователю. В описании к видео укажите ссылку на объявление. Название укажитетакое же, которое писали до этого.</p><h3>Остальная информация для покупателей</h3><p>Также в объявлении вам следует указать следующую информацию: характеристики в отдельное поле, модель устройства, цену,место встречи, связь с вами.</p><p>Характеристики и название модели — просто указывайте ваши данные устройства. Это полезно указывать, чтобы упользователей была возможность использовать фильтры.</p><p>Цена — указывайте ту цену, которая вас интересует, добавив к ней 5-7%. Проценты требуется добавлять для 2 возможностей:вы сможете продать технику чуть дороже, и если придет пользователь, который хочет скинуть цену — он скинет явно меньшеиз-за вашей небольшой наценки. Но в таком случае в описании укажите возможность торга.</p><p>Место встречи — указывайте место встречи — ближайшее к вам метро. Желательно, чтобы до метро вы могли быстро добраться.Делается это для того, чтобы до дома вам было быстрее добираться в случае неуспеха сделки.</p><h3>Заключение</h3><p>После того, как вы указали все о товаре, через время его опубликуют. И тогда вам нужно будет общаться с покупателями.Если за неделю вам поступает слишком мало предложений — вы можете немного скинуть цену, это может сыграть роли.</p><p>Помните, что про общение с покупателями я <a href='/communication-with-clients-on-the-internet/' target='_blank'>писал</a>отдельную статью. Почитайте ее, это будет полезно. И удачи вам впродажах!</p><p class='post--main-more'>16.04.23 12:00</p>",
		"year_publish": "2023"
	},
	{
		"id": "market",
		"title": "Общение с клиентами в интернете",
		"class": "Разное",
		"link": "https://news.dybka.ru/communication-with-clients-on-the-internet",
		"description": "Почти каждый из нас понимает, что общение с клиентами — это первое составляющее продаж. Ведь человек хочет получить товар, а мы хотим его продать. И нам следует ответить на вопросы или предложения покупателя. Но каждое предложение покупателя стоит рассматривать?",
		"content": "<h1>Общение с клиентами в интернете</h1><p>    Почти каждый из нас понимает, что общение с клиентами — это первое составляющее продаж. Ведь человек хочет получить    товар, а мы хотим его продать. И нам следует ответить на вопросы или предложения покупателя. Но каждое предложение    покупателя стоит рассматривать?</p><h3>Начало общения</h3><p>    Для начала, вам не следует нервничать и задавать кучу вопросов покупателю. Это может являться причиной отказа вам в    покупке товара. Если ваша задача продать товар — вы должны быть уверенными в его актуальности и причины покупки. А    значит и нервоз вам ни к чему.</p><h3>Дополнительная информация</h3><p>    Если клиент попросил дополнительную информацию — смело давайте ему ответ. Не следует отвечать «Фото в профиле» или    «Посмотрите в интернете». Ведь если человек хотел бы узнать информацию в интернете, то открыл бы браузер, а тут он    написал именно вам. Многие понимают важность дополнительных вопросов, но не понимают значимость ответов на них.</p><p>    Из опыта я рекомендую собрать некоторую дополнительную информацию заранее и загрузить ее на облако. А к облаку давать    доступ по запросу или оставить ссылку в описании. Люди могут обращаться к вам только в последнюю очередь. И ссылка в    описании точно не будет лишней, но если ссылка будет кликабельной.</p><h3>«А обмен интересует?»</h3><p>    Пускай вы в описании напишите о том, что обмена нет, вам все равно будут писать люди с такими предложениями. Просто    вежливо отказывайте им: «Здравствуйте, к сожалению, но обмена для данного товара нет. Большое спасибо».</p><p>    И если у вас есть товар, который вы хотели бы обменять — попробуйте его предложить в качестве альтернативы. Если    покупатель захочет — он обратится к вам с предложением.</p><h3>Клиент как рыбка: может уйти</h3><p>    Помните, что клиент всегда может уйти. Может у него есть другое предложение, более интересное чем ваше. Возможно клиент    просто больше не может вести беседу. Все может быть.</p><p>    Не стоит паниковать из-за этого и считать минуты, как долго вам не пишут. Но клиентов же нужно запоминать, предлагать им    что-то? Да, и сейчас мы об этом поговорим.</p><h3>Помните клиентов, они это любят</h3><p>    Покупатели очень любят, когда о них заботятся — для успешных продаж это в обязательном порядке должно быть слоганом    ваших продаж. И ведь правда, всегда приятно, когда к вам обращаются исходя ваших интересов: может красный цвет? Размером    чуть побольше?</p><p>    Не забывайте клиентов: записывайте их в отдельную таблицу. Конечно, каждого не запомнишь. Но даже парочку клиентов могут    составить хороший чек или пригласить доброжелательных покупателей-знакомых.</p><h3>Наглость клиента</h3><p>    Если к вам обращаются неуважительно — вы можете попросить изменить отношение к вам. В конечном счете, если клиент    откажется, вам придется его заблокировать. И ничего страшного в этом нет. Не нужно блокировать каждого неугодного. Но и    терпеть к себе плохое отношение — тоже плохой вариант.</p><p>    Помните: не бывает плохих людей. Вы же не знаете, что случилось у человека. Не отвечайте ему злом на зло. Если не    получается вести адекватную беседу — попросите покинуть диалог в таком состоянии, пригрозив блокировкой.</p><p>    Если у вас есть возможность и желание — вы можете внести человека в черных список, навечно отказав ему в покупках. Но я    считаю, что это следует делать в случае со сталкерством: когда от вас чего-то требуют с разных аккаунтов.</p><p>    В любом из случаев, хоть несколько раз в месяц, но вам придется терпеть не самых приятных людей в общении. Помните это.</p><h3>Предлагайте</h3><p>    Не бойтесь предложить чего-то. Напишите покупателю, что именно эту модель выбирают чаще всего. Или же сообщите об    обновлениях: клиента точно это должно порадовать, и он может назначить встречу.</p><p>    В любом из случаев, человек может не знать, с каким предложением ему следует обратиться к вам. Помогите клиенту. Будьте    для него будто бы друг, который не обманет и предложит самое лучшее.</p><h3>Скидки</h3><p>    Не стоит сразу же отказывать в скидках. Это было моей ошибкой, когда на скидку я сразу же отвечал отказом, ведь с    клиентом нужно уметь вести общение. Скидка для вас обоих как крючок — для вас интерес поднять его, а для клиента    опустить. Сыграйте на этом — вы можете указать, что не можете опустить цену ниже из-за определенных причин. Но если    клиент возьмет дополнительный товар — скидка может быть предоставлена.</p><p>    Конечно, скидка для продавца это не самый приятный процесс. Но если сравнивать цифры, то 2 продажи в 15000 будут куда    приятнее, чем их отсутствие. Используйте скидку как инструмент в своих руках.</p><h3>Назначение встречи</h3><p>    Первое, что порекомендую — указывать место сделки исходя из 2 фактов: недалеко от дома, но не возле дома.</p><p>    Зачем назначать сделку недалеко от дома? Все для того, чтобы вам не было обидно, если сделка не состоится. У вас интерес    продать технику. А покупатель должен приехать к вам и осмотреть товар. Будет действительно плохо, если дома вы    что-нибудь забудете.</p><p>    На своем месте я могу пойти на встречу, но не ехать куда-нибудь, чтобы назначить встречу. Будут и другие клиенты,    которые будут готовы приехать на встречу в указанное время.</p><p>    А не возле дома, банально, для безопасности. После вопроса «А вы где живете?» в случае проблем с товаром вы можете    ожидать к себе гостей.</p><p>    И пускай это может быть только в «мечтах», я бы все равно не стал рисковать и назначать встречи у дома. Максимум — это    из-за большой техники, не называя точный адрес. Ведь рядом с вами может быть несколько зданий, и какие именно из них ваш    дом — неизвестно.</p><h3>Доставка</h3><p>    Доставка — это весьма опасно, если вы пользуетесь сервисами по типу Авито доставки. Потому что проблема данного типа    доставки в том, что вас могут обмануть. Если пользоваться обычной доставкой — то тут нет проблем: 100% предоплата, в    случае чего человек может вернуть товар, оплачивая посылку.</p><p>    Но что же именно не так с Авито доставкой? На момент ее запуска хотелось решить проблему, что продавцы кладут не тот    товар, который продают: отличаются или характеристики или сам товар. Но теперь из-за попытки решения данной проблемы    страдают уже сами продавцы.</p><p>    Как работает Авито доставка: покупатель оплатил товар, перечисленные средства находятся у Авито. Продавцу нужно прийти в    отдел почты, оформить посылку и отправить ее на указанный адрес. И уже здесь прослеживается первый тип обмана: человек    просит отправить на отличный адрес, из-за чего посылка не приходит на адрес, который указан в системе, оформляет возврат    средств, имеет товар и средства.</p><p>    Но если с адресом нет проблем, то посылка доходит до покупателя. Ему требуется распаковать ее, проверить и указать, все    ли верно. Если все верно — деньги перечисляются продавцу, а если имеется какая-то проблема — оформляется возврат, товар    отправляется назад продавцу, деньги остаются у покупателя.</p><p>    И проблема в том, что покупатель может открыть посылку, забрать товар, положить другой. И уже ничего и никому не    докажешь. Вроде бы Авито обещает покрывать расходы. Но достаточно вбить 3 слова: «Авито доставка обман» и понять, как    обстоят дела на самом деле.</p><p>    Пользоваться ли Авито доставкой или нет — выбор за вами. Я лишь озвучил мнение.</p><p>    Желаю вам удачи в общении с клиентами.</p><p class='post--main-more'>16.04.23 12:00</p>",
		"year_publish": "2023"
	},
	{
		"id": "market",
		"title": "Б/У рынок: что это, с чем его едят?",
		"class": "Разное",
		"link": "https://news.dybka.ru/used-market-what-is-it-with-what-it-is-eaten",
		"description": "Сегодня постараемся разобраться в вопросе Б/У рынка. Из чего формируется Б/У рынок. Какие существуют площадки для покупки техники. И что делать, если хочу что-то купить, что уже не продается в магазинах.",
		"content": "<h1>Б/У рынок: что это, с чем его едят?</h1><p>    Сегодня постараемся разобраться в вопросе Б/У рынка. Из чего формируется Б/У рынок. Какие существуют площадки для    покупки техники. И что делать, если хочу что-то купить, что уже не продается в магазинах.</p><h3>Каждый человек — сам себе продавец</h3><p>    В начале стоит тот факт, что для продажи на Б/У рынке от вас требуется только товар. Для того, чтобы начать продавать,    вам не требуется начальник, который будет управлять всем общением, всеми транзакциями.</p><p>    вы сами определяете, как общаться с клиентом, как строить свой бизнес. Именно с помощью Б/У рынка у вас есть возможность    начать свой небольшой бизнес по продаже техники.</p><h3>Плюсы Б/У рынка для покупателя</h3><p>    У Б/У рынка есть плюсы для продавца и для покупателя. Важно: человек может быть как продавцом, так и покупателем.    Фактически, все люди покупатели, и лишь некоторые из них продавцы. Во время продажи техники я могу связываться по поводу    покупки техники с другими продавцами. Это никак не мешает моему делу.</p><p>    Какие же есть плюсы для покупателя. Вы можете:</p><p>    Все это — очень выгодные плюсы для покупателя. В основном, к Б/У рынку люди обращаются по причинам отсутствия товара на    полках, по разным причинам. Или это товар эксклюзив или это товар уже не продается в магазинах.</p><h3>Риски при покупке</h3><p>    Но у Б/У рынка есть и свои минусы. Конечно же, более выгодная покупка начинает манить покупателя. И именно здесь    покупатель может столкнуться с обманом — самый главный минус Б/У рынков.</p><p>    И не всегда обман из-за желания нажиться на покупателях. Иногда обман происходит из-за невнимательности или незнания    продавца. Такое тоже может быть, когда человек просто плохо понимает в технике и указал неверные данные в описании    товара. А в описании товара могут быть любые характеристики, они никак не проверяются на подлинность.</p><p>    Очень часто фактор обмана отталкивает людей от покупок на Б/У рынках. Но я считаю, что это больше плюс, чем минус.    Давайте разберемся.</p><h3>Б/У рынок учит самостоятельности</h3><p>    Как уже упоминалось выше — большой риск при покупке на Б/У рынках — это риск обмана. Когда вместо телефона вам    отправляют фен. Для кого-то это может играть отталкивающий фактор. Но я считаю, что это должно стать стимулом изучения    техники, подготовке к ее проверке.</p><p>    При покупке на Б/У рынках перед вами стоит задача проверить работу устройства. Вы можете обсудить с продавцом, будет ли    у него возможность задержаться на проверку. И уже после вы можете запускать разные программы для проверки работы    устройства.</p><p>    Для того, чтобы проверить устройство на работоспособность вы должны понимать, какие характеристики у данного устройства,    что требуется проверить на работоспособность, также, какие есть минусы и уязвимые части у техники.</p><p>    Все это предстоит проверить перед покупкой. Важно: ваша проверка должна проходить в спокойной обстановке. В случае чего    обратитесь к продавцу. Не стесняйтесь проверять даже самые незначительные элементы.</p><p>    Именно благодаря этому вы будете лучше разбираться в технике, сможете лучше искать ее неисправности. И в целом, будете    более уверенными и самостоятельными.</p><h3>Существующие площадки</h3><p>    Для продажи техники существуют разные площадки, самые крупные из них это Авито, Юла. Существуют еще и другие площадки, в    других регионах, странах и прочее.</p><p>    Фактически, Б/У рынок — это такой же рынок, как и любой другой рынок. Я назвал именно интернет-площадки. Но, к примеру,    Горбушка — такой же Б/У рынок, как и Авито, причем, в полном понимании слова рынок.</p><p>    Существует разное количество рынков, всех их перечислить не получится.</p><p>В заключение хочу пожелать удачных продаж, успехов при покупке техники на Б/У рынках. Удачи!</p><p class='post--main-more'>16.04.23 14:00</p>",
		"year_publish": "2023"
	},
	{
		"id": "progs",
		"title": "Путь программиста — это трудный путь?",
		"class": "Разное",
		"link": "https://news.dybka.ru/the-path-of-a-programmer-is-a-difficult-path",
		"description": "Вопрос, поставленный в заголовке кому-то может показаться скорее риторическим, чем правда требующим ответа. Но скорей вопрос несет в себе не смысл ответа «Да» или «Нет», а более глубокое изучение вопроса трудности деятельности программиста.",
		"content": "<h1>Путь программиста — это трудный путь?</h1><p>    Вопрос, поставленный в заголовке кому-то может показаться скорее риторическим, чем правда требующим ответа. Но скорей    вопрос несет в себе не смысл ответа «Да» или «Нет», а более глубокое изучение вопроса трудности деятельности    программиста.</p><p>    Перед началом следует разобраться, кто такой кодер, а кто такой программист. Кодер — человек, отвечающий за написание    кода. Когда вы изучаете какой-то материал и повторяете его — вы кодер, от слова «код».</p><p>    А программист — человек, решающий технические вопросы с помощью программирования. Главное отличие кодера от    программиста, как я считаю, в том, что кодер не придумывает решение задачи и не продумывает их техническое составляющее.</p><p>    Если говорить более умным языком: кодер работает по заранее заданному алгоритму, а программист отвечает за разработку    данного алгоритма.</p><h3>Трудности на начале пути</h3><p>    Ответить однозначно на вопрос нельзя, ведь каждого ждет свой особенный путь. Но что могу выявить из своего опыта…</p><p>    На начале изучения программирования и определенного языка программирования программист может думать, что знает и    понимает уже все программирование. Да, во-многом это проявляется и в других ответственных задачах во время изучения, но    исключать влияние этого факта будет неправильным.</p><p>    Совсем не изучив алгоритмы, а пройдя только по основам программист может перестать увлекаться техническими задачами для    решения, потому что будет думать, что уже все знает. Как вы понимаете — это ошибочное мышление. Стоит продолжать изучать    язык программирования и через время вы сможете понять, что действительно не знаете и большей части задач, которые    требуется изучать и решать.</p><p>    Лично я столкнулся с некоторой неприятной проблемой, о которой могут говорить различные информационные материалы в    интернете, рассуждая о проблемах, которые будут ждать программиста.</p><h3>Что программиста будет ждать в будущем</h3><p>    Лично я могу выделить некоторый интервал на начале, когда изучение станет очень трудным. Вы попадете в некоторую «яму».    Данная проблема характеризует неопределенность в дальнейшем пути изучения программирования. Вы не будете понимать, что    Вам нужно делать. Что изучать. Что пробовать.</p><p>    В некоторых случаях данная «яма» может быть вызвана тем, что вы недостаточно глубоко изучили основы языка    программирования, а сразу же идете изучать какой-нибудь крупный фреймворк данного языка программирования, который    полностью строится на основах данного языка программирования.</p><h3>Выгорание</h3><p>    Наверное самое страшное, что может ждать программиста — выгорание. Только пройдя через него можно говорить, что это    такое. На своем пути я уже успел 2 раза выгореть от проекта.</p><p>    Хочу сразу сказать, что далеко не все программисты знают, что именно это такое. В основном, связано это с тем, что    данное явление заметить ну очень трудно.</p><p>    выгорание для кого-то может быть похоже с простой усталостью. Но если обычную физическую усталость можно нейтрализовать    обычным отдыхом, то вот как поступить с моральной усталостью? Разберем чуть позже.</p><p>    Чем отличается выгорание от обычной усталости? Сказать точно не могу. Стоит бояться и того и того для того, чтобы    избежать возможное выгорание. Дело в том, что выгорание является первой ступенью будущей депрессии. Стоит осознавать    серьезность данной проблемы.</p><h3>Как бороться с перечисленными проблемами</h3><p>    Прежде всего я порекомендую создать интервал времени, которое вы сможете выделять на программирование. С какого и до    какого часа Вам лично разрешено заниматься программированием. Данный временной интервал поможет избежать ночных    посиделок на ноутбуком. В любом случае, лишь 20% кода, написанного ночью вы оставите в проекте.</p><p>    Также очень полезным будет совет отрываться от рабочего места. И именно от рабочего места. Следует просто сменить    атмосферу. Например, можно выйти на улицу, поехать куда-нибудь или отправиться в другую комнату. Не стоит пренебрегать    данным советом, ведь работа сможет быть более успешной вплоть до 40%.</p><p>    Борьба с выгоранием: заметить выгорание заранее трудно, но возможно. Как только у вас в голове возникает желание    отдохнуть от проекта или вы понимаете, что немного устали программировать — данные сигналы стоит зафиксировать и начать    действовать. Если у вас совсем нет сил что-либо делать — нужно оторваться от всех дел до того момента, как вы заново не    станете «гореть» по любимому делу.</p><h3>Выгода и плюсы</h3><p>    Если у вас есть много сил на работу, но именно это дело вас не привлекает, а решать вопрос нужно, то есть 2 пути: решать    вопрос через силу или начать делать дела, близкие к задаче. Спустя четырех лет активного программирования я отдаю больше    предпочтения второму способу, но разберем последствия каждого из случаев.</p><p>    Если вы будете решать вопрос через силу — ваш код будет слабым, скорей всего вы будете использовать или уже готовые и    придуманные решения или ваши решения не будут надежными. И в итоге вы успешно доведете себя до выгорания и Вам придется    делать долгую паузу во всем программировании.</p><p>    Если вы станете решать близкие задачи к той, что перед вами стоит, вот какие плюсы вы сможете получить: вы будете решать    задачу, вы не станете уставать, вы будете отдыхать от того дела, от которого вы устали. В общем — тут одни плюсы!    Поэтому я порекомендую делать именно так.</p><p>    В завершении я хотел бы пожелать любому человеку побольше сил и поменьше усталости. Удачи!</p><p class='post--main-more'>01.01.23 12:00</p>",
		"year_publish": "2023"
	},
	{
		"id": "progs",
		"title": "История live.creagoo.ru",
		"class": "Разное",
		"link": "https://news.dybka.ru/project-development-history-live-creagoo-ru-its-forced-closure",
		"description": "Начнем с основ, проект live.creagoo.ru — это история изучения фреймворка Bootstrap. После CMS WordPress у меня появилось острое желание заняться оптимизацией сайта, а для этого требовался контроль за разработкой. Я смог получить контроль, создавая сайт самостоятельно.",
		"content": "<h1>История проекта live.creagoo.ru</h1><p>Начнем с основ, проект live.creagoo.ru — это история изучения фреймворка Bootstrap. После CMS WordPress у меня появилосьострое желание заняться оптимизацией сайта, а для этого требовался контроль за разработкой. Я смог получить контроль,создавая сайт самостоятельно.</p><h3>Для чего используется Bootstrap</h3><p>Bootstrap несет в себе заранее написанные стили и некоторые решения, использующие JavaScript. С помощью Bootstrap можносоздавать адаптивные сайты, без написания «базовых» стилей.</p><p>Использовался Bootstrap в связи с тем, что с его помощью можно достаточно быстро создать простой сайт. Этим я и решилпользоваться и стал изучать Bootstrap. Мое изучение Bootstrap отразилось в создании проекта live.creagoo.ru.</p><h3>Первые страницы, созданные для проекта live.creagoo.ru</h3><p>Прежде всего стоит сказать, что проект live.creagoo.ru разрабатывался для игровой студии Creagoo, в которой я руковожу.Первые страницы — это страницы игровых проектов, описания команды и история разработки логотипа. Это все базовыестраницы, без которых масштабный сайт не может существовать.</p><h3>Блог в проекте live.creagoo.ru</h3><p>Далее я стал вести в разработке и другие решения. Например, я разработал свой блог уже в 2020 году. Представлял онсобой обычную базу данных, вместе с языком программирования PHP, с помощью которого производилось подключение к базеданных и управление записями из таблиц.</p><h3>Персонализация контента — личный кабинет проекта live.creagoo.ru</h3><p>После я решил вести в разработке свой личный кабинет, который я смог довести до ума только спустя 2 года в проекте<a href='//id.creagoo.ru'>аквариум</a>. Личный кабинет — это простое тестовое задание, проверяющее умение программиста управлять данными длясохранения прогресса и персонализации контента для него.</p><p>В создании своего первого личного кабинета я смог совершить не малое количество ошибок, которые были сохранены вфинальной версии. Даже спустя долгое время разработки все равно появлялись ошибки, которые мешали работе системы. Ноесли отладить и исправить ошибки можно без проблем, то плохой дизайн и слабые технологические решения исправить былокуда труднее.</p><p>Подбор плохих решений для использования обосновывалось моим малым опытом в сфере web-программирования. Я старалсязаглаживать свои проблемы и не раз полностью переделывал структуру проекта. Сказать честно, это больше вредило, чемприносило пользу. В текущее время я перестал доводить проекты до «идеала», ведь это все равно невозможно. Создание«идеального» проекта является пустой тратой времени. Все, что хочется исправить сейчас следует оставить просто до лучшихвремен.</p><h3>Сообщения в проекте live.creagoo.ru</h3><p>Также было реализовано интересное технологическое решение в лице возможности вести переписку с пользователями. Тысамостоятельно выбираешь человека, с которым будешь общаться. Вводишь нужное сообщение, отправляешь, его получаетчеловек.</p><p>Все, как мы и привыкли видеть в обычных сообщениях с людьми. Мое решение отличалось плохой технической частью, о которойя уже заявлял. Мое решение требовало постоянной перезагрузки страницы. Сообщение могло отправиться несколько раз послеперезагрузки страницы. Не отображалось, когда последний раз пользователь зашел в сеть и можно ли ему сейчас написать илинет.</p><h3>Зачем я стал вести проект live.creagoo.ru</h3><p>Проект live.creagoo.ru существовал в качестве замены основного сайта. CMS WordPress предоставляло плохую техническуючасть, слабую оптимизацию и отсутствие возможности прямого редактирования сайта.</p><p>Я стал изучать Bootstrap, чтобы можно было быстро создавать сайты. У меня было мало опыта в создании своих сайтовсамостоятельно, поэтому я решил использовать фреймворк Bootstrap в качестве поддержки.</p><p>В будущем я планировал заменить текущий сайт <a href='//creagoo.ru'>creagoo.ru</a> новым решением live.creagoo.ru. Спойлер: именно это у меня иполучилось. Сейчас на <a href='//creagoo.ru'>creagoo.ru</a> расположен сайт, который я самостоятельно вел в разработке.</p><h3>Почему я решил отказаться от использования CMS WordPress</h3><p>CMS WordPress помогает вести разработку в более удобном формате. Но чаще всего, если проанализировать созданные сайты наCMS WordPress, данные сайты имеют огромное количество проблем. Начиная от плохо адаптивных сайтов, отсутствияпреимуществ у сайтов. Также данные сайты часто имеют долгую и неоптимизированную загрузку, изображения в разныхформатах, которые совсем не используются.</p><p>Из-за проблем, которые внедряет в разрабатываемый сайт CMS WordPress я решил отказаться от использования данной CMS ивполне рад этому.</p><p>В заключение я хочу сказать, чтобы вы не боялись изучать новые технологии. Не бояться чего-то не знать или не уметь. Этовсегда можно будет исправить спустя время. Если верить в свое дело — вы обязательно дойдете до успеха. Удачи!</p><p class='post--main-more'>06.02.23 12:00</p>",
		"year_publish": "2023"
	},
	{
		"id": "progs",
		"title": "С чего я начал изучать программирование",
		"class": "Разное",
		"link": "https://news.dybka.ru/how-did-i-start-learning-programming",
		"description": "Программирование — весьма интересное направление, которое получило невероятную славу в 2020 году и имеет славу до сих пор. В большей степени это связано с огромным спросом в программистах, которых становится все меньше. О удаленной работе мы поговорим позже.",
		"content": "<h1>С чего я начал изучать программирование</h1><p>    Программирование — весьма интересное направление, которое получило невероятную славу в 2020 году и имеет славу до сих    пор. В большей степени это связано с огромным спросом в программистах, которых становится все меньше. О удаленной работе    мы поговорим позже.</p><h3>Первый проект</h3><p>    Первый проект, который я разрабатывал на своих плечах, с которым мне помогал мой научный руководитель — игровой проект    Babka On The Hunt. Это другая версия игры, представленная в Google Play.</p><p>    Про данную игру я <a href='//youtu.be/lKLuwC9qb-w'>записывал</a> подкаст, в котором рассказал, как именно я разрабатывал эту игру и к чему в итоге    пришел.</p><p>    Я начинал изучать программирование с языка C. Скажу честно, это было невероятно сложно, потому что язык программирования    C даже спустя четыре года моей активной разработки не дается так просто, а я уже не говорю о том, чтобы начинать    изучение программирования именно с данного языка.</p><p>    Для того, чтобы лучше понять смысл программирования с моим научным руководителем было решено разрабатывать свой игровой    проект, с которым я выступал на конкурсах и занимал места.</p><h3>Мой первый сайт</h3><p>    Помимо наличия игрового проекта в разработке, мне всегда было интересно разработать свой сайт, которым будут    пользоваться люди. И я стал увлекаться еще и данным направлением.</p><p>    С моим научным руководителем мы настроили сервер, и я сел за разработку. Первый сайт был далеко не идеальным примером в    web-разработке, именно поэтому я быстро заменил его другими решениями, пока не дошел до CMS WordPress.</p><p>    После внедрения на свой сайт CMS WordPress я немного просел в разработке сайтов и мне сильно это не нравилось. Я очень    хотел вести свои сайты самостоятельно в разработке, чего и смог добиться после изучения фреймворка Bootstrap.</p><p>    Так я и стал вести в разработке проект live.creagoo.ru, о котором писал статью ранее. Уже к этому моменту я активно    занимался разработкой игровых проектов и web-ресурсов.</p><h3>Прочие занятия</h3><p>    Также я активно писал код и на Python’е, на котором, преимущественно, создавал алгоритмы и никогда не занимался    разработкой своей системы, потому что я всегда использовал другие языки программирования для решения своих технических    задач.</p><p>    На Python’е я писал программы для работы в консоли. Создавал web-ресурсы с авторизацией пользователя и решал задачи с    искусственным интеллектом.</p><h3>Как я познакомился с программированием</h3><p>    Все свое детство я был связан с техникой: телефонами, ноутбуками и прочими аппаратами. Меня всегда привлекало данное    направление и мне было интересно разбираться и чинить поделки.</p><p>    Мое мышление позволяло на ходу создавать невероятные вещи из лего и прочих материалов из строительства. Поэтому было    решено отдать меня на кружок по 3D моделированию, на котором я познакомился с основами, продолжал заниматься    моделированием и успел создать цифровую копию умного города.</p><p>    Да, знания в 3D моделировании мне точно пригодились и я уверен, что пригодятся в будущем. Но основное мое направление    было выбрано весьма несложно: мне предложили занять свободное время еще одним кружком, и я решил выбрать направление    программирования.</p><p>    Я уже <a href='/the-path-of-a-programmer-is-a-difficult-path/'>писал</a> статью, что ждет программиста на его пути. Я бы хотел пожелать удачи всем тем, кто только начинает    появляться в данном направлении и переходит к изучению нового для него языка программирования.</p><p>    И конечно же всем остальным я тоже хочу выразить огромную благодарность и пожелать вам всего хорошего. Удачи!</p><p class='post--main-more'>02.02.23 12:00</p>",
		"year_publish": "2023"
	},
	{
		"id": "",
		"title": "Как я борюсь против выгорания",
		"class": "Разное",
		"link": "https://news.dybka.ru/how-i-fight-against-burnout",
		"description": "В сегодняшней статье постараюсь рассказать методики борьбы против выгорания и обсудить тот факт, чем страшно выгорание и из-за чего оно появляется у людей. Чаще всего именно программисты из-за большого количества монотонной работы выгорают от своего дела.",
		"content": "<h1>Как я борюсь против выгорания</h1><p>    В сегодняшней статье постараюсь рассказать методики борьбы против выгорания и обсудить тот факт, чем страшно выгорание и    из-за чего оно появляется у людей.</p><p>    Чаще всего именно программисты из-за большого количества монотонной работы выгорают от своего дела.</p><h3>Что такое выгорание</h3><p>    выгорание — это состояние моральной усталости, из-за которого нет желания чем-либо заниматься. Выгорание — это первая    ступень к депрессии. Не стоит недооценивать это состояние, потому что борьба с выгоранием не такая простая, как с    физической усталостью.</p><p>    С физической усталостью очень легко бороться: мы просто отдыхаем, отсыпаемся и не напрягаем мышцы, из-за чего они    восстанавливаются и мы снова можем начать напрягаться. Но как быть с моральной усталостью? Состояние, когда ты ничем не    занимаешься приносит большое количества вреда, потому что от нас может многое чего зависеть и нам просто необходимо    решать задачи.</p><h3>Борьба с выгоранием</h3><p>    Первый и самый важный шаг — это определить, что у вас именно выгорание, а не простая усталость от дела. Как я сказал    выше, выгоранием часто болеют программисты, потому что в их задачи входит монотонная работа, которую нужно выполнять.</p><p>    Но это не значит, что если перед вами стоит выполнение монотонной работы — то нужно сидеть и делать только ее. Есть пару    советов, чтобы не уставать во время работы и не довести себя до выгорания:</p><p>    Да, советы не всегда рабочие, потому что бывают моменты сильного напряжения или безвыходной ситуации — нужно сделать это    дело и все. Но такие моменты заканчиваются, и после них вы сможете отдохнуть.</p><p>    Хочу пожелать поменьше выгорать в новом году. И побольше отдыхать. С эффективными результатами бизнеса. До встречи!</p><p class='post--main-more'>02.02.23 12:00</p>",
		"year_publish": "2023"
	},
	{
		"id": "php",
		"title": "Как я разрабатываю сайты на PHP",
		"class": "Разное",
		"link": "https://news.dybka.ru/how-i-develop-websites-in-php",
		"description": "За 3 года активной разработки проектов в web-среде для личного пользования и людям на заказ я вывел некоторую форму удобной сортировки проекта. Решил рассказать об этом людям, так как скоро буду менять стиль разработки.",
		"content": "<h1>Как я разрабатываю сайты на PHP</h1><p>    За 3 года активной разработки проектов в web-среде для личного пользования и людям на заказ я вывел некоторую форму    удобной сортировки проекта. Решил рассказать об этом людям, так как скоро буду менять стиль разработки.</p><h3>Структурирование проекта</h3><p>    Прежде всего стоит разобраться со структурой проекта. Какое-то время я использовал длинные названия, понятные, но из-за    них URL может удлиниться. Теперь мне больше по душе непонятные папки в духе «a», «f», «db» и прочее.</p><p>    В корне я храню .htaccess, в котором описал ссылку на страницу 404, 403 и правила, которые убирают расширение .php из    URL.</p><p>    Также в корне храню папку «i» - тут все дополнительное для сайта: шрифты, стили, скрипты и изображения. В папке «i»    расположены 4 папки: «a», «css», «img», «php».</p><p>    Начнем с конца. Папка «php» имеет внутри себя 2 папки: «c» и «m». Папка «c» сокращение от слова component - тут хранятся    части сайта: footer, header, head и прочие описанные заранее стили. Я выношу блоки в модули, как это происходит в    ReactJS из-за удобства использования.</p><p>    Папка «m» сокращение от слова module - тут хранятся обработчики событий. Например, тут я храню скрипт rb-mysql.php,    позволяющий удобно обращаться к базе данных и обработчики, к которым ссылаюсь в формах или ссылках.</p><p>    Папка «img» хранит картинки. Тут все просто, папка «logo» для логотипов и другие нужные папки, разбитые по категориям    сайта.</p><p>    Папка «css» хранит CSS стили моего сайта. В корне я храню файл app.css, в котором подключаю другие CSS-файлы с помощью    @import. Такой вариант позволяет мне полноценно работать в 1 папке, созданной для CSS стилей и не менять структуру    проекта в других его частях, тем самым усложняя.</p><p>    Удобно хранения стилей в одной папке обосновывается также и использованием такого варианта для смены темы. Вместе с    файлом app.css в корне папки «css» располагаются 2 файла: light.css, dark.css. В двух данных файлах описаны цвета,    которые я использую в проекте. В зависимости от текущей темы я подключаю нужный файл, который, в случае чего, сменит    цвета на сайте. Таким образом происходит смена темы на сайте.</p><p>    И самое интересное - папка «a» - сокращение от слова another. Чаще всего здесь я храню весь «мусор», без которого нельзя обойтись. Я редко меняю файлы и папки, хранящиеся в папке «a». Именно поэтому я вынес данные файлы и папки в папку «a». К примеру, в папке «a» я храню стили Bootstrap, шрифты, JavaScript-код и сохранения с базы данных. В случае чего можно расширить количество хранимых здесь файлов и интегрировать иные решения, нужные для проекта.</p><h3>Вспомогательные файлы, нужные для качественного сайта</h3><p>    Но просто папками и файлами PHP обойтись не получится. Да, можно создать отличный, оптимизированных с хорошей    доступностью сайт. Но помимо наличия файлов страниц, нужны также вспомогательные файлы, описывающие сайт. Данные файлы    обычный человек читать не будет, ему они не интересы. Данные файлы нужны для роботов-поисковиков, которые будут    проверять ваш сайт и проходиться по нему.</p><p>    Первый разобранный выше файл - это .htaccess. Нужен для того, чтобы, к примеру, изменить формат отображения URL-адреса.    Также .htaccess позволяет совершать и другие действия, с которыми можно ознакомиться в интернете.</p><p>    Файл sitemap.xml содержит в себе «код» в XML-формате. Данный файл хранит в себе все страницы сайта, их приоритет, время    последнего изменения страницы и частоту изменения определенной страницы. К примеру, ознакомиться с данным файлом можно    по адресу creagoo.ru/sitemap.xml.</p><p>    Также имеется файл robots.txt. В нем хранится информация для роботов-поисковиков. Ссылка на sitemap и на различную    информацию для роботов, к примеру какие пути доступны для обхода, а какие нет.</p><p>    Также следует хранить файл icon.ico. Данный файл в строке адреса позволит вывести маленькое изображение-логотип сайта.    Чаще всего данный файл нужен для уникальности страницы в выдаче.</p><p>    Не совсем файл, но все же, для добавления дополнительной уникальности страницы можно использовать акцентный цвет.    Добавляется стиль в head с названием «theme-color» и в content значение цвета в HTML-формате. Насколько мне известно,    браузер Safari считывает данную информацию и отображает в заголовке.</p><p>    Например, для медиа сайта можно использовать файл RSS. В него записывается информация о страницах. Если вы    посмотрите медиа сайты, в footer’е вы увидите ссылку на RSS-канал. Это файл, хранящий какие-то записи. Часто данный    RSS-файл можно подключить для какой-нибудь соц. сети, чтобы она отображала ваши последние страницы.</p><h3>«Чистый» PHP или Laravel</h3><p>    Мы разобрали структуру сайта, посмотрели, каким образом следует хранить файлы проекта. Теперь разберемся, какой вариант    следует использовать - просто PHP или фреймворк Laravel?</p><p>    Сообщу, что транслируемое мнение - это сугубо мой личный опыт. Если ваш опыт отличается - это отлично.</p><p>    Создание своего первого сайта я начинал именно с чистого PHP. Понятие «чистый PHP» означает, что используется язык    программирования PHP и ничего более. Разработка происходит немного трудновато, потому что отслеживаются зависимости    самостоятельно. Нет возможности интегрировать какие-то решения в свой проект.</p><p>    Laravel, вроде бы, решает данные проблемы. Позволяет писать сайты круче. Но, правды ради, я не очень смог понять смысл    Laravel’а для использования. Да, в него интегрированы тесты, лично я ими не пользуюсь, мне хватает собственного    тестирования из-за малых размеров сайтов.</p><p>    Laravel позволяет разделить ответственность на сайте: backend и frontend. Позволяет включать файлы в свой проект.    Создавать многоязычные сайты. Обращаться к базе данных. Решать проблемы быстрее.</p><p>    Но мой опыт использования Laravel ассоциировался только с болью. После каждого дня у меня переставал работать проект. Я    начинал с более поздней версии Laravel. Переустановил, но все равно были какие-то проблемы и вечные ошибки, из-за    которых мой проект не запускался.</p><p>    Мне совсем не нравилось вечно исправлять проблемы. Вся суть вот в чем: после внедрения нового решения у меня спокойно    запускался проект. Но после какого-то времени вместо запуска у меня в консоли выводились ошибки. Работу над проектом я    произвожу на рабочей станции, после проекта Laravel я ничего не менял и не удалял.</p><p>    Также и публикация проекта Laravel на сервер невероятно трудна: требуется менять зависимости, файлы. Мне было абсолютно    непонятно, каким образом можно удобно загрузить проект на сервер. Отсутствие гостеприимства и оттолкнуло меня от    использования Laravel.</p><h3>Язык программирования для обработки backend-запросов</h3><p>    Я решил выбрать язык программирования PHP для обработки backend-запросов. Выбор сделан из-за очень простой причины:    данный язык программирования развивается достаточно долго, имеет внутри себя хорошие технологические решения, упрощающие    разработку, для данного языка программирования написано не мало фреймворков, которые можно использовать. Да и в целом,    мне нравится данный язык программирования.</p><p>    Фактически, можно использовать любой интересующий вас язык программирования: Python, C++, Rust. Я не считаю, что это так    важно. Только если вы не создаете ресурс с большими оборотами пользователей или более узкой сферы использования.</p><p>    В заключение я хотел бы выделить преимущества PHP: я использую его для модульности моего проекта, в качестве    backend-обработчика. С помощью PHP можно получить возможность управлять GET-запросами и работать с формами.</p><p>    Используйте то, что Вам нравится больше всего и подходит для решения задач. Удачи!</p><p class='post--main-more'>06.02.23 12:00</p>",
		"year_publish": "2023"
	},
	{
		"id": "progs",
		"title": "Разработка pet-проектов",
		"class": "Разное",
		"link": "https://news.dybka.ru/pet-project-development-what-is-it-and-for-what",
		"description": "Стоит разобраться с самого начала, что такое pet-проект и проект в целом. Проект - это твоя придуманная идея, реализуемая технически. Если говорить более простым языком, под проектом понимается какое-то решение, какое-то приложение, сайт или игра.",
		"content": "<h1>Разработка pet-проектов</h1><p>    Стоит разобраться с самого начала, что такое pet-проект и проект в целом. Проект - это твоя придуманная идея,    реализуемая технически. Если говорить более простым языком, под проектом понимается какое-то решение, какое-то    приложение, сайт или игра.</p><p>    Для изучения программирования стоит самостоятельно разрабатывать свои проекты разной направленности, чтобы понять язык    программирования лучше и чтобы набраться больше опыта.</p><h3>Pet-проект - что это</h3><p>    Pet-проект - это такой же проект, как и обычно, но создаваемый исходя из личных интересов. Чаще всего pet-проекты нужны    для изучения какой-то новой технологии, расширения знаний и получения нового опыта в сфере программирования.</p><h3>Зачем нужно вести свой pet-проект</h3><p>    Как и сказано выше, pet-проект может помочь лучше изучить какую-то технологию, опробовать новое технологическое решение,    придумать что-то интересное или отвлечься от основной деятельности.</p><p>    Часто pet-проект не доводят до осмысленного конца, pet-проекты несут основную задачу - техническую. Изучить что-то,    что-то опробовать. Смысл создавать такой проект есть только для программиста, который и занимается разработкой проекта.</p><p>    Но pet-проект можно вывести и в формат обычного проекта, если продумать его внутреннее составляющее для других    пользователей. Часто именно так и поступают. После смены pet-проекта на полноценный проект решение может получить    достаточный спрос у пользователей и даже помочь автору заработать средства, помочь решить проблему или получать    популярность для своего имени.</p><p>    В заключение хотел бы пожелать удачи в ведении pet-проектов!</p><p class='post--main-more'>06.02.23 12:00</p>"
	},
	{
		"id": "",
		"title": "Январьский Плейлист: 5 пластинок для зимнего настроения",
		"class": "Музыка",
		"link": "https://news.dybka.ru/january-playlist-5-records-for-a-winter-mood",
		"description": "Топ 5 альбомов, которые я активно гоняю и хотел бы поделиться с вами.",
		"content": "<h1>Январьский Плейлист: 5 пластинок для зимнего настроения</h1><p>    Топ 5 альбомов, которые я активно гоняю и хотел бы поделиться с вами.</p><h2>Avalon Vales - Lauren Bousfield (LP, 2013)</h2><img src='https://news.dybka.ru/january-playlist-5-records-for-a-winter-mood/avalon_vales.jpg' alt='Avalon Vales - Lauren Bousfield'><p>    Первый Лонгплей бывших Nero's Day at Disneyland. Синтезаторы, глитчи, дрим-поп, неестественный психоделический вокал.    Красивая эстетичная меланхолия.</p><h2>Vorsa - Maybe I’m Overthinking (EP, 2019)</h2><img src='https://news.dybka.ru/january-playlist-5-records-for-a-winter-mood/vorsa.jpg' alt='Vorsa - Maybe I’m Overthinking'><p>    Минорная, искренняя электронщина, сладкие звуки музыкальной шкатулки, глубокие иструментальные дропы и лиричный текст об    излишнем количестве давящих мыслей, что может срезанировать многим.</p><h2>METRO BOOMIN PRESENTS SPIDER-MAN: ACROSS THE SPIDER-VERSE (SOUNDTRACK FROM AND INSPIRED BY THE MOTION PICTURE) (OST,2023)</h2><img src='https://news.dybka.ru/january-playlist-5-records-for-a-winter-mood/metro_boomin.jpg' alt='METRO BOOMIN PRESENTS SPIDER-MAN: ACROSS THE SPIDER-VERSE'><p>    Спустя почти полгода я смог полностью погрузиться в звёздный саундтрек нового мультфильма о паучке под продюссированием    маэстро Метро. Очень разнообразный звук: постоянно развивающиеся хип-хоп композиции сменяются афробитом и попсой, и всё    выверено высшими стандартами качества.</p><p>    Из артистов могу выделить Swaee Lee, который не сбавляет планку хитовости    припевов, а из треков - Am I Dreaming с невероятно красивым оркестром на сэмпле.</p><h2>Lana Del Rey - Born To Die (Deluxe) (LP, 2012)</h2><img src='https://news.dybka.ru/january-playlist-5-records-for-a-winter-mood/lana_del_rey.jpg' alt='Lana Del Rey - Born To Die (Deluxe)'><p>    Не нуждающаяся в представлении работа. Вкратце: революционный в своё время релиз, изменивший вектор развития поп-музыки    на пару со Старбоем Викенда. Диструктивная игра в плохую девочку, галливудские масштабы и эталонный звук.</p><h2>Blue Foundation - Life of a Ghost (LP, 2007)</h2><img src='https://news.dybka.ru/january-playlist-5-records-for-a-winter-mood/blue_foundation.jpg' alt='Blue Foundation - Life of a Ghost'><p>    Дрим-поп с примесями трип-хопа и шугейза. Ламповое, завораживающее звучание небезызвестной датской группы не утеряло    актуальности до сих пор и является эталонным путеводителем в глубину ваших размышлений.</p><p>    Я уверен, что вся перечиленная музыка согреет ваши уши и станет отличным саундтреком это холодной зимы.</p><p class='post--main-more'>Автор: Владимир Вяхирев</p><p class='post--main-more'>16.01.24 12:00</p>"
	}
]
