[
	{
		"title": "Русские Карты 2",
		"class": "Игры",
		"link": "https://news.dybka.ru/russian-cards-2",
		"description": "Это захватывающая карточная игра, разработанная специально для развития памяти и развлечения всех возрастных групп.",
		"content": "Содержимое"
	},
	{
		"title": "Babka On The Hunt",
		"class": "Игры",
		"link": "https://news.dybka.ru/babka-on-the-hunt",
		"description": "В этой увлекательной игре вы будете играть за бабушку, которая отправляется в путешествие по разным локациям России.",
		"content": "Содержимое"
	},
	{
		"title": "Sweetness",
		"class": "Игры",
		"link": "https://news.dybka.ru/sweetness",
		"description": "Sweetness – это увлекательная мобильная игра, в которой ты играешь за маленького исследователя, который путешествует по большому и неизвестному миру, чтобы найти самый сладкий сахар.",
		"content": ""
	},
	{
		"title": "Запомни Эти Карты",
		"class": "Игры",
		"link": "https://news.dybka.ru/remember-these-cards",
		"description": "Забудьте о скучных методах тренировки памяти! Теперь вы можете с легкостью и с удовольствием находиться в стиле с нашей новой игрой – Запомни эти карты!",
		"content": ""
	},
	{
		"title": "Камень Ножницы Бумага",
		"class": "Игры",
		"link": "https://news.dybka.ru/rock-paper-scissors",
		"description": "Камень, ножницы, бумага, кажется, это игра, которая знакома каждому из нас с детства.",
		"content": ""
	},
    {
		"title": "Аквариум",
		"class": "Проекты",
		"link": "https://news.dybka.ru/aquarium",
		"description": "Платформа для взаимодействия пользователей между собой.",
		"content": ""
	},
	{
		"title": "План развития Аквариума",
		"class": "Проекты",
		"link": "https://news.dybka.ru/plans-for-the-development-of-the-aquarium",
		"description": "План развития Аквариума.",
		"content": ""
	},
	{
		"title": "Попытки создать Аквариум",
		"class": "Проекты",
		"link": "https://news.dybka.ru/attempts-to-create-an-aquarium",
		"description": "Попытки создать Аквариум.",
		"content": ""
	},
	{
		"title": "Пиратки на макбуке",
		"class": "Техника",
		"link": "https://news.dybka.ru/pirates-on-the-macbook",
		"description": "В обычной жизни люди часто пользуются пиратскими программами. Далеко не всегда это только из-за отсутствия желания платить за продукт. В некоторых случаях плата за продукт слишком большая и постоянная. В других же просто нет возможности оплатить какой-то продукт.",
		"content": ""
	},
	{
		"title": "Почему я решил перейти на iPad mini 5?",
		"class": "Техника",
		"link": "https://news.dybka.ru/why-did-i-decide-to-upgrade-to-the-ipad-mini-5",
		"description": "В 2022 году я купил себе айфон и не думал больше покупать технику Apple. Через несколько недель я купил себе макбук и не думал больше покупать технику Apple. Через год я заменил айфон, макбук, купил несколько планшетов. Когда я же остановлюсь…",
		"content": ""
	},
	{
		"title": "Программирование на Айпаде",
		"class": "Техника",
		"link": "https://news.dybka.ru/programming-on-ipad-mini-5",
		"description": "Я попробовал разные айпады мини: mini 1, mini 4, mini 5. Сейчас я доволен iPad mini 5, недавно написал статью о планшете. Мой основной планшет: iPad mini 5. Мой ноутбук: MacBook Pro 2017 года.",
		"content": ""
	},
	{
		"title": "Копия или оригинал",
		"class": "Техника",
		"link": "https://news.dybka.ru/copy-or-original-which-to-choose",
		"description": "Перед людьми стоит соблазн: можно купить копию, которая будет выглядеть как оригинал, и быть «крутым». Давайте на личном примере разберем, что плохого в том, что Петя купить себе копию наушников, а не оригинал.",
		"content": ""
	},
	{
		"title": "Макбук М1",
		"class": "Техника",
		"link": "https://news.dybka.ru/macbook-m1",
		"description": "В 2021 году я мечтал о макбуке, просто макбуке. А о том, что у меня может быть макбук на М1 я даже и мечтать не мог. Тогда для меня он казался невероятно дорогим.",
		"content": ""
	},
	{
		"title": "Обзор на iPad mini 5",
		"class": "Техника",
		"link": "https://news.dybka.ru/ipad-mini-5",
		"description": "Когда-то в статье про айпад мини 4 я говорил, что не очень сильно желаю переходить на айпад мини 5. И вот, свершилось. Делаем обзор!",
		"content": ""
	},
	{
		"title": "Обзор на макбук 2017 года",
		"class": "Техника",
		"link": "https://news.dybka.ru/macbook-2017-review",
		"description": "9 апреля 2023 года у меня появился макбук 2017 года в постоянном использовании. Давайте поговорим о данном устройстве: почему я его выбрал, стоит ли брать и какие есть альтернативы.",
		"content": ""
	},
	{
		"title": "AirPods Pro — стоит купить?",
		"class": "Техника",
		"link": "https://news.dybka.ru/airpods-pro-is-it-worth-the-money",
		"description": "Наушники AirPods Pro получили популярность из-за бренда Apple, который их выпускает, а также из-за нового формфактора — наушники-затычки, а не вкладыши. Благодаря обновлению наушников они получили дополнительный функционал: шумоподавление и эффект «Прозрачность». Давайте же выясним, в чем их уникальность.",
		"content": ""
	},
	{
		"title": "iPhone Xr",
		"class": "Техника",
		"link": "https://news.dybka.ru/the-new-generation-of-the-iphone-xr-device",
		"description": "Мне всегда было интересно опробовать новое устройство от Apple и мой выбор пал именно на iPhone Xr в связи с его популярностью и удобством. У меня получилось так, что я перешел на iPhone Xr с 6S, и моему удивлению не было предела!",
		"content": ""
	},
	{
		"title": "iPad mini 4",
		"class": "Техника",
		"link": "https://news.dybka.ru/ipad-mini-4-is-an-ambiguous-device",
		"description": "Я решил выбрать для себя планшет. Еще с детства у меня был планшет, и я очень любил играть в него. Я часто использовал именно планшет, нежели другую технику. И так получилось, что мой старый планшет сломался, а желание использовать планшеты у меня осталось.",
		"content": ""
	},
	{
		"title": "MacBook Pro 2014",
		"class": "Техника",
		"link": "https://news.dybka.ru/macbook-pro-2014-13-review",
		"description": "Моя основная занятость — это программирование. Именно поэтому мне нужна мобильность, доступность и удобство устройства, на котором я программирую. Я часто могу слышать про то, что макбук — это отличный девайс для творческих людей и программистов в том числе. Попробуем разобрать, в связи с чем люди делятся подобным мнением.",
		"content": ""
	},
	{
		"title": "Какие макбуки действительно стоит брать?",
		"class": "Техника",
		"link": "https://news.dybka.ru/which-macbooks-are-really-worth-getting",
		"description": "Уже год я пользуюсь техникой Apple, в том числе и ноутбуками от Apple. За это время я успел подвести топ устройств лично для себя, выбрать которые — невероятно выгодная покупка.",
		"content": ""
	},
	{
		"title": "Опыт использования iPhone 6S",
		"class": "Техника",
		"link": "https://news.dybka.ru/experience-using-iphone-6s-for-six-months",
		"description": "Недавно я писал о покупке своего макбука в качестве устройства для программирования. Изначально у меня не было желания полностью переходить на экосистему Apple, потому что думал, что мне достаточно будет одного макбука. Но как оказалось позже - переход на экосистему Apple абсолютно верный шаг.",
		"content": ""
	},
	{
		"title": "Разница в макбуках за 3 года",
		"class": "Техника",
		"link": "https://news.dybka.ru/difference-in-macbooks-for-3-years",
		"description": "В 2022 году я купил себе первый свой макбук — макбук 2014 года. И остался очень доволен данной моделью. Буквально неделю назад, ровно год спустя я обновил свой макбук до макбука 2017 года. И сегодня я хочу сравнить две данных модели. От дизайна, до производительности.",
		"content": ""
	},
	{
		"title": "Нейросети: не стоит бояться",
		"class": "Разное",
		"link": "https://news.dybka.ru/neural-networks-dont-be-afraid",
		"description": "Всем привет! 2023 год начался с очень интересного открытия: стали активно появляться проекты нейросетей для различных задач: формирование текстов, создание картинок, редактирование данных.",
		"content": ""
	},
	{
		"title": "Нейросеть для проекта",
		"class": "Разное",
		"link": "https://news.dybka.ru/neural-network-for-the-project",
		"description": "Нейросети получили большую популярность после выходя ряда нейросетей, которые стали популярны для использования пользователями. Новые нейросети позволяли писать тексты — ChatGPT. Создавать картинки — Midjourney. И выполнять другой функционал, как редактировать текст, звуки и получать дополнительный функционал.",
		"content": ""
	},
	{
		"title": "Нейросети и продажи",
		"class": "Разное",
		"link": "https://news.dybka.ru/neural-networks-and-sales",
		"description": "Продажи в интернете — это всегда история «на тоненьком». То человек не хочет покупать. То непонятно, как правильно отвечать.",
		"content": ""
	},
	{
		"title": "Кто выбирает Apple",
		"class": "Разное",
		"link": "https://news.dybka.ru/who-chooses-apple",
		"description": "Прежде всего Apple любят из-за их отличного подхода к созданию техники. Каждый выпускаемый продукт продуман и проработан на славу. Пусть и у Apple были примеры с провальными решениями, эта компания остается на первых местах из-за качества выпускаемых продуктов.",
		"content": ""
	},
	{
		"title": "Babka On The Hunt Light — неживой проект",
		"class": "Разное",
		"link": "https://news.dybka.ru/babka-on-the-hunt-light-lifeless-project",
		"description": "Babka On The Hunt Light должен был стать проектом, который заменит основную игру Babka On The Hunt.",
		"content": ""
	},
	{
		"title": "Почему я устал разрабатывать игры",
		"class": "Разное",
		"link": "https://news.dybka.ru/why-am-i-tired-of-developing-games",
		"description": "Итак, в 2019 году я начал учиться разрабатывать игры. Считайте, это был первый раз, когда я начал создавать проекты для изучения программирования. Они называются пет-проектами.",
		"content": ""
	},
	{
		"title": "PHP ЖИВ?",
		"class": "Разное",
		"link": "https://news.dybka.ru/php-is-alive",
		"description": "PHP или ПэХэПэ — массовый и популярный язык программирования, на котором реализуются различные сайты и CMS системы. Язык программирования получил популярность из-за удобства создания на нем сайтов и backend-частей сайтов.",
		"content": ""
	},
	{
		"title": "Как успешно продавать на Б/У рынках",
		"class": "Разное",
		"link": "https://news.dybka.ru/how-to-sell-on-buy-markets",
		"description": "У вас есть старый девайс, который просто лежит и пылится. А вы хотите получить за него средства? Просто отдать его в магазин — плохой вариант. Скупки тоже не очень, вы получите слишком мало за товар. Поэтому в силу вступают Б/У рынки, на которых вы можете самостоятельно продавать. Разберем стратегию продаж на популярных интернет-площадок.",
		"content": ""
	},
	{
		"title": "Общение с клиентами в интернете",
		"class": "Разное",
		"link": "https://news.dybka.ru/communication-with-clients-on-the-internet",
		"description": "Почти каждый из нас понимает, что общение с клиентами — это первое составляющее продаж. Ведь человек хочет получить товар, а мы хотим его продать. И нам следует ответить на вопросы или предложения покупателя. Но каждое предложение покупателя стоит рассматривать?",
		"content": ""
	},
	{
		"title": "Б/У рынок: что это, с чем его едят?",
		"class": "Разное",
		"link": "https://news.dybka.ru/used-market-what-is-it-with-what-it-is-eaten",
		"description": "Сегодня постараемся разобраться в вопросе Б/У рынка. Из чего формируется Б/У рынок. Какие существуют площадки для покупки техники. И что делать, если хочу что-то купить, что уже не продается в магазинах.",
		"content": ""
	},
	{
		"title": "Путь программиста — это трудный путь?",
		"class": "Разное",
		"link": "https://news.dybka.ru/the-path-of-a-programmer-is-a-difficult-path",
		"description": "Вопрос, поставленный в заголовке кому-то может показаться скорее риторическим, чем правда требующим ответа. Но скорей вопрос несет в себе не смысл ответа «Да» или «Нет», а более глубокое изучение вопроса трудности деятельности программиста.",
		"content": ""
	},
	{
		"title": "История live.creagoo.ru",
		"class": "Разное",
		"link": "https://news.dybka.ru/project-development-history-live-creagoo-ru-its-forced-closure",
		"description": "Начнем с основ, проект live.creagoo.ru — это история изучения фреймворка Bootstrap. После CMS WordPress у меня появилось острое желание заняться оптимизацией сайта, а для этого требовался контроль за разработкой. Я смог получить контроль, создавая сайт самостоятельно.",
		"content": ""
	},
	{
		"title": "С чего я начал изучать программирование",
		"class": "Разное",
		"link": "https://news.dybka.ru/how-did-i-start-learning-programming",
		"description": "Программирование — весьма интересное направление, которое получило невероятную славу в 2020 году и имеет славу до сих пор. В большей степени это связано с огромным спросом в программистах, которых становится все меньше. О удаленной работе мы поговорим позже.",
		"content": ""
	},
	{
		"title": "Как я борюсь против выгорания",
		"class": "Разное",
		"link": "https://news.dybka.ru/how-i-fight-against-burnout",
		"description": "В сегодняшней статье постараюсь рассказать методики борьбы против выгорания и обсудить тот факт, чем страшно выгорание и из-за чего оно появляется у людей. Чаще всего именно программисты из-за большого количества монотонной работы выгорают от своего дела.",
		"content": ""
	},
	{
		"title": "Как я разрабатываю сайты на PHP",
		"class": "Разное",
		"link": "https://news.dybka.ru/how-i-develop-websites-in-php",
		"description": "За 3 года активной разработки проектов в web-среде для личного пользования и людям на заказ я вывел некоторую форму удобной сортировки проекта. Решил рассказать об этом людям, так как скоро буду менять стиль разработки.",
		"content": ""
	},
	{
		"title": "Разработка pet-проектов",
		"class": "Разное",
		"link": "https://news.dybka.ru/pet-project-development-what-is-it-and-for-what",
		"description": "Стоит разобраться с самого начала, что такое pet-проект и проект в целом. Проект - это твоя придуманная идея, реализуемая технически. Если говорить более простым языком, под проектом понимается какое-то решение, какое-то приложение, сайт или игра.",
		"content": ""
	}
]
